{
  "id": "srsec336eng",
  "sourcePdf": "srsec336eng.pdf",
  "totalPages": 262,
  "pages": [
    {
      "pageNumber": 1,
      "content": "1.Basics of  Computer\nØComputer  Organization\nØInput  and  Output  Devices\nØSystem  Software  and\nApplication  Software\nØComputer  Language\nØCompiler  and  Assembler\n2.Operating  System\nØElements  of  Windows  XP\nØDesktop  Elements\nØLocating  Files  and  Folders\nØChanging  System  Setting\nØFile  Management  in  Windows\nØInstallation  of  Software  and\nHardware\n3.Basics  of  Word  Processing\nØStarting  Word  Program\nØWord  Screen  Layout\nØTyping  Screen  Objects\nØManaging  Documents\nØProtecting  and  Finding\nDocuments\nØPrinting  Documents\n4.Formatting  Documents\nØWorking  with  text\nØFormatting  Text\nØFormatting  Paragraphs\nØBulleted  and  Numbered  Lists\nØCopying and Moving Text\nØSpelling  and  Grammar\nØPage  Formatting\nØCreating  Tables\n5.Mail  Merge\nØTypes  of  document  in  Mail\nmerge\nØCreating  data  Source\nØCreating  Mailing  Labels\nØMerging  Data  into  Main\nDocument\n6.Basics  of  Spreadsheet\nØSelecting,  Adding  and\nRenaming  Worksheets\nØModifying  a  Worksheet\nØResizing  Rows  and  Columns\nØWorkbook  Protection\n7.Formatting  Worksheets\nØFormatting  Toolbar\nØFormatting  Cells\nØFormatting  Rows  and  Columns\nØFormatting  Worksheets  Using\nStyles\nØProtect  and  Unprotect\nWorksheets\n8.Formulas, Functions and Charts\nØFormulas  and  Functions\nØCopying  a  Formula\nØTypes  of  Functions\nØTypes  of  Charts\nØAuto  Shapes  and  Smart  art\n9.Creating  Presentation\nØCreating  Slides\nØSlide  Sorter  View\nØChanging  Slide  Layouts\nØMoving  Between  Slides\n10.Introduction  to  Internet\nØGetting  Connected  to  Internet\nØTypes  of  Internet  Connections\nØInternet  Terminology\nØUnderstanding  Internet\nAddress\nØWeb  Browser  and  Internet\nServices\nSYLLABUS"
    },
    {
      "pageNumber": 2,
      "content": "Basics  of  Computer  ::  1\n \nBasics of Computer\n1.1INTRODUCTION\nIn this lesson we present an overview of the basic design of a\ncomputer system: how the different parts of a computer system\nare organized and various operations performed to perform a\nspecific task. You would have observed that instructions have to\nbe fed into the computer in a systematic order to perform a\nspecific task. Computer components are divided into two major\ncategories, namely, hardware and software. In this lesson we will\ndiscuss about hardware, i.e., the machine itself and its connected\ndevices  such as monitor, keyboard, mouse etc., as well as\nsoftware that makes use of hardware for performing various\nfunctions.\n1.2OBJECTIVES\nAfter going through this lesson you would be able to:\nlexplain basic organization of computer system\nlexplain different types of input and output devices\nldefine Software and its classification\nldistinguish between system software and application\nsoftware\nldescribe computer language and its classification\n1"
    },
    {
      "pageNumber": 3,
      "content": "2  ::  Data  Entry  Operations\n1.3 WHAT IS A COMPUTER?\nComputer is a device that transforms data into meaningful\ninformation. Data can be anything like marks obtained by you in\nvarious subjects. It can also be name, age, sex, weight, height,\netc. of all the students in a class.\nComputer can also be defined in terms of functions it can\nperform. A computer can i) accept data, ii) store data, iii) process\ndata as desired, and iv) retrieve the stored data as and when\nrequired and v) print the result in desired format.\nThe major characteristics of a computer are high speed, accuracy,\ndiligence, versatility and storage.\n1.3.1 Computer Organisation\nThe block diagram of computer is shown in Fig. 1.1.\nFig. 1.1 Block diagram of Computer Organisation\nThe computer performs basically five major operations of\nfunctions irrespective of their size and make. These are 1) it\naccepts data or instruction by way of input, 2) it stores data, 3) it\ncan process data as required by the user, 4) it gives results in\nthe form of output, and 5) it controls all operations inside a\ncomputer. We discuss below each of these operations.\n1.Input: this is the process of entering data and programs\ninto the computer system.\nInput unit\nOutput unit\nMemory Unit\nControl Unit\nArithmetic\nLogic Unit"
    },
    {
      "pageNumber": 4,
      "content": "Basics  of  Computer  ::  3\n2.Control Unit (CU): The process of input, output, processing\nand storage is performed under the supervision of a unit\ncalled 'Control Unit'. It decides when to start receiving data,\nwhen to stop it, where to store data, etc. It takes care of step\n-by-step processing of all operations in side the computer.\n3.Memory Unit: Computer is used to store data and\ninstructions.\n4.Arithmetic Logic Unit (ALU): The major operations\nperformed  by  the  ALU  are  addition,  subtraction,\nmultiplication, division, logic and comparison.\n5.Output: This is the process of producing results from the\ndata for getting useful information.\nThe ALU and the CU of a computer system are jointly known as\nthe central processing unit (CPU). You may call CPU as the brain\nof any computer system.\nINTEXT QUESTIONS\n1.What are the five basic operations performed by the\ncomputer?\n2.Define ALU, CU and CPU.\n3.Choose the correct answer.\n(a)The task of performing arithmetic and logical\noperations is called:\n(i) ALU    (ii) editing    (iii) storage  (iv) Output\n(b)The ALU and CU jointly are known as\n(i) RAM   (ii) ROM       (iii) CPU(iv) None of above\n(c)The process of producing results from the data for\ngetting useful information is called:\n(i) output (ii) input     (iii) processing (iv) storage\n1.4 PERIPHERAL DEVICES\nPeripheral devices are  connected to the computer externally.\nThese devices are used for performing some specific functions.\nPeripheral devices are as follows:\n1.Input Devices\n2.Output Devices\n3.Other Peripherals"
    },
    {
      "pageNumber": 5,
      "content": "4  ::  Data  Entry  Operations\nFig. 1.2 Different peripheral devices of Computer\n1.5 INPUT DEVICES\nInput devices accept data and instructions from the user.\nFollowing are the examples of various input devices, which are\nconnected to the computer for this purpose.\n1.Keyboard\n2.Mouse\n3.Light Pen\n4.Optical/magnetic Scanner\n5.Touch Screen\n6.Microphone for voice as input\n7.Track Ball\n1.5.1 Keyboard\nA keyboard (as shown in figure 1.3) is the most common input\ndevice. Several kinds of keyboards are available, but they\nresemble each other with\nminor   variations.   The\nkeyboard in most common\nuse is the QWERTY board.\nGenerally          standard\nkeyboard has 104 keys. In\nthese keyboards, the cursor\ncontrol keys are duplicated\nto allow easier use of the\nnumeric pad.\n \nMonitor \nKeyboard \nDisk drives \nMouse \nFig. 1.3 Keyboard"
    },
    {
      "pageNumber": 6,
      "content": "Basics  of  Computer  ::  5\n1.5.2 Mouse\nA mouse is an electro-mechanical, hand-held device (as shown\nin figure 1. 4). It is used as a pointer. It can perform functions\nlike selecting menu commands, moving icons, resizing windows,\nstarting programs, and choosing options.\nFig. 1.4 Mouse\nThe most common mouse uses an internal, magnetically coated\nball, to detect the movement of the mouse across a flat surface,\nusually a desktop. Now a days Optical or laser mouse is used to\ndetect the movement.  All windows based applications today are\ndesigned to work with a mouse. A mouse is used to replace hard\n-to-remember key combinations with easier \"Point and Click\"\nactions. However, it cannot substitute all keyboard operations.\nIt can be alternative for commands based operations.\n1.5.3 Light pen\nAn input device that utilizes a light-sensitive\ndetector to select objects on a display screen.\nA light pen is similar to a mouse (as shown in\nfigure 1.5), except that with a light pen you can\nmove the pointer and select objects on the\ndisplay screen by directly pointing to the\nobjects with the pen.\n1.5.4 Optical Scanner\nThese devices are used for automatic data collection. The\ndevices of this category completely eliminate manual input of\ndata. For example, the bar-code reader is actually just a special\ntype of image scanner. An image scanner translates printed\nMonitor \nDisk drives \nMouse \nFig. 1.5 Light Pen"
    },
    {
      "pageNumber": 7,
      "content": "6  ::  Data  Entry  Operations\nimages into an electronic format that can be\nstored in a computer’s memory, and with the\nright kind of software, one can alter a stored\nimage. Another example of scanner is optical\ncharacter recognition (OCR) device, used by\nbanks to convert the scanned image of a\ntyped or printed page into text that can be\nedited on the computer.\n1.5.5 Touch Screen\nTouch panel displays and pads are now being offered as\nalternatives to keyboard. Here the input can be given through the\ncomputer screen, that accepts the input through monitor; users\ntouch electronic buttons displayed on the screen or they may use\nlight pen.\nFig. 1.7 Touch Screen Monitor\n1.5.6 Microphone\nMicrophone is an input device, which takes voice as input. The\nvoice communication is more error-prone than information\nthrough keyboard. There are two types of microphones available\n(as shown in figure 1.8):\n1.Desktop Microphone\n2.Hand held Microphone\nFig. 1.8 Desktop microphone and Hand-held Microphone\nFig. 1.6 Scanner"
    },
    {
      "pageNumber": 8,
      "content": "Basics  of  Computer  ::  7\n1.5.7 Track Ball\nTrackball, a pointing device, is a mouse\nlying on its back (as shown in figure 1. 9).\nTo move the pointer, you rotate the ball\nwith your thumb, your fingers, or the\npalm of your hand. There are usually one\nto three buttons next to the ball, which\nyou use just like mouse buttons.\nThe advantage of trackballs over mouse is that the trackball is\nstationary so it does not require much space to use it. In addition,\nyou can place a trackball on any type of surface, including your\nlap. For both these reasons, trackballs are popular pointing\ndevices for portable computers.\n1.6 OUTPUT DEVICES\nOutput devices return processed data that is information, back\nto the user. Some of the commonly used output devices are:\n1.Monitor (Visual Display Unit)\n2.Printers\n3.Plotter\n4.Speakers\n1.6.1 Monitor\nOut of all the output devices,\nmonitor (as shown in figure\n1.10) is perhaps the most\nimportant   output   device\nbecause people interact with\nthis device most intensively\nthan    others.    Computer\ninformation  is  displayed,\nvisually with a video adapter card and monitor. Information\nprocessed within the CPU, that needs to be visually displayed,\nis sent to video adapter. The video adapter converts information\nfrom the format used, in the same manner as a television displays\ninformation sent to it by a cable service.\nFig. 1.9 Track Ball\nFig. 1.10 CRT and LCD Monitor"
    },
    {
      "pageNumber": 9,
      "content": "8  ::  Data  Entry  Operations\nTwo basic types of monitors are used with microcomputers,\nwhich are as follows:\n1.CRT\n2.LCD\nCathode Ray Tube (CRT): CRT or Cathode Ray Tube Monitor is\nthe typical monitor that you see on a desktop computer. It looks\na lot like a television screen, and works the same way. This type\nuses a large vacuum tube, called cathode ray tube (CRT).\nLiquid Crystal Displays (LCD): This type of monitors are also\nknown as flat panel monitor. Most of these employ liquid crystal\ndisplays (LCDs) to render images. These days LCD monitor are\nvery popular.\nWhen people talk about the capabilities of various monitors, one\ncritical statistic is the resolution of the monitor. Most monitors\nhave a resolution of at least 800 x 600 pixels. High-end monitors\ncan have resolutions of 1024 x 768 pixels or even 1280 x 1024\npixels. Thus monitors are available either in low resolution or in\nhigh resolution.\n1.6.2 Printer\nAfter a document is created on the computer, it can be sent to a\nprinter for a hard copy (printout). Some printers offer special\nfeatures such as colored and large page formats. Some of the\nmost commonly used printers are:\n1.Laser Printer\n2.Ink Jet Printer\n3.Dot Matrix Printer\n4.Line Printer\nLaser Printer: A laser printer produces\nhigh quality print that one normally finds\nin publishing. It is extremely fast and\nquiet. Moreover, the operation of a laser\nprinter is easy with automatic paper\nloading and no smudging or messing up\nof ink ribbons. The fastest laser printer\nFig. 1.11 Laser Printer"
    },
    {
      "pageNumber": 10,
      "content": "Basics  of  Computer  ::  9\ncan print up to 200 pages per minute in monochrome (black and\nwhite) and up to 100 pages per minute in colour.\nInk-Jet Printer: An ink-jet printer\ncreates an image directly on paper by\nspraying ink through as many as 64\ntiny nozzles. Although the image it\nproduces is not generally quite as\nsharp as the output of a laser printer,\nthe quality of ink-jet images is still high.\nIn general, ink-jet printer offers an\nexcellent middle ground between dot\nmatrix and laser printer. Like laser printer, an ink-jet printer is\nquiet and convenient, but not particularly fast.\nTypically, an ink-jet printer is more expensive than a dot-matrix\nprinter, but costs only half as much as a laser printer.\nDot Matrix Printer: The dot matrix\nprinter was very popular at one point of\ntime. It is a very versatile and inexpensive\noutput device. In dot matrix printer the\nprint head physically \"hits\" the paper\nthrough the ribbon and produces text (or\nimages) by combinations of dots; hence\nthe name dot matrix printer. Its speed is\nmeasured in characters per second\n(CPS). Although it is less expensive, it is\nlouder, slower and produces lower print\nquality.\nLine Printer: A line printer is generally\nused with large computer systems to\nproduce text based data processing\nreports. Line printers are high-speed\nprinters with speeds ranging anywhere\nfrom 100 to about 3800 lines per minute.\nIn the past, print quality on line printers\nwas   not   high.   Developments   in\ntechnology are improving the print quality\non line printers. These are in the cost\nrange of lacs of Rupees.\nFig. 1.12 Ink-Jet Printer\nFig. 1.13 Dot Matrix\nPrinter\nFig. 1.14 Line Printer"
    },
    {
      "pageNumber": 11,
      "content": "10  ::  Data  Entry  Operations\n1.6.3 Plotter\nA plotter is a special kind of output device that, like a printer,\nproduces images on paper, but does so in a different way. Plotters\nare designed to produce large drawings or images, such as\nconstruction plans for buildings or blueprints for mechanical\nobjects. A plotter can be connected to the port normally used by\na printer.\nAn array of different colored pens in a clip rack and a robotic arm\nis part of plotter. The instructions that a plotter receives from a\ncomputer  consist  of  a  color,  and  beginning  and  ending\ncoordinates for a line. With that information, the plotter picks up\nthe appropriate pen through its arm, positions it at the beginning\ncoordinates drops the pen down to the surface of the paper and\ndraws to the ending coordinates. Plotters draw curves by creating\na sequence of very short straight lines.\nPlotters usually come in two designs:\n1.Flat Bed: Plotters of small size to be kept on table with\nrestriction of paper size.\n2.Drum: These plotters are of big size using rolls of paper of\nunlimited length.\nFig. 1.15 Flat bed and Drum Plotter\n1.6.4 Speaker\nSpeakers (as shown in figure 1.16) are\nanother type of output device, which\nallow you to listen to voice like music,\nand conversation with people.\nFig. 1.16 Speaker"
    },
    {
      "pageNumber": 12,
      "content": "Basics  of  Computer  ::  11\nINTEXT QUESTION\n4.Write True or False for the following:\n(a)Mouse is an output device.\n(b)OCR stands for Optical Content Reader.\n(c)LCD Monitor is used in notebook computer.\n(d)Speed  of  DOT  Matrix  Printer  is  measured  in\nCharacters Per Second.\n(e)Plotters are used to produce high quality drawings\nand images, such as construction plans for buildings\nor blueprints for mechanical objects.\n1.7 SOFTWARE\nAs you are aware, computer cannot do anything on its own. It is\nthe user who instructs computer; what to do, how to do and when\nto do. In order to perform any task, you have to give a set of\ninstructions in a particular sequence to the computer. These sets\nof instructions are called Programs. Software refers to a set of\nprograms that makes the hardware perform a particular set of\ntasks in particular order. Software can be classified mainly\ninto following categories and sub-categories are shown in\nFigure 1.17.\nFig. 1.17 Classification of Software\nSoftware \nSystem Software Application Software \nGeneralized \nPackages \nCustomized \nPackages \n \nUtilities \nOperating \nSystem "
    },
    {
      "pageNumber": 13,
      "content": "12  ::  Data  Entry  Operations\n1.7.1 System Software\nWhen you switch on the computer the programs stored in ROM\nare executed which activates different units of your computer and\nmakes it ready for you to work on it. This set of programs can be\ncalled system software.\nSystem softwares are sets of programs, responsible for running\nthe computer, controlling various operations of computer\nsystems and management of computer resources. Operating\nSystem (OS) falls under this category.\nAn operating system is a system software that provides an\ninterface for a user to communicate with the computer, manages\nhardware devices (disk drives, keyboard, monitor, etc), manages\nand maintains disk file systems and supports application\nprograms. Some popular Operating systems are UNIX, Windows\nand Linux.\nAlthough operating system provides all the features users need\nto use and maintain their systems, inevitably, they still do not\nmeet everyone’s expectations.  This has led to another type of\nsystem software called \"Utilities\". These are programs that bridge\nthe gap between the functionality of an OS and the needs of users.\nUtility programs are a broad category of software such as\ncompress (zip)/uncompress (unzip) files software, anti virus\nsoftware, split and join files software, etc.\n1.7.2 Application Software\nApplication software is a set of programs, which are written to\nperform specific tasks, for example: An application package for\nmanaging library known as library information system is used\nto manage information of library such as: keeping book details,\naccount holder details, book issue details, book return details\netc. Another application package for managing student details is\ncalled student’s information system, manages student’s roll no,\nname, parents name, address, class, section, processing of\nexamination results etc. Application software can be broadly\nclassified into two types:\n(a)Generalized packages\n(b)Customized packages"
    },
    {
      "pageNumber": 14,
      "content": "Basics  of  Computer  ::  13\nGeneralized Packages\nThese are user friendly softwares written to cater to user’s very\ngeneral needs such as preparing documents, drawing pictures,\ndatabase to manage data/information, preparing presentations,\nplay games etc.\nIt is a group of programs that provide general purpose tools to\nsolve specific problems. Some of the generalized packages are\nlisted below:\nlWord Processing Software(for preparing documents): Word\nPerfect, MS-Word, OpenOffice.org Writer\nlSpreadsheets (Data Analysis): Lotus Smart suites, MS-\nExcel, OpenOffice.org Calc, Apple Numbers\nlPresentations : Presentation Graphics, MS-PowerPoint,\nOpenOffice.org Impress\nlDatabase Management System: MS-Access, OpenOffice.org Base,\nMS-SQL Server, ORACLE\nlGraphics Tools: Paint shop pro, Adobe Photoshop\nCustomized Packages\nThese are the applications that are customized (or developed) to\nmeet the specific requirements of an organization/institution. For\nExample: Student information details, Payroll packages,\ninventory control etc.\nThese packages are developed using high-level computer\nlanguage.\n1.8 COMPUTER LANGUAGES\nLanguages are a means of communication.  Normally people\ninteract with each other through a language. On the same pattern,\ncommunication with computers is carried out through a\nlanguage. This language is understood both by user and the\nmachine. Just as every language like English, Hindi has its\ngrammatical rules; every computer language is bound by rules\nknown as SYNTAX of that language. The user is bound by that\nsyntax while communicating with the computer system."
    },
    {
      "pageNumber": 15,
      "content": "14  ::  Data  Entry  Operations\nComputer languages are broadly classified as:\n1. Low Level Language:\nThe term low level means closeness to the way in which machine\nunderstand. The low level languages are:\na. Machine Language:\nThis is the language (in the form of 0’s and 1’s, called binary\nnumbers) understood directly by the computer. It is machine\ndependent. It is difficult to learn and even more difficult to write\nprograms.\nb. Assembly Language:\nThis is the language where the machine codes comprising of 0’s\nand 1’s are substituted by symbolic codes (called mnemonics)\nto improve their understanding. It is the first step to improve\nprogramming structure.\nAssembly language programming is simpler and less time\nconsuming than machine level programming, it is easier to locate\nand correct errors in assembly language than in machine\nlanguage programs. It is also machine dependent. Programmers\nmust have knowledge of the machine on which the program will\nrun.\n2. High Level Language\nYou know that low level language requires extensive knowledge\nof the hardware since it is machine dependent. To overcome the\nlimitation, high level language has been evolved which uses\nnormal English like, easy to understand statements to solve any\nproblem. Higher level languages are computer independent and\nprogramming becomes quite easy and simple.\nVarious high level languages are given below:\nlBASIC (Beginners All Purpose Symbolic Instruction Code):\nIt is widely used, easy to learn general purpose language.\nMainly used in microcomputers in earlier days."
    },
    {
      "pageNumber": 16,
      "content": "Basics  of  Computer  ::  15\nlCOBOL  (Common  Business  Oriented  language):  A\nstandardized language used for commercial applications.\nlFORTRAN (Formula Translation): Developed for solving\nmathematical and scientific problems. One of the most\npopular languages among scientific community.\nlC:  Structured Programming Language used for all purpose\nsuch as scientific application, commercial application,\ndeveloping games etc.\nlC++: Popular object oriented programming language, used\nfor general purpose.\n1.9 COMPILER AND ASSEMBLER\nAs you know that High Level language is machine independent\nand assembly language though it is machine dependent yet\nmnemonics that are being used to represent instructions are not\ndirectly understandable by machine. Hence to make the machine\nunderstand the instructions provided by both the languages,\nCompiler  and  Assembler  are  required  to  convert  these\ninstructions into machine language.\nThe software (set of programs) that reads a program written in high\nlevel language and translates it into an equivalent program in\nmachine language is called as Compiler.\nThe program written by the programmer in high level language\nis called source program and the program generated by the\ncompiler after translation is called as object program.\nFig. 1.18 Compiler\nThe software (set of programs) that reads a program written in\nassembly language and translates it into an equivalent program\nin machine language is called as Assembler.\nCompiler \nSource Program  \n(Higher Level Language) \nObject Program  \n(Machine Language) "
    },
    {
      "pageNumber": 17,
      "content": "16  ::  Data  Entry  Operations\nFig. 1.19 Assembler\nINTEXT QUESTION\n5.Write True or False for the following:\n(a)Operating System (OS) is an Application Software.\n(b)High level languages are easy to program than low\nlevel language.\n(c)Computer language FORTRAN is used to solve\nScientific and Mathematical problems.\n(d)C is an object oriented programming language.\n(e)Compiler converts high level languages into machine\nlanguage.\n1.10 WHAT YOU HAVE LEARNT\nA computer is useful only when it interacts with the external\ndevices such as keyboard, mouse, monitor, speaker, which are\ncalled as peripheral devices. In this lesson we have discussed\nin details about major peripheral devices of a computer system.\nYou have learnt that only hardware does not do anything of its\nown without the help of software. Hence we have explained in\ndetails about software, its types and the computer languages\nused to prepare the software.\n1.11 TERMINAL QUESTIONS\n1.What is a computer? Draw a block diagram to illustrate the\nbasic organisation of a computer system and explain the\nfunctions of various units.\n2.What is an input device? Briefly describe varioius important\ninput devices.\n3.Discuss two basic types of monitors CRT and LCD.\nAssembler \nSource Program  \n(Assembling Language) \nObject Program  \n(Machine Language) "
    },
    {
      "pageNumber": 18,
      "content": "Basics  of  Computer  ::  17\n4.What is a software? Discuss its various categories with the\nhelp of diagram.\n5.Distinguish between system and application software.\n6.Write short notes on:\n(a)Laser Printer\n(b)High level language\n(c)Compiler\n(d)Plotter\n7.Write a note on Computer language and its classification.\n1.12 FEEDBACK TO INTEXT QUESTIONS\n1.The five basic operations that a computer performs are\ninput, storage, processing, output and control.\n2.ALU:Arithmetic Logic Unit\nCU:Control Unit\nCPU:Central Processing Unit\n3.(a) i        (b) iii      (c) i\n4.(a) False    (b) False   (c) True    (d) True   (e) True\n5.(a) False    (b) True    (c) True    (d) False   (e) True"
    },
    {
      "pageNumber": 19,
      "content": "242  ::  Data  Entry  Operations\n \nIntroduction to Internet\n10.1INTRODUCTION\nIn the present age of information Technology, use of Internet is\nbecoming quite popular for accessing information on any topic\nof your interest.  It also provides tremendous opportunities to\nstudents; researchers and professionals for getting information\non matters related to academic and professional topics and lot\nmore. In the present world, most of the people who have\ncomputers around themselves use Internet to access information\nfrom the World Wide Web, exchange messages & documents and\ne-services.\n10.2OBJECTIVES\nAfter going through this lesson you would be able to:\nldefine Internet\nllist different types of Internet connections\nlexplain various services provided by Internet\nldownload files\nlsend and receive e-mail\nlbe acquainted with the terminologies used in Internet\n10"
    },
    {
      "pageNumber": 20,
      "content": "Introduction to Internet :: 243\n10.3 WHAT IS INTERNET?\nThe Internet or simply the Net is a worldwide network of computer\nnetworks. It is an interconnection of large and small networks\naround the globe.\n10.4 APPLICATIONS OF INTERNET\nWith the help of Internet you can:\nlExchange messages using e-mail (Electronic mail).\nlTransfer files as well as software.\nlBrowse through information on any topic on web.\nlCommunicate in real time (chat) with others connected to\nthe Internet.\nlSearch  databases  of  government,  individuals  and\norganizations.\nlRead news available from leading news groups.\nlSend or receive animation and picture files from distant\nplaces.\nlSet up a site with information about your company’s\nproducts and services.\n10.5 GETTING INTERNET CONNECTION ON YOUR\nCOMPUTER\nAny terminal to activate internet\nservices on it require a internet\nconnection  from  a  Internet\nService  Provider.  To  have  a\nconnection one needs to contact\nthe Internet Service Providers.\nThere   are   several   Internet\nService Providers (ISP) in each\nlocality. There are some nominal\ncharges that you need to pay to\nthe ISP for the installation of the connection and for the rent (either\nmonthly or annually). Depending on the requirement you can\nFig. 10.1"
    },
    {
      "pageNumber": 21,
      "content": "244  ::  Data  Entry  Operations\nchoose any one of the available options. If you need a high speed\ndedicated network then you can opt for a high bandwidth\nbroadband or leased line connection.\nIf you need to have connection on a single PC then you choose a\nlow bandwidth or dialup connection .  For small services at your\nhand you can even have mobile phones connected to your\nInternet. There are many ways to get connected to the Internet.\nYou can get internet connection in any of the following ways:-\n1.through dial-up connection : user is supposed to  get\nconnected  to the internet after dialing up the number used\nfor connection. This is useful if your network is either\nconfined to small group of computers  or for a single PC.\n2.through leased lines: in this a dedicated line is laid\nspecifically for connection.\n3.though broadband: in this you can get a broadband\nconnection which provides a high bandwidth for the internet\nconnection. This also provides a good speed.\nThese days even wireless connections are available. For this you\nneed to have a Wi Fi card attached to your computer which can\nbe useful if you do not have proper place to lay down the wires.\nTo connect to the Internet you need a PC (personal computer)\nwith requisite software including a browser, a telephone\nconnection or a leased line,  and a modem, which allows the PC\nto communicate with other computers.\n10.5.1 Types of Internet Connections\n(a)Dial-up\nThis is the most common basic type of connection available from\nISPs (Internet Server Providers). In Dial-up connection, you use\nyour computer, dial a phone number (provider by ISP) to get\nconnected to server at Providers end through which you access\nInternet.  It means you are not directly connected to Internet; you\naccess the Internet through an Internet Service Provider.\n(b)ISDN (Integrated Services Digital Network)\nThe process of connecting to server to access Internet is almost\nsame as Dial-up, but it offers connectivity through the use of"
    },
    {
      "pageNumber": 22,
      "content": "Introduction to Internet :: 245\ndigital phone lines instead of Analog.  It offers Internet connectivity\nat speeds of up to 128 Kbps, allows the user to receive or make\ncalls simultaneously on the same line.  ISDN comes through a\nregular telephone wire from the telephone pole on the  street.  The\nline combines two 64 Kbps channels to offer 128 Kbps bandwidth\nbroken into three bands: One band for the ringing signal of your\nphone, one band for your telephone conversation, and one band\nfor data transfer.\n(c) Leased Line Connection (Direct Internet Access)\nA “permanent connection” between a computer system (single\nCPU or LAN, and the Internet). It is generally used by larger\ninstitutions, corporate and government agencies.  It involves\nestablishing your own Internet gateway (connection) and payment\nto have a direct full time line with the network.  Your computers,\nin effect, become part of the Net.  The main advantage of this\nconnection is that: it is on line – 24 hrs a day, seven days a week,\n(24x7) and provides faster access.\nDedicated links are established through an internet service\nprovider who places a computer-controlled router (message\ndirector) at your site.  A router is used to connect your local\nnetwork to the Internet, allow all the members of network to have\ncomplete access to Internet.\n(d)DSL (Digital Subscriber Line or Dedicated Service Line)\nBroadband Connection\nDSL, an “always-on’ data connection is becoming widely available\nthese days. It can provide an excellent Internet connection. It\nconnects your home or office to the Internet through the same\ntelephone wire that comes from telephone pole on the street. Like\nISDN, with DSL, user can make and receive telephone calls while\nconnected to the Internet. The difference between DSL and dial-\nup / ISDN is that a DSL Internet connection uses a high-speed\ndedicated circuit filtering out standard phone calls and Internet\nsignals.\n10.6 HOW DOES INTERNET WORK?\nThe thing that characterizes the Internet is how data are\ntransferred from one computer to another. Did you ever wonder"
    },
    {
      "pageNumber": 23,
      "content": "246  ::  Data  Entry  Operations\nwhat magical things go on behind the scenes that results in a web\npage being displayed on your screen seconds after you request\nit? How does the data moves from one side of the world to the\nother?\nFig. 10.2\nHere is what happens to a piece of data (e.g. a Web page) when\nit is transferred over the Internet:\nlIt is broken  into a  lot of same-sized pieces (called\npackets).\nlA header is added to each packet that explains where it\ncame from, where it should end up and how it fits in with\nthe rest of the packets.\nlEach packet is sent from computer to computer until it\nfinds its way to its destination. Each computer along the\nway decides where next to send the packet. This could\ndepend on things like how busy the other computers are\nwhen the packet was received. The packets may not all\ntake the same route.\nlAt the destination, the packets are examined. If there is\nany packet missing or damaged, a message is sent asking\nfor that packet to be resent. This continues until all the\npackets have been received intact.\nlThe packets are reassembled into their original form.\nEach computer connected up to the Internet has a software called\nTCP/IP (Transmission Control Protocol/Internet Protocol), which\nis responsible for receiving, sending and checking packets. TCP/\nIP is the ‘glue’ of the Internet."
    },
    {
      "pageNumber": 24,
      "content": "Introduction to Internet :: 247\n10.7 FREQUENTLY USED TERMS IN INTERNET\nIn this section we will discuss common internet terms to help you\nunderstand the relationship of various Internet technologies.\nWorld Wide Web (WWW): The World Wide Web (“WWW” or simply\nthe “web”) is a collection of electronic documents (called web\npages) that are linked together like a spider web. These\ndocuments are stored on computers called servers located\naround the world.\nWeb Server: A Web Server is a computer that stores web pages.\nIt is responsible for accepting request(s) from users and serves\nthem with web pages.Two  important web server programs are:\nIIS (Internet Information server) and Apache, etc. Web servers\nare connected to the Internet 24 hours a day, seven days a week.\nHyperlink: It is an element in an electronic document that links\nto another place in the same document or to an entirely different\ndocument or other resource. Hyperlinks usually appear as\nunderlined text and in a different color, but they may also appear\nas graphics, such as buttons to click. Hyperlinks may   be used\nto link another place in the same page, or another page, to play\nan audio or video file, to download a file, to set up a message to\nan e-mail address, and to link to other Internet resources.\nHTML (Hypertext Markup Language): It is a language that\nconsists of certain key words called ‘Tags’, used for writing the\ndocuments on the web.\nWeb Page: A web page (such as the one you are looking at now)\nis an electronic document written in a computer language called\nHTML (Hypertext Markup Language).Web pages can contain text,\ngraphics, video, animation, and sound, as well as interactive\nfeatures, such as data entry forms. Each page has a unique\naddress known as a URL (Uniform Resource Locator) that\nidentifies its location on the server. Web pages usually contain\nhyperlinks to other web pages.\nWebsite: A website (often shortened to just site) is one or more\nweb pages, belonging to a particular company, institute,\ngovernment or an individual. The first page is called the home\npage, which acts like an index, indicating the content on the site."
    },
    {
      "pageNumber": 25,
      "content": "248  ::  Data  Entry  Operations\nBy default the home page is named as index.htm. From the home\npage, you can click hyperlinks to access other web pages.\nURL (Uniform Resource Locator): Every page on the web has a\nunique address, called Uniform Resource Locator, URL. A URL\nindicates where the web page is stored on the Internet. A sample\nURL might look like the following:\nFig. 10.3\nIP (Internet Protocol) Address: Computers do not understand\nletters or symbols that humans use to communicate effectively.\nComputers understand  numbers-specifically, 1s and 0s. Thus\nevery host (a computer linked to the Internet) on the Internet has\na unique host number. This number is called the Internet Protocol\naddress, or IP address.\nThe IP address is a unique address, generally written in the\nformat xxx.xxx.xxx.xxx, where xxx represents a 3 digit number\nthat varies between 0 and 255. For Example: 192.100.8.56\nDNS (Domain Name System): Every host (computer linked to\nInternet) has a unique host number called IP address. You can\nconnect to any host through IP address only, but it is difficult to\nremember the 4-digit number of hosts. To resolve this, domain-\nname is the only solution. Domain name, a unique name of the\nindividual host computer on the Internet. Every computer on\nthe Internet now have both a domain name and an IP address.\nTo connect to any host through domain name requires some\nmechanism that will convert the domain name IP address. DNS,\nDomain Name System is the standard for resolving names to\naddresses. It is used mostly to translate between domain names\nand IP addresses.\n           \n            http://www.learnthenet.com/english/glossary/url.htm \n \nFile name of \nthe web page \nDirectory where \nthe page is \nlocated  \n \nDomain name \n- The server \nwhere the \npage is located \nhttp -  Hypertext \nTransfer \nProtocol - used \nto access HTML \ndocument "
    },
    {
      "pageNumber": 26,
      "content": "Introduction to Internet :: 249\n10.8 UNDERSTANDING INTERNET ADDRESS\nAddresses are just what they sound like a way to identify\nuniquely an area of the Net or an individual on the Net.The most\naccurate analogy would be to your home address. This address,\nwhen provide fully, uniquely identifies where you live. If someone\nwants to either send you something or visit you, they must know\nyour address. It is the same way on the Internet. If someone\nwants to send you something, such as e-mail, they must know\nyour address. If someone wants to retrieve something from a\ncomputer on the Internet, they must know the Domain name\n(unique name to identify a host on the Internet) or the IP address\nof the computer.\nFor instance \nwww.nios.ac.in is the domain name of a host\ncomputer named nios in the academic area (.ac) belongs to\ngeographical domain India (.in).\nFig. 10.4\nAs you read in from the right, the name gets more specific until\nyou reach the name of the individual host computer. The right\nmost (in the above example .in - country code) represents either\na type of organization or a country.\nExample: \nwww.yahoo.com (.com – commercial organization)\nVarious Organizational and Geographical domains are as follows:\nOrganizational Domains\nTypically, the highest level (rightmost) part of the full domain is\na code indicating the type of organization to which domain\nbelongs. There are different organizational domains indicated\nbelow:\n \nwww.nios.ac.in \nwww – world \nwide web \nnios – name \nof the host \ncomputer \nac – academic, \nspecify the type \nof organization  \nin – India, \ncountry code "
    },
    {
      "pageNumber": 27,
      "content": "250  ::  Data  Entry  Operations\nFig. 10.5\nGeographic domains\nThis represents to which country the domain belongs. This code\nconsists of only two characters, which represent the international\ncountry codes. A few common ones are:\nFig. 10.6\n10.9 WEB BROWSER\n10.9.1  What is a Browser?\nA web browser is the software program, used to access the World\nWide Web. A browser (also known as client software) retrieves\ndata from remote web servers and displays a web page. Through\nthis tool the user send their request to Internet server to access\nthe information, Server process the request and responds with\nrequired information as a web page to the user.\nThe most popular browsers are Internet Explorer and Netscape\nNavigator.\nThe steps for connecting to a website are shown in Fig. 10.1 and\nexplained further.\n1.Types a URL for a website in browser say \nwww.nios.ac.in.\n \nDomain Purpose \nac  academic institutions \ncom     Commercial entities \nedu  Educational institutions \ngov  Government institutions \nnet   Network resources \norg  Non-profit organizations \n \n \nDomain Country \nau  Australia \nin  India    \njp  Japan \nuk  United Kingdom \n           us  United States    \n "
    },
    {
      "pageNumber": 28,
      "content": "Introduction to Internet :: 251\n2.Your browser attempts to make a connection and sends the\nrequest to Web Server.\n3.The Web Server receives and processes the request.\n4. The Web Server responds to the request with the home\npage of the website.\n5.The webpage is displayed by your browser and the\nconnection between the server and your browser is closed\nFig. 10.7 Interaction between a Web browser and a Web Server\n10.9.2 Microsoft Internet Explorer\nTo open browser Internet Explorer: click on start→All Programs\n→Internet Explorer\nW\ne\nb\n \nS\ne\nr\nv\ne\nr \nYour PC \nType  a URL in Browser: \nwww.nios.ac.in \n1 \nRequest  \n2 \nWeb Page \nResponse \n3 "
    },
    {
      "pageNumber": 29,
      "content": "252  ::  Data  Entry  Operations\n \n \n      \n \nMenu Bar \nNavigation Bar \nAddress Bar \nWeb Page \nScroll Bar \nFig. 10.8\n10.9.3 Saving a Web Page\nWhen saving a local copy of a webpage, the web browser usually\nallows a choice to Save file as type:\nlText File: Saving the rendered text without formatting or\nimages, and without indicating which words are links or\nwhat their destination is.\nlWebpage, HTML only: Saving the HTML-file, changing\nrelative links to absolute ones, without images.\nlWebpage, Complete: Saving the HTML-file, changing\nrelative links to absolute ones, saving the images and\nadjusting the references to them accordingly; a separate\nfolder is made in the case of Internet Explorer.\nlWeb Archive, Single file: Saving the HTML-file including all\nimages, stylesheets, scripts etc. to a single .MHT file. This\nis supported by Internet Explorer."
    },
    {
      "pageNumber": 30,
      "content": "Introduction to Internet :: 253\n10.10 DOWNLOADING FILES\nFollow the steps given below for downloading applications, plug-\nins, games or any other software from the Internet.\nIf you do not already have one, create a\nTemporary Files folder by opening\nWindows Explorer, highlighting your\nhard drive (typically the c: drive), then\nselecting File→New→Folder.\nWhen  the  folder  appears,  name  it\nTemporary Files.\nOnce you locate the software you want to\ndownload, click on the link to begin the\ndownload process.\nYou will be asked where to save\nthe file. Locate the Temporary\nFiles folder on your hard drive\nand double click on it to open it.\nClick SAVE\nIf you are really bored, you can\nwatch the file as it downloads.\nFig. 10.9\nFig. 10.10\nFig. 10.11\nFig. 10.12\nFig. 10.13"
    },
    {
      "pageNumber": 31,
      "content": "254  ::  Data  Entry  Operations\nAfter the download is\nfinished, you have to\ninstall  the  software.\nClose all programs that\nare  running,  except\nWindows Explorer. Find\nthe file you downloaded\nand double click on it.\nA  series  of  installation\nscreens direct you through\nthe process.\nNew application programs\nare usually installed in the\nProgram files folder. Plug-\nins are usually installed in\nthe  appropriate  browser\nfolder.\nAfter the software is\ninstalled   you   can\ndelete the file in your\nTemporary       Files\nfolder to free up space\non your hard drive.\n10.11 INTERNET SERVICES\nSearch Engine\nThe Internet is an amazing resource that provides quick access\nto all sorts of information. The amount of information, however,\nFig. 10.14\nFig. 10.15\nFig. 10.16"
    },
    {
      "pageNumber": 32,
      "content": "Introduction to Internet :: 255\nis so vast that being able to find what you are looking for is a\ndaunting task. Search engines are the answer.\nA search engine is a program designed to help find information\nstored on a computer system such as the World Wide Web, or a\npersonal computer. The search engine allows one to ask for\ncontent meeting specific criteria (typically those containing a\ngiven word or phrase) and retrieving a list of references that match\nthose criteria.\nSome of the important search engines are:\nGoogle    (http://www.google.com    ),    Yahoo    (http://\nwww.yahoo.com),  MSN Search (http://search.msn.com), Ask\nJeeves  (http://www.askjeeves.com),  AltaVista  (http://\nwww.altavista.com)\nE-Mail (Electronic Mail)\nE-Mail or Electronic Mail is a paperless method\nof  sending  messages,  letters,  video  and\ngraphics from one person to another or many\npeople at the same time via Internet. E-mail is\nvery fast, easy and much cheaper than the\nusing the post office, takes only few seconds to\narrive at the destination. It works 24 hours a\nday and seven days a week. There are many\nfree web-based e-mail services available on the Internet.\nA few among them are:\nYAHOO! Mail (http://www.mail.yahoo.com), Hotmail (http://\nwww.hotmail.com) , Gmail (http://www.gmail.com) , Rediffmail\n(http://www.rediffmail.com) , etc.\nHow does the E-Mail work?\nJust as a letter makes stops at different\npostal stations along the way to its final\ndestination,  e-mail  passes  from  one\ncomputer, known as a mail server, to\nanother as it travels over the Internet. Once\nit arrives at the destination mail server, it is\nstored in an electronic mailbox until the\nFig. 10.17\nFig. 10.18"
    },
    {
      "pageNumber": 33,
      "content": "256  ::  Data  Entry  Operations\nrecipient retrieves it. This whole process can take seconds,\nallowing you to quickly communicate with people around the\nworld at any time of the day or night.\nSending and Receiving Messages\nTo receive e-mail, you need an account on a mail server. This is\nsimilar to having a street address where you receive letters. One\nadvantage over regular mail is that you can retrieve your e-mail\nfrom any location in the world, provided that you have Internet\naccess. Once you connect to your mail server, just download your\nmessages to your computer or wireless device.\nTo send e-mail, you need a connection to the Internet and access\nto a mail server that forwards your mail. The standard protocol\nused for sending Internet e-mail is called SMTP, short for Simple\nMail Transfer Protocol. It works in conjunction with POP servers.\nPOP stands for Post Office Protocol.\nWhen you send an e-mail message, your computer routes it to\nan SMTP server. The server looks at the e-mail address (similar\nto the address on an envelope), and then forwards it to the\nrecipient’s mail server, where it is stored until the addressee\nretrieves it. You can send e-mail anywhere in the world to anyone\nwho has an e-mail address.\nComponents of an E-Mail Address\nInternet e-mail addresses typically have two main parts:\nsksharma@yahoo.com\nFirst part is the User ID (sksharma) that refers to the recipient’s\nmailbox. Then there is an at sign (@). Next comes the host name\n(yahoo), also called the domain name. This refers to the mail\nserver, the computer where the recipient has an electronic\nmailbox. It is usually the name of a company or organization.\nThe end of the domain name consists of a dot (“.”) followed by\nthree or more letters (such as .com and .gov) that indicate the\ntop-level domain (TLD). This part of the domain name indicates\nthe type of organization or the country where the host server is\nlocated."
    },
    {
      "pageNumber": 34,
      "content": "Introduction to Internet :: 257\nSetting up an E-mail account\nCreating a new e-mail account takes only a few minutes. You have\nto provide information about yourself and choose an account\nname and password. Your account name or ID becomes part of\nyour e-mail address. If you open a Yahoo account and choose\n“sksharma”    as    your    ID,    your    address    becomes\n“sksharma@yahoo.com.” Account names can use letters and\nnumbers, such as “pkp2006,” It does not contain any spaces in\nbetween.\nHow to send, read and reply to E-Mails\nlType  in  the  web  address  of  your  mail  provider  e.g.\nwww.mail.yaoo.com - then login by using your user ID and\npassword.\nFig. 10.19\nSending a message:\nlClick on Compose button, it follows the screen:\nE-mail messages are similar to letters, with two main parts:\nThe header contains the name and address of the recipient, the\naddress of anyone who is being sent a copy (cc) and the subject\nof the message.\nThe body contains the message itself.\n \nAccess Yahoo Mail \n \nWindow after Successful Login \n "
    },
    {
      "pageNumber": 35,
      "content": "258  ::  Data  Entry  Operations\nIn header section:\nlType the e-mail address of the recipient in the “To:” field.\nFor more than one person, e-mail id should be separated\nby commas. At least one e-mail ID is a must.\nFig. 10.20\nlType subject of your message in the “Subject:” field.\nlUse the large text box to enter the contents of your\nmessage.\nlIn the “Cc:” field, enter the email address of those to whom\nyou would like to send a “carbon copy” of your message.\nAll  recipients of the  message will be able to see that the\nperson you designated as a “Cc:” has received a copy of the\nmessage.\nlIn the “Bcc:” field, enter the e-mail address of those to\nwhom you would like to send a “blind carbon copy” of your\nmessage. This is nearly identical to the “Cc:” feature, except\n \nSend message "
    },
    {
      "pageNumber": 36,
      "content": "Introduction to Internet :: 259\nthat “Bcc:” recipients are invisible to the “To:” and “Cc:”\nrecipients of the message as well as to each other.\nlClick on Attach files to attaching file(s) and Insert Photos\nto attach Photos if required.\nlClick on send button to send the message.\nReading, Replying/ Forwarding a message\nlClick on Check Mail or Inbox to Read/Reply a message, it\nfollows the screen\nFig. 10.21\nlClick on the subject of the message to read.\nlOne can Reply/ Forward the message by clicking appropriate\nbutton.\nTelnet\nTelnet is a network protocol used on the Internet or local area\nnetwork LAN connections.\nThe Telnet program runs on your computer and connects your\nPC to a server on the network. You can then enter commands\nthrough the Telnet program and they will be executed as if you\nare entering them directly on the server console. This enables you\nto control the server and communicate with other servers on the\nnetwork. To start a Telnet session, you must log in to a server by\nentering a valid username and password. Telnet is a common way\nto remotely controlled Web servers.\n \nInbox that holds the email messages \n \nRead message  \n "
    },
    {
      "pageNumber": 37,
      "content": "260  ::  Data  Entry  Operations\nFTP (File Transfer Protocol)\nFTP or File Transfer Protocol is a commonly used protocol for\nexchanging files over any network that supports the TCP/IP\nprotocol (such as the Internet or an Intranet).\nThere are two computers involved in an FTP transfer. The first\ncomputer is an FTP server (host computer). This computer listens\non the network for connection requests from other computers.\nAnother computer (called the client) can make a connection to\nthe FTP server by using FTP client software. Once connected, the\nclient can do a number of file manipulation operations such as\nuploading files to the server, download files from the server,\nrename or delete files on the server and so on.\nFTP is used\nlTo promote sharing of files (computer programs and/or\ndata).\nlTo encourage indirect or implicit use of remote computers.\nlTo transfer data reliably and efficiently.\nINTEXT QUESTIONS\n1.Write True or False for the following:\n(a)The World Wide Web is a collection of electronic\ndocuments called web pages .\n(b)Web server is an electronic document that links to\nanother place in the same document or to an entirely\ndifferent document.\n(c)POP stands for Post Office Protocol.\n(d)Electronic Mail is a paperless method of sending\nmessages.\n(e)File Transfer Procedure is a commonly used protocol\nfor exchanging files over any network.\n2.  Fill in the blanks:\n(a)FTP is used to promote ———————————— files.\n(b)—————-is a network protocol used on the Internet."
    },
    {
      "pageNumber": 38,
      "content": "Introduction to Internet :: 261\n(c)————————refers to the mail server.\n(d)A search engine is a program designed to —————\n————- stored on a computer.\n(e)——————-is the standard for resolving names to\naddresses.\n10.12 WHAT YOU HAVE LEARNT\nIn this lesson  you learnt about  different types of internet\nconnections and applications of internet. Here you got acquainted\nwith different terminologies used in Internet. You also learnt\nabout search engine, E-mail, Telnet and FTP.\n10.13 TERMINAL QUESTIONS\n1.Explain the different types of connections available to get\nconnect to Internet.\n2.Explain Internet Addressing Schemes and Domain Name\nSystem.\n3.Define the following terminologies used in Internet; WWW,\nHyperlink, Web page, Website and URL.\n4.Yahoo and Hotmail offer free-email registration. Go to any\nof these sites and open an e-mail account in your name.\nSend an e-mail to a friend whose address you know.\n5.What do you mean by a search engine? Mention  two\nimportant search engines available on the Internet? What\nare basic tips to use to get the best results while searching?\n10.14 FEEDBACK TO INTEXT QUESTIONS\n1.(a) True(b)  False\n(c) True(d) True\n(e) False\n2.(a) sharing of files(b) Telnet\n(c) domain name(d) find information\n(e) DNS"
    },
    {
      "pageNumber": 39,
      "content": "18  ::  Data  Entry  Operations\n \nOperating System\n2.1INTRODUCTION\nThe operating system in these days uses a graphical user\ninterface (GUI). Here you do not have to remember all the\ncommands by heart. The commands are visible on the monitor\nas icons. The most popular operating system available today is\n‘Windows’.\nThe Windows operating system has evolved over time in the form\nof Windows 95, Windows 98 and Windows 2000. Currently\nwindows XP, Windows Vista and Windows 7 are in use. In this\nlesson we will explain the main features of Widows XP.\n2.2OBJECTIVES\nAfter going through this lesson you would be able to:\nlexplain the features of Windows XP\nlexplain various icons and their features\nldefine file management\n2"
    },
    {
      "pageNumber": 40,
      "content": "Operating  System  ::  19\nFig. 2.1\n2.3ELEMENTS OF WINDOWS XP\n2.3.1 Logging On\nWhen the computer system loaded with Windows XP is started,\nit will present a log-in screen to log on to windows or to network,\nif the system is part of a computer network.\nTo be able to log on, do the following\n1.Enter the password (if it is password protected)\n2.click on the a key or hit the Enter key\nFig. 2.2\n2.4 XP DESKTOP ELEMENTS\nStart Menu\nWhen clicked on the start button, menu as follows appears on\nthe screen giving all the available options to start using the\nWindows."
    },
    {
      "pageNumber": 41,
      "content": "20  ::  Data  Entry  Operations\nFig. 2.3\nOverview of the options:\nTaskDescription\nAll ProgramsDisplays a list of installed program, which a user\ncan start or use\nMy DocumentsDisplays a list of document used by the current\nuser\nMy Recent DocumentsDisplays a list of recently used document by the\ncurrent user\nMy PictureDisplays a list of picture/photos used by the current\nuser\nMy MusicDisplays a list of music/songs used by the current\nuser\nControl PanelDisplays a list of utility configure the computer\nsystem and install software and hardware\nPrinters and FaxesDisplays a list of currently installed printers and\nfaxes in the current computer system\nHelp and SupportStart the XP help and support program to find how\nto do a task in windows\nSearchHelps the user to find Displays a list of document\nused by the current user files, folder, and other\nnetworked computer and shared resources."
    },
    {
      "pageNumber": 42,
      "content": "Operating  System  ::  21\nRunStart a application program or execute a DOS\ncommand\nLog OffLog off the currently logged in user of the system\nTurn Off ComputerClose currently opened program, log of the current\nuser and switch off the computer system.\nTask Bar\nWhen you start the computer system, then start and task bar\nappears on the bottom of the screen and by default remains\nvisible when Windows is running.\nWhenever a program is run or a window is opened, an icon\nrepresenting the program appears on the taskbar. To switch\nbetween windows or program, click on the icon representing the\nwindow on the task bar. When the program or window is closed,\nthe icon disappears from the task bar.\nFig. 2.4\nStart a Program\nTo start a program to the followings;\n1.Click on the Start Button\n2.Click on the All Programs\n3.Point to the desired folder say “Accessories” and select the\ndesired program to run such as ‘Paint’\nQuitting a Program\nTo quit a program, select the close button (×) in the upper-right\ncorner of the window  OR\nClick on File menu and select ‘Close’ option.\nGetting Help\nOnline help and support provided is of great help in using and\nlearning windows. One can get help a specific topic or current\ntask is being executed. To start help\nlclick on the Start button\nlclick on ‘Help and Tutorial’ option"
    },
    {
      "pageNumber": 43,
      "content": "22  ::  Data  Entry  Operations\nA list of help and support topics and online tutorial is displayed\non the screen. One can use the tabs in the screen to search for\nthe desired information in several ways.\nFig. 2.5\nlClick on a topic or task to know more about how to get the\njob done or type in a search word to locate the help on a\nspecific topic.\nlClick on the ‘Index’ tab to locate specific topic listed\nalphabetically and the follow the instructions displayed on\nthe screen.\nlClick on ‘Favourites’ tab to add Help Topics, search results\nto your Favourites list to make them easy to locate in the\nfuture\nlClick on ‘History’ to pick from a list of Help and Support\npages that you have read in the past.\nlClick on’ Support’ to get various kind of online support\nsuch as Microsoft online support, News Group on Windows.\nlClick on ‘Option’ to configure the help and support center\nas per your requirement.\nTo close Help and Support windows, select the close button (×)\nin the upper-right corner of the window."
    },
    {
      "pageNumber": 44,
      "content": "Operating  System  ::  23\nLocating Files and Folders\nIf you don’t know where a document or folder is located, you can\nuse the Search companion to locate it in the local storage such\nas Hard Disk, CD or in the network drive (if the system is part of\na network). The Indexing Service provided by the Search\nmaintains an index of all the files on your computer, making\nsearches faster.\nTo search for a file or folder\n1.Click Start, and click on Search.\n2.Select All files and folders from the left hand side of the\nwindows.\n3.Type the name of the file or folder in part or full, or type a\nword or phrase that exists in the file to be searched.\n4.If you do not know either piece of information select one or\nmore of the remaining options:\nlIn Look in, click the drive, folder, or network you want\nto search.\nFig. 2.6"
    },
    {
      "pageNumber": 45,
      "content": "24  ::  Data  Entry  Operations\nlClick on When was it modified? to look for files that\nwere created or modified on or between specific dates.\nlTo look for files of a specific size, click on What size\nis it? Select a size.\nlClick on More advanced options to specify additional\nsearch criteria.\n5.Once you finish specifying the search criteria, click on\nSearch to locate the file.\nSimilarly you can search for specific information on\nInternet, or people in your address book, search for a\nprinter or a computer on your network.\nChanging System settings\nBy using Control Panel’s tools you can customize the way\nWindows look and work! Also you can install new hardware, add\nand remove (install/uninstall) software programs, change the look\nand feel of your desktop and much more. It also includes a\nnumber of administrative tools in Administrative Tools option for\nbetter administration of Windows in terms of User Management,\nEvent viewer, Component Service etc.\nTo start Control Panel and use the available tool, do the following;\nlClick on ‘Start’\nlClick on ‘Control Panel’\nlSelect the desired tool to use\nFor example to create a new or modify the settings for an existing\nuser click on ‘User Account’ icon in the control panel.\nUsing My Computer\nMy Computer displays the contents of floppy, hard disk, CD-\nROM, and network drives. One can also search for and open files\nand folders, and use options in Control Panel to modify\ncomputer’s settings.\nlTo use My Computer, click on Start, and then click on My\nComputer."
    },
    {
      "pageNumber": 46,
      "content": "Operating  System  ::  25\nFig. 2.7\nDisplay the storage Contents\nlTo see what’s on your hard disk, under Hard Disk Drives,\ndouble-click the drive you want to see such as C:, D: etc.\nlTo find a file or folder on a CD-ROM, or other media, under\nDevices with Removable Storage, double-click on the\nrespective storage media you want to see.\nlTo find a file in a folder, under Files Stored on This\nComputer, double-click a folder.\n2.5 FILE MANAGEMENT IN WINDOWS\nFile management in windows can be done through Windows\nexplorer or My Computer. Windows Explorer displays the\nhierarchical list of files, folders, and storage drives (both fixed and\nremovable) on your computer. It also lists any network drives that\nhave been mapped to as a drive letters on your computer.\nWindows Explorer can be used to copy, move, rename, and\nsearch for files and folders. For example, to copy a file, you can"
    },
    {
      "pageNumber": 47,
      "content": "26  ::  Data  Entry  Operations\nopen a folder that contains the desired file to be copied or moved,\nand then just drag and drop the file to target folder or drive.\nFig. 2.8\nWhen files or folders are deleted from hard disk, Windows places\nthem in the Recycle Bin, where they can be retrieved, until the\nRecycle Bin is made empty. Files or folders deleted from a\nremovable storage media such as network drive are permanently\ndeleted and are not sent to the Recycle Bin.\n2.5.1 Using Windows Explorer\nTo open Windows Explorer,\nlClick on Start,\nlPoint to All Programs,\nlPoint to Accessories, and then click on Windows Explorer\nCoping or Moving a file or Folder using My Document\nlClick on Start, and then click on My Documents."
    },
    {
      "pageNumber": 48,
      "content": "Operating  System  ::  27\nFig. 2.9\nlClick the file or folder to be copied. More than one file or\nfolder can be copied at a time.\nFig. 2.10"
    },
    {
      "pageNumber": 49,
      "content": "28  ::  Data  Entry  Operations\nlTo select more than one file or folder, click the first file or\nfolder, press and hold down SHIFT key, and then click the\nfile or folder.\nlTo select non-consecutive files or folders, press and hold\ndown CTRL key, and then click each of the files or folders\nto be copied.\nlUnder Edit, select Copy.\nlSelect the target drive or folder to which you want to copy\nthe files\nlUnder Edit, select Paste to copy the desired file or folder\nto the target drive.\nFig. 2.11\n2.5.2 View file details\n1.Click on Start, and then click on My Documents\n2.Double-click the folder that contains the files to be viewed.\n3.On the View menu, click Details."
    },
    {
      "pageNumber": 50,
      "content": "Operating  System  ::  29\n4.It will display all the details about the files such as Name,\nType, size etc.\n2.5.3 Coping and moving files using Explorer\nlClick Start, point to All Programs, point to Accessories,\nand then click Windows Explorer.\nlMake sure the destination for the file or folder you want to\nmove is visible.\nFig. 2.12\nlDrag the file or folder to the destination.\nlIf you drag an item while pressing the right mouse button,\nyou can move, copy, or create a shortcut to the file in its\nnew location.\nlTo copy the item instead of moving it, press and hold down\nCTRL while dragging.\nlIf you drag an item to another disk, it is copied, not moved.\nTo move the item, press and hold down SHIFT while\ndragging."
    },
    {
      "pageNumber": 51,
      "content": "30  ::  Data  Entry  Operations\nlDragging a program to a new location creates a shortcut to\nthat program. To move a program, right-click and then drag\nthe program to the new location. You must be logged on as\nan administrator to move a program.\n2.5.4 Create a new folder\n1.Click on Start, and then click on My Documents\n2.Under File, click New and select Folder.\n3.A new folder is displayed with the default name, New\nFolder.\n4.Type a name for the new folder, and then press ENTER.\n5.A new folder can also be created by right-clicking a blank\narea in a folder window or on the desktop, pointing to New,\nand then clicking Folder.\n2.5.5 Rename a file or folder\n1.Click on Start, and then click on My Documents\n2.Click on the file or folder you want to rename.\n3.Under File, click Rename.\n4.Type the new name, and then press ENTER key.\nlFile or folder can also be renamed by right-clicking it\nand then clicking Rename.\n2.5.6 Delete a file or folder\n1.Click on Start, and then click on My Documents\n2.Click on the file or folder you want to delete.\n3.Under File, click Delete.\n4.Files or folders can also be deleted by right-clicking the file\nor folder and then clicking Delete.\n5.Deleted files or folders are stored in the Recycle Bin, till\nthey are permanently removed from the Recycle Bin."
    },
    {
      "pageNumber": 52,
      "content": "Operating  System  ::  31\n6.To retrieve a deleted file, double-click the Recycle Bin icon\non the desktop. Right-click on the file to retrieved, and then\nclick Restore.\n7.To permanently delete a file, press and hold down SHIFT\nand drag it to the Recycle Bin.\nFig. 2.13\n2.6INSTALL SOFTWARE/HARDWARE\nWindows provides a quick and easy way to install new software.\nAdd or Remove Programs utility in Control Panel help to manage\nprograms and components on the computer system computer.\nUsing it one can install software packages such as Microsoft Word\nor Access etc. from a CD-ROM, or a network drive, or add or\nremove Windows updates and new features from the Internet. This\ncan also be used to add or remove Windows components which\nare not included in the original installation."
    },
    {
      "pageNumber": 53,
      "content": "32  ::  Data  Entry  Operations\nFig. 2.14\n2.6.1 Install Software\nlClick Start, click Control Panel,\nlDouble-click Add or Remove Programs.\nlClick on Add New Programs, and then select the source\nwhere the software to be installed is located such as CD or\nFloppy drive\nlFollow the instructions on your screen to install the\nsoftware.\n2.6.2 Change or remove software\n1.Click Start, click Control Panel,\n2.Double-click Add or Remove Programs.\n3.Click on Change or Remove Programs, and then select the\nprogram you want to change or remove.\nlTo change a program, click on Change button."
    },
    {
      "pageNumber": 54,
      "content": "Operating  System  ::  33\nlTo remove a program, click on Remove button.\n2.6.3 Add new features from Windows Update\n1.Click Start, click Control Panel,\n2.Double-click Add or Remove Programs.\n3.Click Windows Update.\n4.Follow the instructions to locate and install new Windows\nfeatures or updates\n2.6.4 Add or remove a Windows component\nTo be able to use this feature of Windows, the user must log in\nas an administrator or a member of the Administrators group.\nFig. 2.15\n1.Click Start, click Control Panel,\n2.Double-click Add or Remove Programs.\n3.Follow the instructions in the Windows Components Wizard."
    },
    {
      "pageNumber": 55,
      "content": "34  ::  Data  Entry  Operations\n2.6.5 Install Hardware\nWindows can helps you set up new hardware component such\nas sound card, video card or network card etc. to your computer.\nFig. 2.16\n1.Click Start, click Control Panel,\n2.Double-click Add Hardware.\n3.Follow the instructions on the screen.\nINTEXT QUESTIONS\n1.Write True or False for the following:\n(a)Deleted Files or folders are stored in the recycle bin.\n(b)Under Edit menu you can rename the file.\n(c)Windows provides a quick and easy way to install new\nsoftware.\n2.Fill in the blanks:\n(a)Under file, click ................. and select folder."
    },
    {
      "pageNumber": 56,
      "content": "Operating  System  ::  35\n(b)If you drag an item while pressing the ............... you\ncan create a shortcut to the file.\n(c)When you start the computer system, the task bar\nappears .............. on the screen.\n(d)When files or folders are deleted from ...............\nwindows places them in the recycle bin.\n(e)To select non-consecutive file or folder press and hold\ndown ................. key.\n2.7 WHAT YOU HAVE LEARNT\nIn this lesson you learnt about important features of Windows XP.\nNow you are in a position to locate a file or folder and use windows\nexplorer to manage files. Moreover, you can install software and\nhardware in the system. You can change system settings also.\n2.8 TERMINAL QUESTIONS\n1.List out various steps to search for a file or folder.\n2.Describe the following\n(a)Recycle bin\n(b)Task bar\n(c)Quitting a program\n(d)File Management in Windows\n3.Write down the steps to delete a file or folder from the\ncomputer.\n4.What are the steps to install software in the computer.\n5.Write down various steps to rename a file or folder.\n2.9 FEEDBACK TO INTEXT QUESTIONS\n1.(a) True(b) False(c) True\n2.(a) Right mouse button(b) Right(c) Bottom\n(d) Hard disk(e) CTRL key"
    },
    {
      "pageNumber": 57,
      "content": "36  ::  Data  Entry  Operations\n \nBasics of Word Processing\n3.1INTRODUCTION\nWord processing is an application program that allows you to\ncreate letters, reports, newsletters, tables, form letters, brochures,\nand Web pages.  Using this application program you can add\npictures, tables, and charts to your documents.  You can also\ncheck spelling and grammar.\nIn this lesson, we will learn Word 2007 and use its features, tools\nand techniques. All Professional Documents will be discussed\nusing this package only.\n3.2OBJECTIVES\nAfter going through this lesson you would be able to:\nldefine features of Word 2007\nlexplain basic menu details of Word 2007\nlcreate, save and print new Word document\nlprotect a word document quickly and efficiently\nlmanage word files and their printing\n3"
    },
    {
      "pageNumber": 58,
      "content": "Basics of Word Processing :: 37\n3.3MAIN FEATURES OF WORD PROCESSING\nThe main features are:\nlYou can create professional documents fast, using built-\nin and custom templates.\nlYou can easily manage large documents using various\nfeatures like the ability to create table of contents, index,\nand cross-references.\nlYou can work on multiple documents simultaneously\nlWith the help of mail merge, you can quickly create merge\ndocuments like mass mailings or mailing labels.\nlAutoCorrect and AutoFormat features catch typographical\nerrors automatically and allow you to use predefined\nshortcuts and typing patterns to quickly format your\ndocuments.\nlThe print zoom facility scales a document on different paper\nsizes, and allows you to print out multiple pages on a single\nsheet of paper.\nlThe nested tables feature supports putting one table inside\nanother table.\nlYou can export and save your word documents in PDF and\nXPS file format.\n3.4FEATURES OF WORD 2007\nMS Word 2007 has useful features and tools introduced to\nproduce professionally created documents. Some of these\nfeatures are discussed below.\nYou can easily create, format, edit professional-looking user\ndocument using comprehensive set of easy to use tools provided\nby MS Word. It uses the MS Office Fluent user Interface concept.\nThis interface uses a new component called Ribbon to group the\ntools by task, within task by sub tasks and related commands\nthat are used more frequently. The new user result oriented\ninterface presents the tools to you in a more organised and\nefficient manner, which are easy to locate."
    },
    {
      "pageNumber": 59,
      "content": "38  ::  Data  Entry  Operations\nFig. 3.1\n1.Tabs are more task oriented such as Home, Insert, Page\nLayout\n2.Within each tab, the related sub-tasks are grouped together\n3.Related command button 1 are also grouped together to\nexecute a command or to display a command menu\nThe MS Word 2007 provides a lot of pre-formatted template to\nproduce documents, reports etc. While using the pre-formatted\ntemplate, you can select already available cover page, header\nand footer to give the documents a professional look without\nspending much time in formatting a new one.\nMS Word 2007 also provides features for creating chart and\ndiagram which include three-dimensional shapes, transparency,\ndrop shadows, and other effects. This helps create highly\nprofessional documents with flexibility in representing data more\nefficiently and professionally.\nUsing MS Word 2007 digital signature feature, you can ensure\nthe authenticity, integrity, and origin of the document. The same\ncan be done either by adding an invisible digital signature to a\ndocument, or inserting a Microsoft Office Signature Line, which\ncapture a visible representation of a signature along with a digital\nsignature.\nSimilarly, before sharing a document which is in its final form with\nothers, you can use MS Word 2007 “Mark As Final” features to\nprotect the document from any changes. “Mark as Final”\ncommand makes the document “read-only” making the typing,\nediting and proofing command disabled. But just to remember,"
    },
    {
      "pageNumber": 60,
      "content": "Basics of Word Processing :: 39\n“Mark As Final” is a security feature as anyone can edit a\ndocument that is marked as final by turning off Mark as Final.\nMS Word 2007 also provides the feature and tools to export your\ndocument to either PDF (Portable Document Format) or XPS\n(XML Paper Specification) format.\n3.5STARTING MS WORD PROGRAM\nYou can start your Word program different ways.  One way is\nusing Start button:\n1.Click on the Start button.\n2.In the menu that appears select All Programs\n→→\n→→\n→Microsoft\nOffice\n→→\n→→\n→Microsoft Office Word 2007.  In few seconds you\nwill see Word screen on the monitor.\nFig. 3.2"
    },
    {
      "pageNumber": 61,
      "content": "40  ::  Data  Entry  Operations\nYou can also start your MS Word program by double clicking on\nMicrosoft Word icon, which lies on the Microsoft Office Shortcut\nBar (MOSB).\n3.6 WORD SCREEN LAYOUT\nThe Word screen (Window) contains a number of objects such as\nTabs, Menus, Sub menus, short-cut commands etc.  We will\ndescribe the Word’s default screen layout (Fig. 3.1) here.\nFig. 3.3 Screen Layout\n3.6.1 Menus\nIf you are familiar with previous versions of Word, when you begin\nto explore Word 2007, you will notice a significant change in the\nmenu structure, look and feel. The features in Word 2007 display\nas various tabs such as Home, Insert, Page Layout, References\netc.  To view all sub tasks/options (expanded form) in each\nmenu, you must click the required option. For example, the\nimages in Figure 3.4 show the Border menu in collapsed form\n(Figure 3.4a) and in expanded form (Figure 3.4b)."
    },
    {
      "pageNumber": 62,
      "content": "Basics of Word Processing :: 41\nFig. 3.4a Collapsed menuFig. 3.4b Expanded menu\nShortcut Menus\nThese features allow you to access various\nWord  commands  faster  than  using  the\noptions on the menu bar. When the menu is\nexpanded, the shortcut menu is displayed\nwith short-cut command option for each of\nthe short-cut menu item. The options on this\nmenu will vary depending on the sub-task\nthat was clicked or selected. For example, the\nshortcut menu on the side is produced by\nselecting or expanding the Border option of\nthe paragraph sub-task of the Home Tab from\nthe Tab bar.\nThe shortcut menus are helpful because they display only those\noptions that can be applied to the item that was selected and,\ntherefore, prevent searching through the many menu options.\n3.6.2 Toolbars\nMS Word 2007 provides a customized quick access toolbar to\norganize the tools available for easy and fast access of the\ncommands. Many toolbars displaying shortcut buttons are also\navailable to make editing and formatting quicker and easier. The\ntoolbars that are already displayed on the screen are checked.\nTo add/modify simply click on the “More Commands” option\nwhich will display the following menu for customized selection of\ntools as per your requirement.\nFig. 3.5"
    },
    {
      "pageNumber": 63,
      "content": "42  ::  Data  Entry  Operations\nFig. 3.6\nFig. 3.7"
    },
    {
      "pageNumber": 64,
      "content": "Basics of Word Processing :: 43\n3.6.3  Rulers\nThe rulers display horizontal and vertical scales that reflect the\nwidth and height of your typing area.  The horizontal scale is\ninvaluable when you want to quickly set tabs, margins, and\nindents. Select the View tab on the main MS word 2007 screen\nto be able to select/deselect the Ruler/Gridlines and other\noptions.\nFig. 3.8\n3.6.4 Typing Screen Objects\nThe open area below the rulers and toolbars is writing or typing\narea.  There are certain objects that are a permanent part of the\ntyping area.  These are: (a) Insertion Point, (b) Mouse Pointer, and\n(c) End-of-Document Marker.\n(a)Insertion Point:  The black vertical blinking line is the\ninsertion point that is initially at the top left side of the"
    },
    {
      "pageNumber": 65,
      "content": "44  ::  Data  Entry  Operations\ntyping area.  It indicates the place where your typing is\ninserted into the document.  As you type, the blinking line\ncontinuously moves along towards right inserting in that line\nwhatever is typed.  When the up, down, left, or right arrows\nof the keyboard is used, the insertion point moves\naccordingly.  When you move and place the cursor any\nwhere in the text and click, the insertion point shifts to that\nplace from its current location indicating that it is ready to\naccept your typing.\n(b)Mouse Pointer:  When you move the mouse around in the\ntyping area, the mouse pointer is in the shape of a thin I-\nbeam.  As you move the mouse near the menu bar and\ntoolbars, the mouse pointer becomes a pointing arrow.  If\nyou move the mouse pointer to some existing piece of text\nand click the mouse, you will see the insertion point in that\nspot of the text.\n(c)End-of-Document Marker: The horizontal line (like a short\nunderline) at the end of the document (seen only when\nWord is in Normal view) is called end-of-document marker.\nThis marker lets you know where the end of document\noccurs.\n3.6.5 Vertical and Horizontal Scrollbars\nThe typing area is bordered on the right side by the vertical scroll\nbar with a scroll button and arrows.  The single down arrow scrolls\nthrough the document line by line.  The double down arrow allows\nyou to move to the top of the next page.  The double up arrow\nallows you to move to the top of the previous page. The double\ndown arrow allows you to move to the top of the next page. You\ncan also drag the vertical scroll button up and down the scroll\nbar to move up and down through the document.\nThe first bar along the bottom of the typing area is the horizontal\nscroll bar.   To see the text that is off the right side of the screen, use\nthe left arrow button.  To see the text that is off the left side of the\nscreen, use the right arrow button.  You can also drag the horizontal\nscroll button to move left or right of the document.\nIn Word 2007, the options such as view documents and zoom is also\navailable on the bottom bar for easy access."
    },
    {
      "pageNumber": 66,
      "content": "Basics of Word Processing :: 45\nFig. 3.9\nINTEXT QUESTIONS\n1.State True or False\n(a)Shortcut menu feature allows access to various Word\ncommands faster than using options on the menu\nbar.\n(b)In the collapsed menu, all the commands will be\ndisplayed.\n(c)For both Show and Hide Rules, the command is View\n→Ruler.\n(d)The black vertical blinking line in the typing area in\na word document is the insertion point.\n(e)The use of Scrollbars is to set margins in a document."
    },
    {
      "pageNumber": 67,
      "content": "46  ::  Data  Entry  Operations\n2.To view shortcut menu, we need to:\n(a)Click the mouse\n(b)Right click the mouse\n(c)First click and then right click the mouse\n3.Horizontal scale is useful to quickly set:\n(a)Margins\n(b)Tabs\n(c)Indents\n(d)All of the above\n4.What is the command to start the Word Program using Start\nbutton?\n3.7 MANAGING DOCUMENTS\nThis  section  of  the  lesson\nexplains how to open a new/\nexisting  document,  save  a\ndocument, print a document,\nworking      with      multiple\ndocuments,    protecting    a\ndocument, finding a document,\nand     closing     a     opened\ndocument. There are several\nways to create new documents,\nopen existing documents, and\nsave documents in Word. Click on the Office Button \n \n to use one\nthe following.\n3.7.1 Create a New Document\nTo open a new document, follow one of the following methods:\n1.Click the New Document button on the menu bar. \n2.Press CTRL+N keys on the keyboard.\nFig. 3.10"
    },
    {
      "pageNumber": 68,
      "content": "Basics of Word Processing :: 47\n3.7.2 Open an Existing Document\nClick on the office 2007 button at the top  left\ncorner of your screen to open an existing\ndocument, follow one of the following methods:\n1.Click the Open File button on the menu\nbar. \n2.Press CTRL+O keys on the keyboard.\n3.Each of the above method will show the\nOpen dialog box. Choose the file and click\nthe Open button.\n3.7.3 Save a New/Existing Document\nTo save a new/existing document that is\nopened, follow one of the following methods:\n1.Click the Save button on the menu bar. \n2.Press CTRL+S keys on the keyboard.\nIf the document is already named and saved\nearlier, it will simply save the document.  On the\nother hand, if the file is a new document then it\nwill prompt you by opening Save As dialog box.\nSelect the folder where you want to place your\ndocument in Save In: box, type the name of the\ndocument in File Name: box, and then click OK.\nYou can also save a new document by choosing\nCTRL\n→→\n→→\n→A on the keyboard and then selecting the\nabove actions in Save As dialog box.\n3.7.4 Working on Multiple Documents\nSeveral documents can be opened simultaneously if you are\ntyping or editing multiple documents simultaneously.  All open\ndocuments can be arranged under the View Tab.\nFig. 3.12\nFig. 3.11\nOffice 2007\nButton"
    },
    {
      "pageNumber": 69,
      "content": "48  ::  Data  Entry  Operations\n3.7.5 Protecting a Document\nYou can protect your document from being accidentally changed\nits format and text or from other users to get access to it.\nProtecting a Document from Accessing\nIf you want to protect a document from other users accessing to\nit, give a password to your file.  Follow the steps given below:\n1.When the file is open, select Office Button\n→→\n→→\n→Save As\ncommand on the menu bar.  The Save As dialog box\nappears.  Move the cursor on the Tools tab on the down\nleft side of Save As dialog box and click. A submenu will\nappear (see Figure 3.13).\nFig. 3.13\n2.Click on General Options.  The Save dialog box opens.  You\nwill see two boxes: Password to open and Password to\nmodify.\n3.Type a password in Password to open box. (A password\ncan include up to 15 character case-sensitive letters,\nnumerals, spaces and symbols. As you type the password,\nWord displays an asterisk (*) for each character you type.)"
    },
    {
      "pageNumber": 70,
      "content": "Basics of Word Processing :: 49\n4.Click    OK.        The\nConfirm  Password\ndialog  box  appears\n(see Save dialog box\nand             Confirm\nPassword dialog box\nin    Figure    3.14).\nRetype the password\nyou  typed  earlier.\nClick OK on Confirm\nPassword dialog box\nand then click OK on\nSave dialog box and\nthen click OK on Save\nAs dialog box.\n5.When you open the\nfile again next time it\nwill ask you to type the password (see Figure 5.7b).\nRemember, you will not be able to open that file without the\npassword.  Also, don’t forget that the passwords are case\nsensitive;  that  is,  ‘XYZ’  and  ‘xyz’  are  two  different\npasswords.\nProtecting a Document from Accessing (Read Only)\nWith this feature you can have double protection to your\ndocument.  Some times you yourself may accidentally change the\nformat of your document.  You can protect your document from\nbeing accidentally changed its format as well as from other users\naccessing it.\nProtecting a Document as Read Only Document\nIf you want your document be protected only for accidental\nchanges in the format, follow the steps given below:\n1.When the file is open, select Office Button\n→→\n→→\n→Save As\ncommand on the menu bar.  The Save As dialog box\nappears.  Move the cursor on the Tools tab on the down\nleft side of Save As dialog box and click. A submenu will\nappear.\n2.Click on General Options. The Save dialog box opens.  You\nFig. 3.14"
    },
    {
      "pageNumber": 71,
      "content": "50  ::  Data  Entry  Operations\nwill  see  Read  only\nrecommended check\nbox  at  the  left  side\nbottom  of  the  Save\ndialog box.\n3.Check-mark  (√)  the\nRead                    only\nrecommended  check\nbox.  Click OK on Save\ndialog box and then click\nOK on Save as dialog\nbox.\nNext time when you open the\ndocument    after    giving\npassword it will prompt you\nwith a message ‘Open as\nread-only?.       If       you\naccidentally make changes\nand  then  try  to  save  the\ndocument, the file will not be\nsaved.  Instead, you will be prompted by a message ‘This file is\nread-only’.\nIf you want to make changes to a document remove the check\nmark by clicking on Read-only recommended box, which lies\nbelow Password to open box under Save dialog box.\nModifying a Password Given to Protect a Document\nIf you suspect that some one knows your password and you want\nto change it, modify it by typing present password in Password\nto open: box and new password in Password to modify: box in\nthe Save dialog box.\nProtect a Document for Track changes, Comments, and Forms\nSome times you may feel that your document should be reviewed\nby others to improve the document’s contents.  The reviewers of\nyour document can suggest some changes or comments without\nmodifying the original document.  After the review, if you wish that\nthe changes were necessary you can incorporate them.\nFig. 3.15"
    },
    {
      "pageNumber": 72,
      "content": "Basics of Word Processing :: 51\nFig. 3.16\nTrack changes: Selecting this option from the Review Tab and\nTracking sub-task, let other users to change the document but\nhighlights all changes so that you can track changes. While a\ndocument is protected for track changes, you cannot turn off\nchange tracking nor can you accept or reject track changes.\n3.7.6 Find Documents\nWhen you forgot the name of a file, but you remember a few letters\nin a word that may be in the file name, use Open dialog box.  Word\nwill search through the list of files in the selected folder or device\nfor your particular file.  For example, if your file name is ‘Annual\npaper’ you can type the letters annual. Word will locate this file.\nFollow these steps to find files:\n1.Select Office Button Open command on the menu bar.  The\nOpen dialog box will be displayed.\n2.In Look in: box, select the folder or click where you suspect\nyour file will be located. Type few letters you remember that\nmatch with file name in File Name: box (Remember you\ncan type upper case or lower case letters, since search is\nnot case sensitive).  If the typed letters are beginning letters\nof your file name, the file name will appear in the File Name:\nbox.  Click Open to open the document.\n3. If you don’t see your file name appearing in the File Name:\nbox as you type, move the cursor on the Tools tab on the top\nright side of Open dialog box. If the typed letters in the File\nName: box matches with some part of your file name, all the\nfile names matching with your typed letters along with other\nfiles will appear in Name box in the Open dialog box.  If you\ntrace your file in the box, double-click on the file name or select"
    },
    {
      "pageNumber": 73,
      "content": "52  ::  Data  Entry  Operations\nthe file name and then click Open in Find dialog box to open\nthe document.\nFig. 3.17\n3.7.7 Close a Document\nClose the current document by selecting Office Button\n→→\n→→\n→Close\ncommand on the menu bar or click the Close icon if it is visible\non the Standard toolbar.\n3.8 PRINTING DOCUMENTS\nWhile printing a document you have the following options in Print\ndialog box: (see Figure 3.18).\n1.Name of the printer (if you have more than one printers).\n2.Choose paper size, orientations, resolution etc. by pressing\nProperties button.\n3.Print the entire document or only current page or specific\npages\n4.Print a draft copy, which omits graphics to allow faster\nprinting."
    },
    {
      "pageNumber": 74,
      "content": "Basics of Word Processing :: 53\n5.Number of copies to be printed, etc.\nFig. 3.18\n3.8.1 Printing a Document\nTo print a document or selected pages follow the steps given\nbelow:\n1.Open the document to be printed.\n2.Choose Office Button\n→→\n→→\n→Print command on the menu bar.\nThe Print dialog box will open.  Select the Options like print\nrange, Number of copes, Printer name etc.  See that printer\nis switched on and the paper is available in the printer tray.\n3.Click OK.\n3.8.2 Printing a Document on a Different Paper Size\nYou might have created a document using some selected paper\nsize.  You may want to print that document in a different paper\nsize or multiple pages in a single sheet of paper without\ndisturbing the general format.  You can do it using Zoom feature"
    },
    {
      "pageNumber": 75,
      "content": "54  ::  Data  Entry  Operations\nin Print dialog box. Follow the steps given below to resize your\ndocument to fit into a new paper size.\nIf you want to print a document in a different paper size, follow\nthe steps given below:\n1.Open the document to be printed.\n2.Choose Office Button\n→→\n→→\n→Print command on the menu bar.\nThe Print dialog box will open.  Select the Options like print\nrange, Number of copes, Printer name etc.  See that printer\nis switched on and the paper is available in the printer tray.\n3.Select the appropriate paper size in Scale to paper size:\nunder Zoom in Print dialog box.\n4.Click OK.\n3.8.3 Printing a Document’s Multiple Pages in a Single\n Sheet of Paper\nIf you want to print multiple pages of a document in a single sheet\nof paper, follow the steps given below:\n1.Open the document to be printed.\n2.Choose Office Button\n→→\n→→\n→Print command on the menu bar.\nThe Print dialog box will open.  Select the Options like print\nrange, Number of copies, Printer name etc.  See that printer\nis switched on and the paper is available in the printer tray.\n3.Select the appropriate paper size in Pages per sheet: under\nZoom in Print dialog box.\n4.Click OK.\n3.9EXIT WORD PROGRAM\nWhen finished your work in Word and closing all the files, you can\nquit the Word program by selecting Office Button\n→→\n→→\n→Exit\ncommand on the menu bar.\n3.10KEYBOARD SHORTCUTS\nKeyboard shortcuts can save time and the effort of switching from\nthe keyboard to the mouse to execute simple commands. Print"
    },
    {
      "pageNumber": 76,
      "content": "Basics of Word Processing :: 55\nthis list of Word keyboard shortcuts and keep it by your computer\nfor a quick reference.\nActionKey Stroke\nOpen a fileCTRL+O\nNew fileCTRL+N\nClose a fileCTRL+W\nSave AsF12\nSaveCTRL+S or SHIFT+F12\nPrint PreviewCTRL+F2\nPrintCTRL+P\nShow/Hide paragraph symbolsCTRL+*\nSpelling and grammarF7\nHelpF1\nFindCTRL+F\nReplaceCTRL+H\nGo ToCTRL+G\nSelect all - entire documentCTRL+A\nSelect from cursor to beginning of lineSHIFT+Home\nSelect from cursor to end of lineSHIFT+END\nGo to beginning of lineHOME\nGo to end of lineEND\nGo to beginning of documentCTRL+Home\nGo to end of documentCTRL+End\nCutCTRL+X\nCopyCTRL+C\nPasteCTRL+V\nUndoCTRL+Z\nRedoCTRL+Y\nFormat painterCTRL+SHIFT+C\nLeft alignmentCTRL+L\nCenter alignmentCTRL+E\nRight alignmentCTRL+R\nJustifiedCTRL+J"
    },
    {
      "pageNumber": 77,
      "content": "56  ::  Data  Entry  Operations\nDelete previous wordCTRL+Backspace\nApply bulleted listCTRL+SHIFT+L\nIndentCTRL+M\nPage breakCTRL+Enter\nFont faceCTRL+SHIFT+F\nFont sizeCTRL+SHIFT+P\nBoldCTRL+B\nItalicsCTRL+I\nUnderlineCTRL+U\nDouble underlineCTRL+SHIFT+D\nWord underlineCTRL+SHIFT+W\nAll capsCTRL+SHIFT+A\nChange caseSHIFT+F3\nSubscriptCTRL+=\nSuperscriptCTRL+SHIFT+=\nMake web hyperlinkCTRL+K\nGo to next cellTab\nGo to previous cellSHIFT+Tab\nGo to beginning of columnALT+PageUp\nHighlight to beginning of columnALT+SHIFT+PageUp\nGo to end of columnALT+PageDown\nHighlight to end of columnALT+SHIFT+PageDown\nGo to beginning of rowALT+Home\nHighlight to beginning of rowALT+SHIFT+Home\nGo to end of rowALT+End\nHighlight to end of rowALT+SHIFT+End\nColumn breakCTRL+SHIFT+Enter\nCopyright ©ALT+CTRL+C\nDate fieldALT+SHIFT+D\nGo to footnotesALT+CTRL+F\nShow/Hide ¶CTRL+SHIFT+8\nThesaurusSHIFT+F7\nNote: A plus sign indicates that the keys need to be pressed at the\nsame time."
    },
    {
      "pageNumber": 78,
      "content": "Basics of Word Processing :: 57\nINTEXT QUESTIONS\n5.What are the shortcuts key using keyboard for opening a\nnew document?\n6.What is the command on the menu bar to save?\n(a) a new file, (b) existing file\n7.What are the steps to print a document on a different paper\nsize in Print dialog box.\n8.State True or False.\n(a)Window menu allows you to work with two documents\nsimultaneously.\n(b)It is not necessary to give a password to protect a file\nfrom reviewers.\n(c)Selecting Tracked changes command in Protect\nDocument dialog box do not let others to change the\ndocument.\n3.11WHAT YOU HAVE LEARNT\nIn this lesson you learnt about various features of MS-word like\ncreate, print, format. You are now in a position to move text from\none place to another and apply different font and character styles.\nYou can also protect your document using different commands.\n3.12TERMINAL QUESTIONS\n1.Write any two uses of rulers in Word Program.\n2.What is a mouse pointer?\n3.What is an end-of-document marker?\n4.Explain the steps in renaming a document.\n5.What are the steps in protecting a document from\naccessing?"
    },
    {
      "pageNumber": 79,
      "content": "58  ::  Data  Entry  Operations\n6.How  do  you  modify  a  password  given  to  protect  a\ndocument?\n7.What are the steps in printing a document’s multiple pages\nin a single sheet of paper?\n8.Write any three options available in the Print dialog box.\n3.13 FEEDBACK TO INTEXT QUESTIONS\n1.(a) True\n(b) False\n(c) True\n(d) True\n(e) False\n2.(b) (right click the mouse)\n3.(d) (all of the above)\n4.Programs→Microsoft Word\n5.CTRL+N keys\n6.(a) File→Save As,\n(b) File→Save\n7.Select the appropriate paper size in Scale to paper size:\nunder Zoom and then click OK.\n8.(a) True\n(b) False\n(c) False"
    },
    {
      "pageNumber": 80,
      "content": "Formatting  Documents::  59\n \nFormatting Documents\n4.1INTRODUCTION\nThis lesson covers various features of entering, editing, copying\ntext, moving text from one place to another in the document,\ncreating bulleted and numbered lists, creating and applying\nstyles, and spelling and grammar corrections that are important\nto enrich your document. Also, enriching a document’s appearance\nis Word’s speciality. Word’s formatting features allow you to create\nbeautiful documents without doing much more than typing\nheadings and text. Word will do the rest.  Word 2007 offers a great\namount of formatting options: multiple typefaces and point sizes;\neasy-to-apply character styles such as bold, italic, normal, single\nand double spaces;underline; subscript and superscript; and\nparagraph formats such as alignment, spacing and indentation.\nYou will be introduced to some of these features in this lesson.\n4.2OBJECTIVES\nAfter going through this lesson you would be able to:\nldefine basic text processing tips\nlexplain spelling and grammar features\nlchange character and paragraph formats\n4"
    },
    {
      "pageNumber": 81,
      "content": "60  ::  Data  Entry  Operations\nluse page formatting\nlcreate bulleted and numbered lists\n4.3WORKING WITH TEXT\nWhile using Word 2007, there are certain concepts, menu flow,\ntips, and commands you should learn.  This section deals with\nmost common word concepts, tips, and commands you should\nknow regardless your skills in using Word 2007 program. When\nyou open word 2007 the following menu will appear on your\nmonitor.\nFig. 4.1\n4.3.1 Typing Text\nTo enter text, just start typing in the text area! As you type the\ntext will appear where the blinking cursor is located and will move\nfrom left to right. Unlike with a typewriter, you need not press\nENTER key at the end of each line, the characters automatically\nshifted to next line. Word continues to let your text wrap (move\nto the next continuous line) around until you are ready to start a\nnew paragraph. To break a continuous line and move to a new\nparagraph, Press ENTER key at the end of a paragraph.\n4.3.2 Inserting Text\nTo insert the text in an existing document, follow the steps given\nbelow:\n1.Move the cursor by using the arrow buttons on the\nkeyboard or positioning the mouse and clicking the left\nbutton where you want to insert the text. The keyboard\nshortcuts listed below are also helpful when moving\nthrough the text of a document:\nBeginning of the line HOME\nEnd of the line END"
    },
    {
      "pageNumber": 82,
      "content": "Formatting  Documents::  61\nTop of the document CTRL+HOME\nEnd of the document CTRL+END\n2.Type the text you want to insert.\n4.3.3 Spacebar and Tabs\nUse the spacebar as a separator for your words and sentences.\nDon’t use the spacebar to move the insertion point across a line\nof text - known as “spacing across a line”.  If you press the\nspacebar, word will make additional spaces, which you will then\nhave to delete.  Avoid using the spacebar to create columns of\ntext.  Instead you can use the Tab key.\n4.3.4 Paragraph Markers \nYou may find it easier to type when you can see the returns,\nspaces, and tabs in your document.  If so, click on the Show/\nHide\n  button on the Standard toolbar to display the marks.  Click\non the \n Symbol again to hide them.\n4.3.5 Selecting (Highlighting) Text\nTo change any attributes of text it must be highlighted first. Select\nthe text by dragging the mouse over the desired text while keeping\nthe left mouse button depressed, or hold down the SHIFT key\non the keyboard while using the arrow buttons to highlight the\ntext. The shortcuts for selecting a portion of the text are:\nFig. 4.2\na.Whole word: double-click within the word\nb.Whole paragraph: triple-click within the paragraph\nc.Several words or lines: drag the mouse over the words, or\nhold down SHIFT key while using the arrow keys"
    },
    {
      "pageNumber": 83,
      "content": "62  ::  Data  Entry  Operations\nd.Entire document: choose Edit→Select All command on the\nmenu bar, or press CTRL+A keys.\ne.Deselect the text by clicking anywhere outside of the\nselection on the page or press an arrow key on the\nkeyboard.\n4.3.6 Deleting Text\nUse the BACKSPACE and DELETE keys on the keyboard to\ndelete text. Backspace will delete the text to the left of the cursor\nand Delete will erase the text to the right. To delete a large\nselection of text, highlight it using any of the methods outlined\nabove and press the DELETE key.\n4.3.7 Replacing Text\nWord can combine the steps of deleting unwanted text,\npositioning the insertion point, and inserting replacement text.\nTo replace text, follow the steps given below:\n1.Select the text to be removed as explained above.\n2.Start typing the new text. Observe that the new text is\nreplacing the selected text.\nYou can also replace the text by selecting the text, then deleting\nit using DELETE key, and then start typing new text.\n4.3.8 Click and Type\nThis feature allows you to insert text any where in a page. Move\nthe cursor in a page where you want to insert the text. Double-\nclick and start typing. Click and Type is also useful for inserting\ntables, charts and other graphics in a blank area of a document.\nWhen you insert an item, Click and Type automatically formats\nthe item according to where you insert it.\n4.3.9 Formatting Text\nUsing the Formatting toolbar is the easiest way to change many\nattributes of text. If the toolbar as shown below is not displayed\non the screen, select Home Tab. Under Home Tab you can select\ndesired Formatting commands under Font, Paragraph subtask\nas per the diagram given below."
    },
    {
      "pageNumber": 84,
      "content": "Formatting  Documents::  63\nFig. 4.3\nlFont Face - Font is the basic typeface in which your words\nare displayed. Font comes in families such as Times New\nRoman or Ariel. Each font family has a specific way of\nformatting individual letters. Click the arrowhead to the\nright of the font name box in the under Font Formatting\nsubtask menu to view the list of fonts available. Scroll down\nto the font you want and select it by clicking on the name\nonce with the mouse.\nlFont Size - It determines how large each letter will appear.\nThe font size is measured in points (1/72 of an inch). Click\non the white part of the font size box in the Font Formatting\nsubtask menu to enter a value for the font size or click the\narrowhead to the right of the box in the Formatting toolbar\nto view a list of font sizes available. Select a size by clicking\non it once. A font size of 10 or 12 is best for paragraphs of\ntext.\nlFont Style - Font style determines the emphasis or weight\nthat the letters have when they are displayed. Each font can\nbe displayed as bold, italicize, and \nunderline.\nlAlignment - Text can be aligned to the left, center, or right\nside of the page or it can be justified across the page.\nlNumbered and Bulleted Lists - Lists are explained in detail\nlater in this lesson.\nFont Menu\nNumbered and\nbulleted lists\nBold, Italics and\nUnderline\nLeft, center,\nright\njustification\nIncrease/\nDecrease\nIndent"
    },
    {
      "pageNumber": 85,
      "content": "64  ::  Data  Entry  Operations\nlIncrease/Decrease Indent - Change the indentation of a\nparagraph in relation to the side of the page.\nlOutside Border - Add a border around a text selection.\nlHighlight Color - Use this option to change the color\nbehind a text selection. The color shown on the button is\nthe last color used. To select a different color, click the\narrowhead next to the image on the button.\nlText Color - This option changes the color of the text. The\ncolor shown on the button is the last color chosen. Click the\narrowhead next to the button image to select another\ncolour.\nThe Font Dialog Box\nThe Font dialog box allows you to choose from a larger selection\nof formatting using Home-Font Formatting sub task menu is the\neasiest way to format text. If you cannot format text using this\nmethod, then use Font dialog box options. Select Home\n→→\n→→\n→Font\nsubtask and click on the down arrow key located at the lower right\nside on the subtask menu to access the Font dialog box.\nFig. 4.4"
    },
    {
      "pageNumber": 86,
      "content": "Formatting  Documents::  65\nFormat Painter \nA handy feature for formatting text is the Format Painter located\non the home Tab under Clipboard subtask menu. For example,\nif you have formatted a paragraph heading with a certain font face,\nsize, and style and you want to format another heading the same\nway, you do not need to manually add each attribute to the new\nheadline. Instead, use the Format Painter by following these\nsteps:\n1.Place the cursor within the text that contains the formatting\nyou want to copy.\n2.Click the Format Painter button in the standard toolbar.\nNotice that your pointer now has a paintbrush beside it.\n3.Highlight the text you want to add the same format to with\nthe mouse and release the mouse button.\nTo add the formatting to multiple selections of text, double-click\nthe Format Painter button instead of clicking once. The format\npainter then stays active until you press the ESC key to turn it\noff.\nINTEXT QUESTIONS\n1.What will happen to the cursor when you use the following\nkeyboard shortcuts?\n(a) HOME, (b) END, (c) CTRL+HOME, (d) CTRL+END\n2.What are the shortcuts for selecting?\n(a) a whole word, (b) whole paragraph, (c) several words or\nlines, (d) entire document\n3.State True or False\n(a)It is a good practice to insert many spaces you need\nto move a text across a line.\n(b)We can use BACKSPACE key to delete smaller\nselection of text.\n(c)Ariel is a style menu name.\n(d)The font size is measured in points."
    },
    {
      "pageNumber": 87,
      "content": "66  ::  Data  Entry  Operations\n4.4 FORMATTING PARAGRAPHS\nIn Word 2007, a paragraph is any amount of text, graphics, object\nor other items that are followed by a paragraph mark. A paragraph\nmark is inserted each time while pressing the ENTER key. In\norder to change the formatting of a paragraph, select the\nparagraph and then apply the formats you want apply. Paragraph\nformats affect the entire paragraph and new paragraphs keep the\nformatting of the preceding paragraph. Paragraph marks store the\nformat of each paragraph. If the paragraph mark is deleted, the\ntext in that paragraph becomes part of the next paragraph.\nYou can format a paragraph by placing the cursor within the\nparagraph and selecting Home\n→→\n→→\n→Paragraph subtask menu and\nclick on the down arrow on the lower right side of the subtask\nmenu. This will display the following menu for you to choose the\nparagraph formatting.\nFig. 4.5"
    },
    {
      "pageNumber": 88,
      "content": "Formatting  Documents::  67\nFig. 4.6\n4.4.1 Line Markers\nTo insert a new line mark in the same paragraph, press\nSHIFT+ENTER keys. This action pushes the text down to the next\nline, but does not create a new paragraph.\nTo modify the appearance of paragraphs, use the Ruler, the\nFormatting toolbar and the Paragraph dialog box or one of Word’s\nparagraph formatting shortcut key combinations. The various\nways in which the paragraph formatting can be done is described\nin the following subsections:\n4.4.2 Centering, Right Alignment and Left Alignment\nBy default, the text in Word is left aligned. But these alignments\ncan be changed as described earlier.\n4.4.3 Indenting Text\nIndenting a paragraph enables it to set off from other text.\nlTo        indent        paragraphs\nautomatically, drag the top half of\nthe triangular indent marker of the\nhorizontal ruler to the right of the\ndesired position."
    },
    {
      "pageNumber": 89,
      "content": "68  ::  Data  Entry  Operations\nlTo increase or decrease indents by one Tab stop,\nuse the Increase Indent or Decrease Indent\nbutton on the Formatting toolbar.\nlTo create a hanging indent (that\nindents all lines but the first line of\na paragraph), drag the top half of\nthe triangular indent marker in the horizontal ruler to the\nleft of the desired position.\n4.4.4 Tab Stops\nBy default, the tab Stops are set at 0.5-inch intervals from the left\nmargin. To increase or decrease the tab length Choose Home\n→→\n→→\n→\nParagraphs sub task menu and click on the down arrow located\nnear lower right corner to display the paragraphs formatting\nsubmenu. Now click on the Tabs button located on the lower left\ncorner to display the tabs submenu. The Tab dialog box appears.\nType the length of the tab in inches in the box under Tab stop\nposition of Tabs dialog box. Click on OK. The insertion point can\nbe moved to the next tab stop in the current paragraph by\npressing the Tab key.\nYou can also use the horizontal ruler to set a tab stop at a\nparticular position or to change the way text lines up at a tab stop\nby simply moving the cursor to a place on the horizontal ruler and\nclicking.\nFig. 4.7"
    },
    {
      "pageNumber": 90,
      "content": "Formatting  Documents::  69\nTo set tab stops:\n1.Select the paragraph in which you want to set or change tab\nstops.\n2.To set or change the tab alignment, click the\nTab Alignment button at the far left of the\nhorizontal ruler until the tab alignment is the\nway you want to be.\nTo Select the respective Tabs click on:\n Left-aligned tab stops\n Centred tab stops\n Right-aligned tab stops\n Decimal tab stops\nTo move a tab stop, point to the tab marker and drag it to a new\nposition. To clear a tab stop, drag the tab marker off the ruler.\nAlso, you can set precise measurements for tab stops by using\nthe Tabs command on the Format menu (see the Tabs dialog box\nFigure).\nThe spacing between the default Tab Stops can also be changed\nbut this will affect only the active document. To do this, type or\nselect the distance you want between the tab stops in the Default\nTab Stops box and then click the OK button in the Tabs dialog\nbox.\n4.4.5 Line Spacing\nLine Spacing determines the height of each line of text in the\nparagraph. The default (single line spacing) depends on the size\nof the font characters. Individual line spacing is easy to change.\nChoose Home\n→→\n→→\n→Paragraphs sub task menu and click on the\ndown arrow located near lower right corner to display the\nparagraphs formatting submenu.. The Paragraph dialog box\nappears. The Indents and Spacing tab of the Paragraph dialog\nbox provides a drop-down under Line spacing: for simple but\neffective  control  of  the  space  between  lines  under  most"
    },
    {
      "pageNumber": 91,
      "content": "70  ::  Data  Entry  Operations\ncircumstances. The preview area demonstrates the relative effect\nof single, one-and-a-half and double line spacing. Single spacing\ncauses 12-point line spacing, 1½ line spacing is 18 points and\ndouble spaced lines will be 24 points apart.\nFig. 4.8\nAll these line spacing settings can be made by choosing the\nappropriate options from the Line spacing menu in the\nParagraph dialog box.\nWhen you use these choices, Word will compensate for graphics,\nsuperscript and large or small type sizes.\n4.4.6 Paragraph Spacing\nWord enables each paragraph to give unique before and after\nspacing if you wish. The spacing settings can be in points (pt),\ninches (in), centimetres (cm) or lines (li). Headings often have\ndifferent spacing requirements for body text. For instance, you\nmay require different before and after spacing designs for figures\nand figure captions as well. Also you can have unique spacing"
    },
    {
      "pageNumber": 92,
      "content": "Formatting  Documents::  71\nspecifications as part of a style, making it easy to keep the look\nof your documents consistent.\nChoose Home\n→→\n→→\n→Paragraphs sub task menu and click on the\ndown arrow located near lower right corner to display the\nparagraphs formatting submenu. The Paragraph dialog box\nappears. Use drop down submenu in Before: and After: under\nSpacing of the Paragraph dialog box to set the paragraph spacing.\nThe advantages of using the Paragraph command are:\n1.Spacing before and after paragraphs does not change the\npoint size of your text.\n2.You can use different spacing combinations for different\npurposes.\n3.You can make precise adjustments to the spacing between\nthe various text elements. For example, you can use\nparagraph spacing to clarify the relationship between\nheadings and body text.\n4.If the paragraph is moved or deleted, its spacing goes with\nit. The paragraph doesn’t leave behind extra blank lines.\n5.If you include spacing in the paragraph styles you use to\nformat text, Word adds the space along with the other\nformatting. You need not add blank lines manually.\n4.4.7 Borders and Shading\nYou can add borders, to any side of a paragraph, and you can add\nbackground shading. You can also add borders and shading to\nordinary text and to the paragraphs in table cells and frames.\nChoose Home\n→→\n→→\n→Paragraphs sub task menu and click on the\nbutton\n to display Border and Shading submenu. The Borders\nand Shading dialog box appears. Click on the appropriate borders\nbox after selecting Borders tab to select border, select Paragraph\nunder Apply to: drop down submenu, click OK. To shade a\nparagraph, click on Shading tab in Borders and Shading dialog\nbox, select appropriate shade under Fill, and select Paragraph\nunder Apply to: drop down submenu, click OK."
    },
    {
      "pageNumber": 93,
      "content": "72  ::  Data  Entry  Operations\nFig. 4.9\nINTEXT QUESTIONS\n4.The shortcut key to insert a new line:\n(a)ENTER\n(b)SHIFT+ENTER\n(c)ALT+ENTER\n5.By default, the Tab stops are set at:\n(a)0.3 inch intervals\n(b)0.4 inch intervals\n(c)0.5 inch intervals\n6.State True or False\n(a)Single line spacing causes 18 points\n(b)Using Standard toolbar, you can have up to 4\ncolumns in a paragraph\n(c)Format Painter button on the Standard toolbar is\nuseful in applying a style.\n(d)Heading 1 is a default style"
    },
    {
      "pageNumber": 94,
      "content": "Formatting  Documents::  73\n4.5BULLETED AND NUMBERED LISTS\nBulleted lists and Numbered lists are often used to bring main\npoints to a reader’s attention.\n4.5.1 Creating a Bulleted and Numbered Lists\nTo create a bulleted or numbered list, use the list features\nprovided by Word. In this section you will learn how to create and\nformat bulleted and numbered lists.\n1.Click the Bulleted List button\n or Numbered List\nbutton\n on the formatting toolbar.\n2.Type the first entry and press ENTER. This will create a new\nbullet or number on the next line. If you want to start a new\nline without adding another bullet or number, hold down\nthe SHIFT key while pressing ENTER.\n3.Continue to type entries and press ENTER twice when you\nare finished typing to end the list.\nUse the Increase Indent and Decrease Indent buttons on\nthe formatting toolbar to create lists of multiple levels.\nYou can also type the text first, highlight the section, and press\nthe Bulleted List or Numbered List buttons to add the bullets\nor numbers.\n4.5.2 Creating Nested Lists\nTo create a nested list, such as a numbered list inside of a\nbulleted list, follow these steps:\n1.Type the list and increase the indentation of the items that\nwill make up the nested list by clicking the Increase Indent\nbutton for each item."
    },
    {
      "pageNumber": 95,
      "content": "74  ::  Data  Entry  Operations\n2.Highlight the items and click the Numbered List button on\nthe formatting toolbar.\n4.5.3 Formatting Bulleted and Numbered Lists\nThe bullet image and numbering format can be changed by using\nthe Bullets and Numbering dialog box.\n1.Highlight the entire list to change all the bullets or\nnumbers, or Place the cursor on one line within the list to\nchange a single bullet.\n2.Access the dialog box by selecting Home\n→→\n→→\n→ Paragraphs sub task\nmenu on the main tab bar or by right-clicking within the list\nand selecting Bullets or Numbering command from the\nshortcut menu as per requirement.\nFig. 4.10\n3.Select the list style from one of the choices given, or click\nthe Picture... button to choose a different icon. Click the\nNumbered tab to choose a numbered list style.\n4.Click OK when finished.\n4.6 COPYING TEXT\n  AND MOVING (CUTTING) TEXT\nPart of editing process of text is copying or moving text to other\nlocations of your document. You can use the copy and cut\ncommands to avoid retyping text in your document. This section\ndeals with the use of clipboard in copying and moving text within\na document or other documents.\n4.6.1 The Use of Clipboard Copying Text\n  and Moving\n (Cutting) Text\nWhen you copy or cut text, the text is stored in an area of memory\ncalled clipboard and can be pasted back into the document or\ninto any other document. The last 12 elements that were cut or"
    },
    {
      "pageNumber": 96,
      "content": "Formatting  Documents::  75\ncopied are placed onto Word’s clipboard. You can view the\nelements on the clipboard by selecting Home\n→ → \n→ → \n→ Clipboard sub\ntask menu command on the menu bar.\nPlace the mouse arrow over each element\nin the clipboard to view the contents of each\nitem and click on an element to add its\ncontents to the document. Click Paste All\nto add all of the items to the document at\nonce. Click the Clear Clipboard button (the\nicon with an “X” over the clipboard image) to clear the contents\nof the clipboard.\n4.6.2 Moving (Cutting) Text\nMoving text means to remove (cut) the selected text from one\nlocation and insert it in another location. To move text follows the\nsteps given below:\n1.Select the text that will be moved.\n2.Select Home\n→→\n→→\n→ Clipboard sub task menu command on the\nmenu bar, or click the Cut button on the standard tool bar,\nor press CTRL+X keys. This will move the text to a\nclipboard.\n3.To paste cut text\n, move the cursor to the location you\nwant to move the text to and select Home\n→→\n→→\n→ Clipboard sub\ntask menu command on the menu bar, click the Paste\nbutton on the standard toolbar, or press CTRL+V keys.\nTo move a small amount of text a short distance, the drag-and-\ndrop method may be quicker. Highlight the text you want to move,\nclick the selection with the mouse, drag the selection to the new\nlocation, and release the mouse button.\n4.6.3 Copying Text\nCopying means to make a copy of the selected text and insert in\nanother location, leaving the original text unchanged. To copy\ntext, follow the steps given below:\n1.Select the text that will be moved."
    },
    {
      "pageNumber": 97,
      "content": "76  ::  Data  Entry  Operations\n2.Select Home\n→ → \n→ → \n→ Clipboard sub task menu command on the\nmenu bar, or click the Cut button on the standard tool bar,\nor press CTRL+X keys. This will move the text to a\nclipboard.\n3.Choose Home\n→→\n→→\n→Clipboard sub task menu command on the\nmenu bar, click the Copy button on the standard toolbar,\nor press CTRL+C keys to copy the text to the clipboard.\n4.7 SPELLING AND GRAMMAR\nThe spelling and grammar checkers check for misspelled words\nor grammar errors. The red wavy lines will appear underneath\nmisspelled words. The green wavy lines will appear underneath\ngrammatical errors. This section deals with the concepts and\ncommands of spelling and grammar corrections of your\ndocument.\nWord will automatically check for spelling and grammar errors as\nyou type unless you turn this feature off. Spelling errors are noted\nin the document with a red underline. Grammar errors are\nindicated by a green underline.\nFig. 4.11\nTo use the spelling and grammar checker, follow these steps:\n1.Select button from the main tab bar or press F7 button on\nthe key board.\n2.The Spelling and Grammar dialog box will notify you of the\nfirst mistake in the document and misspelled words will be\nhighlighted in red.\n3.If the word is spelled correctly, click the Ignore button or\nclick the Ignore All button if the word appears more than\nonce in the document."
    },
    {
      "pageNumber": 98,
      "content": "Formatting  Documents::  77\nFig. 4.12\n4.If the word is spelled incorrectly, choose one of the\nsuggested spellings in the Suggestions box and click the\nChange button or Change All button to correct all\noccurrences of the word in the document. If the correct\nspelling is not suggested, enter the correct spelling in the\nNot In Dictionary box and click the Change button.\n5.If the word is spelled correctly and will appear in many\ndocuments you type (such as your name), click the Add\nbutton to add the word to the dictionary so that it will no\nlonger appear as a misspelled word.\nAs long as the Check Grammar box is checked in the Spelling\nand Grammar dialog box, Word will check the grammar of the\ndocument in addition to the spelling. If you do not want the\ngrammar checked, remove the checkmark from this box.\nOtherwise, follow these steps for correcting grammar:\n1.If Word finds a grammar mistake, it will be shown in the box\nas the spelling errors. The mistake is highlighted in green\ntext.\n2.Several suggestions may be given in the Suggestions box.\nSelect the correction that best applies and click Change.\n3.If no correction is needed (Word is often wrong more than\nit is right), click the Ignore button."
    },
    {
      "pageNumber": 99,
      "content": "78  ::  Data  Entry  Operations\n4.8 PAGE FORMATTING\nIn this section, you will learn designing pages suiting to your\nneeds. For instance, the page setup options which included paper\nsize and page orientation etc. are normally set either by you or\nby default at the beginning of the opening a new document. These\noptions are available under Page Layout tab and can easily be\nchanged at any time according to your needs.\nFig. 4.13\n4.8.1 Page Margins\nThere are two methods by which you can change the page\nmargins of your document: (a) using ruler and (b) using Page\nSetup dial box.\n(a) Using Ruler\n1.Move the mouse over the area where the white ruler\nchanges to grey.\nFig. 4.14\n2.When the cursor becomes a double-ended arrow, click with\nthe mouse and drag the margin indicator to the desired\nlocation.\n3.Release the mouse when the margin is set."
    },
    {
      "pageNumber": 100,
      "content": "Formatting  Documents::  79\n(b) Using Page Set-up Dialog Box\nThe margins can also be changed using the Page Setup dialog\nbox:\n1.Select Page Layout Tab and click on the command on the\nmenu bar and choose the Margins button under Page\nSetup sub task group to display the margin dialog box.\n2.There are six predefined margins namely Normal, Narrow,\nModerate, Wide, Mirrored, Office 2003 Default available for\nyou to select. Either you can select any one of them as per\nthe requirement or click on the Customised Margins\nbutton to enter margin values in the Top, Bottom, Left, and\nRight boxes. The Preview window will reflect the changes.\n3.If the document has Headers and/or Footers, the distance\nthis text appears from the edge of the page can be changed.\n4.To apply the changes to the whole document click on the\ndrop-down arrow next to the Apply to: list box and change\nthe option to Whole document if it do not appear.\n5.Click OK when finished.\nFig. 4.15"
    },
    {
      "pageNumber": 101,
      "content": "80  ::  Data  Entry  Operations\n4.8.2 Page Size and Orientation\nChange the orientation of a page within the Page Setup dialog box.\n1.Select Page Layout\n→→\n→→\n→Size command on the main tab bar\nand choose from the available the Letter, Legal or A4 size\nas per requirement. Should need to look at more options,\nclick on the More Paper Sizes from the size sub task.\nFig. 4.16\n2.Select the proper paper size from the drop-down menu.\nFig. 4.17\n3.Change the orientation from Portrait or Landscape by\nselecting the corresponding button under Orientation\nsubtask in Page Layout in main tab bar.\nZoom in to the page\nFig. 4.18"
    },
    {
      "pageNumber": 102,
      "content": "Formatting  Documents::  81\n1.Select View Tab\n→→\n→→\n→Zoom sub task on the main tab bar. The\nZoom dialog box will appear on the screen. Check-mark the\nmany pages: box under Zoom to in the Zoom dialog box.\nClick OK.\n2.You will see displaying multiple pages of your document\non the screen. Select the pages to change the orientation.\n3.Choose File\n→→\n→→\n→Page\nSetup, and click on\nthe Paper Size tab.\nThen click on the\norientation option\n(Landscape       or\nPortrait) you need\nfor those selected\npages.\n4.Select  Apply  to:\noption in the drop-\ndown     box     as\nSelected text. Click\non     OK     when\nfinished.\n4.8.3 Headers and Footers\nA header is text that is added to the top margin of every page\nsuch as a document title or page number and footer is text added\nto the bottom margin. Follow these steps to add or edit headers\nand footers in the document:\nFig. 4.20\nFig. 4.19"
    },
    {
      "pageNumber": 103,
      "content": "82  ::  Data  Entry  Operations\n1.Select Insert\n→→\n→→\n→Header and Footer subtask menu on the\nmain tab bar. Click on the Header or Footer option as per\nthe requirement (Fig. 4.21).\n2.On selecting Header option, header toolbar will appear and\nthe top of the page will be highlighted as shown below (Fig.\n4.22).\n3.Type the heading in the Header box. You may use many\nof the standard text formatting options such as font face,\nsize, bold, italics, etc.\nFig. 4.21\nFig. 4.22"
    },
    {
      "pageNumber": 104,
      "content": "Formatting  Documents::  83\nSimilarly you can select the designated command for Footer (Fig.\n4.23) and customized it as per requirement.\nFig. 4.23\n4.8.4 Page Numbers\nFollow these instructions to add page numbers to a document.\nFig. 4.24\n1.Select  Insert\n→→\n→→\n→\nPage  Numbers\nfrom  the  main\ntab bar and the\nfollowing dialog\nbox will appear.\n2.Select          the\nPosition  of  the\npage numbers by\nchoosing “Top of\npage” or “Bottom\nof page” from the\nPosition  drop-\ndown menu.\n3.Click  OK  when\nfinished.\nFig. 4.25"
    },
    {
      "pageNumber": 105,
      "content": "84  ::  Data  Entry  Operations\nChanging Start Value of Page Numbers in a Document or in a\nParticular Section of a Document\nTo change the starting value of page numbers of a document,\nfollow the steps given below:\n1.Place the cursor on a page of the document. (If your\ndocument consist two or more sections, you may have to\nplace the cursor on a page in that particular section to\nchange the page numbers from the beginning page of that\nsection.).\n2.Select InsertPage Numbers subtask on the main tab and\nthe Page Numbers dialog box appears.\n3.Uncheck Show number on first page and click on Format\nin Page Numbers dialog box. The Page Number Format\ndialog box appears (Fig. 4.26).\nFig. 4.26\n4.At the bottom of the Page Number Format dialog box, click\non the Start at option box and increase or decrease the page\nnumber value or simply type a number in the Start at box."
    },
    {
      "pageNumber": 106,
      "content": "Formatting  Documents::  85\n5.Click OK to close Page Number Format dialog box and then\nclick OK to close Page Numbers dialog box.\n4.8.5 Inserting a Page Break\nWhen you are typing along and reach the bottom of a page in a\nWord document, a page break will be inserted automatically. The\npaper size will determine where automatic page breaks occur. If\nyou wish to end one page and start another page before the\nnatural page breaks, you should not press the ENTER key\nrepeatedly in order to move to the next page. Instead, follow one\nof the ways given below:\n1.Position the insertion point at the line where the page\nshould end. Choose Insert\n→→\n→→\n→Break command from menu\nbar. The Break dialog box appears (Fig. 4.27). Check-mark\nPage breaks under Break types in Break dialog box. Click\nOK to insert a page break.\nFig. 4.27\n2.Position the insertion point at the line where the page\nshould end. Press CTRL+ENTER keys to insert a page\nbreak.\n4.8.6 Deleting a Page Break\nThe easiest way to delete page breaks is to find and remove the\nextra page break indicator in the document. To do this switch\nover to Normal view, click on the Page Break line and press\nDELETE key to remove the page break."
    },
    {
      "pageNumber": 107,
      "content": "86  ::  Data  Entry  Operations\nINTEXT QUESTIONS\n7.The—————————command in the menu bar is used\nto access the Bullets and Numbering dialog box.\n8.What is the difference between copying text and moving\ntext?\n9.To view the elements on a clipboard, you select—————\n—————command from the menu bar.\n10.State True or False\n(a)Choosing Edit→ Copy command on the menu bar and\npressing CTRL+C keys are different actions.\n(b)You cannot use Custom dictionary to remove a word.\n(c)You can select synonyms of a word from shortcut\nmenu by right click.\n(d)The Spelling and Grammar checker can be activated\nby pressing F7 key on the keyboard.\n4.9WHAT YOU HAVE LEARNT\nIn this lesson you learnt about various features of formatting text.\nNow you are in a position to move text from one place to another,\nand apply different font and character styles. Also you can apply\nthe grammer and spell-check features of MS-word.\n4.10TERMINAL QUESTIONS\n1.What is the command in the menu bar to change text to Title\nCase?\n2.Explain the steps in inserting a symbol.\n3.What is a font face? Mention any two font families.\n4.How do you set line spacing in a paragraph?\n5.Write the steps for moving text.\n6.Write the steps for copying text.\n7.What is the use of AutoCorrect feature in Word?"
    },
    {
      "pageNumber": 108,
      "content": "Formatting  Documents::  87\n4.11FEEDBACK TO INTEXT QUESTIONS\n1.(a) Beginning of the line\n(b) End of the line\n(c) Top of the document\n(d) End of the document\n2.(a) Double-click within the word\n(b) Triple-click within the paragraph\n(c) Drag the mouse over the words, or hold down SHIFT key\nwhile using the arrow keys\n(d) Choose Edit\n→ → \n→ → \n→ Select All command on the menu bar\nor press CTRL+A keys.\n3.(a) False, (b) True, (c) False, (d) True\n4.(b) (SHIFT + ENTER keys)\n5.(c) 0.5 inch intervals\n6.(a) False, (b) True, (c) True, (d) False\n7.Format→Bullets and Numbering\n8.Copying means to make a copy of the selected text and\ninsert in another location, leaving the original text\nunchanged. Moving text means to remove the selected text\nfrom one location and insert it in another location.\n9.View→Toolbars→Clipboard\n10.(a) False, (b) False, (c) True, (d) True"
    },
    {
      "pageNumber": 109,
      "content": "88  ::  Data  Entry  Operations\n \nMail Merge\n5.1INTRODUCTION\nA common word processing task is to produce periodic mailings\nto send to different people or agencies connected to you or your\nprofession or your business. The mailings features in Word can\nhelp you to organize your address data, get it into a document,\nand print it out in the desired format. The main uses of Word’s\nMail Merge features are:\nlYou can merge a list of names and addresses to a single\nletter that can be sent to different people in their names and\naddresses.\nlYou can create categories, a single letter with variable\ninformation fields in it, or labels.\nlYou can also produce merged documents such as directory\nlists, invoices, print address lists, or print addresses on\nenvelopes and mailing labels.\n5.2OBJECTIVES\nAfter going through this lesson you would be able to:\nlto create form letters, mailing labels, envelopes\nlto organize the address data and merging it into a generic\ndocument,  and  printing  the  resulting  personalized\ndocuments\nlto customize a mail merge\n5"
    },
    {
      "pageNumber": 110,
      "content": "Mail  Merge  ::  89\n5.3TYPES OF DOCUMENTS IN MAIL MERGE\nMail Merge requires three types of documents:\n(a)Main  Document:  In  a  Mail  Merge  operation,  the\npersonalized document (such as, a standard letter, or\nenvelope, or mailing label) is known as the main document.\nIt is the document containing the text and graphics that stay\nthe same for each version of the merged document - for\nexample, the return address and body of a form letter.\n(b)Data Source: Data source is a file that contains the names\nand addresses or any other information that vary with each\nversion of a mail-merge document. For example, a list of\nnames and addresses for a form letter you want to send to\na list of clients or other people.\n(c)Merge Document: When you merge the main document\nwith data source, a third document called merge document\nwill be produced. The merge document can be merged to\nthe screen to view letters along with addresses; or directly\nto the printer to print the letters along with addresses and\nprint addresses on envelopes or labels; or save as some\nother file that can be used later for printing. Inserting the\ndata or information from the data source in the main\ndocument creates the merge document. For example,\ninsert the merge field «City» in a letter document to have\nWord insert a city name, such as “New Delhi” that is stored\nin the City data field.\nMail Merge or Mailings feature in Word 2007 is available in Main\nTab bar. Click on the ‘Mailings’ tab on the main tab bar to\nactivate the mailings features and tools, which comprises subtask\nsuch as “Create”, “Start Mail Merge”, “Write & Insert Fields”,\n“Preview Results” and “Finish & Merge”\nFig. 5.1"
    },
    {
      "pageNumber": 111,
      "content": "90  ::  Data  Entry  Operations\nFig. 5.3\n5.4 MAIL MERGE WIZARD\nThe   Mail   Merge   wizard\nguides  you  through  the\nprocess  of  doing  a  mail\nmerge. This involves creating\nand editing main document;\ncreating  a  new  data  file\nopening an existing data file;\nand merging the data fields\nwith main document. To use\nMail Merge Wizard, select Mailings\n→→\n→→\n→Start Mail Merge subtask\nfrom the main tab bar. Then select Step by Step Mail Merge\nWizard option on the subtask bar.\nThe  Mail  Merge  Wizard\nmenu  will  appear  on  the\nscreen. This will help you to\ncreate        mail        merge\ndocuments in customised\nstep manner. The Wizard has\n6  steps  to  create  a  mail\nmerge document.\n5.4.1 Select Document\nType\nIn this section you will learn how to select a\nmain document using Mail Merge Wizard.\nSelecting a Document Type is the first step\ntowards creating a mail merger document.\nUsing this option you can choose the type of\nmain document such as Letters, E-Mail\nMessages, Envelopes, Labels, Directory.\nMost often the standard document type used\nis Letter. However, it can also be a mailing\nlabel, an envelope etc. To create a simple\nletter with variable (current) date, follow these\nsteps:\nWhen you select Letters type, you can use\nthis letter to send to a group of people with a\nFig. 5.2\nFig. 5.4"
    },
    {
      "pageNumber": 112,
      "content": "Mail  Merge  ::  91\npersonalised letter that is received by different people in that\ngroup with different address.\nSelect Letters from the options given in the Select Document type\nbox and click on the “\nNext: Starting document” located on the\nlower end of the Wizard dialog box to move to the next step.\n5.4.2 Select Starting Document\n1.The 2\nnd\n step in the process is to select starting document\nunder Letters option. There are three options available.\nUse the current document: This is to use the current document\nshown and use the mail merge features to add recipients address\nor information. This is suitable when you already have letter draft\nfor the purpose and just want to add address of the recipients to\nthe letter.\nFig. 5.5\nStart from a Template: Similarly if you\ndon’t have a drafted letter for use, you\ncan choose for ready to use mail merge\ntemplate already available with Word\n2007.   These   templates   can   be\ncustomised as per your requirement.\nStart from existing document: If you\nalready have a document available with\nyou, you can select the exiting mail\nmerge document and make necessary\nchanges to the content of the letter and/\nor recipients.\nFig. 5.6"
    },
    {
      "pageNumber": 113,
      "content": "92  ::  Data  Entry  Operations\nLet us select “Start from a Template” and the select a blank\ndocument. When you select this option, Mail Merge Wizard will\ndisplay the following sub menu option to select a template. Here\nyou can select various templates that suit your requirement or\nyou can select a blank document to create your own customised\nletter. Let us select “Blank Document” to create our own\ncustomised letter.\n2.Leave some space (approximately 6 to 7 lines by pressing\nENTER key) to insert addresses through merge fields later.\nDo not type any thing in this space. We will learn how to\ninsert addresses from data source through data fields later\nin this unit. You can also insert fields anywhere in the body\nof the letter. The following Figure shows an example of form\nletter created to send the letters to all the students admitted\nfor DIT programme offered by National Institute of Open\nSchool. We have left some space below the date to insert\nname address fields of students. The enrolment number\nfield also can be inserted at ‘Your enrolment number is ‘\nlater when data source is ready.\nType the body of the letter.\nFig. 5.7\nSave your document.\n5.4.3 Creating a Data Source\nThe 3\nrd\n step in Mail Merge Wizard is to select a list of recipients\nor address to whom the drafted letter will be addressed and\ndispatch."
    },
    {
      "pageNumber": 114,
      "content": "Mail  Merge  ::  93\nIf  you  do  not  have  existing\ndatabase information, you must\ncreate your own data source of\nthe fields of information that will\nbe inserted into the letter or any\nother  main  document.  For\nexample, a Mail Merge letter\nyou have created earlier might\nrequire  that  you  have  the\nfollowing fields in address list of\nstudents as data source: Name,\nAddress1,   Address2,   City,\nState, and PIN Code.\nIn this lesson, you will learn how to create a data source using\nMail Merge Wizard using a Word table or importing your Excel\nWorksheet.\n(a) Creating a Data Source Using Mail Merge Helper\nYou can use the Mail Merge Wizard\nto create a Microsoft Word, Excel or\nAccess database data source.\nFollow these steps to create a data\nsource using Mail Merge Wizard:\nOpen a new blank document if you\nhave  not  yet  created  the  main\ndocument or open your existing\nmain document.\n1.Select “Type a new list” from\nthe  “Select  Recipients”\ndialog box in step 3 of the Mail Merge Wizard and then\nselect “Create” option.\n2.A dialog box appears to create a list with new set of data\nsuch as Title, First Name, Last Name, Company Name and\nAddress Line 1 and so on.\n3.You can start entering data to the respective field as per\nyour requirement directly into the displayed New Address\nList dialog box.\nFig. 5.8\nFig. 5.9"
    },
    {
      "pageNumber": 115,
      "content": "94  ::  Data  Entry  Operations\n4.Should you want to\nCustomise\nColumns the filed\nin the new address\nlist  to  remove  or\nadd any other field\nas     new     your\nrequirement, click\non the customised\nbutton located on\nthe lower right side\nof the New Address\nList dialog box.\n5.This will display a list of available data field to which you\ncan add a customised data filed, delete or rename an\nexiting data field in the list. Once done click on the “OK”\nbutton.\n6.When you finish specifying the required data fields to the\nnew address list, click OK. The Save As dialog box appears.\n7.Locate the folder that you want to save the data source in,\ntype a file name, and then click Save As in the Save As\ndialog box. The file will be saved with an extension name\n.mdb (Microsoft Database).\n(b) Editing Existing Data Records\nTo edit the existing data records in the data source file, follow\nthese steps:\n1.Open the data source file and then select Use an exiting\nlist option from the Select Recipients dialog box displayed\nin step 3 of the Mail Merger Wizard. The toolbar will appear\non the screen.\n2.Now click on the Browse option to display the Select Data\nSource dialog box. Now search the folder where you have\nstored the data file which you want to use and the click on\nOpen button to access the data file.\n3.You can open various data file format such as Access\ndatabase, Excel files, Word File, Rich Text format etc.\nFig. 5.10"
    },
    {
      "pageNumber": 116,
      "content": "Mail  Merge  ::  95\nFig. 5.11\n4.Once the data file is selected, based of the type of data file\nis selected, Mail Merger will ask you to define how to\ndistinguish between data fields and data record.\n5.Once it is done, the data file will be loaded in to Mail Merger\nand you can now click on Edit Recipient List button to be\nable to edit the list as per your requirement.\n6.To locate a data record that you want to change, move to\nthe record number you want change its contents by clicking\nthe arrow keys or typing the record number; or click Find,\nand then search for information that you know the record\ncontains.\n7.Edit the records that you want to change and save the\nchanges.\n(c) Creating a Data Source Using Word Table\nIn fact, the Mail Merge Wizard guides you step by step through\nsetting up a Word table that contains your names, addresses, and\nother data. Instead of taking advantage of Mail Merge Wizard, you\ncan also create a data source by entering field names and data\ndirectly in a Word table. Follow these steps to do this:\n1.Insert a table by selecting tab Insert\n→Table command on\nthe main tab bar and create a table as given below.\n2.Type the data field names on the top row of the table. Start\ntyping the data records from the second row.\n3.When you finish entering all the data records, save the table\nas a Word document. Your data source document is ready."
    },
    {
      "pageNumber": 117,
      "content": "96  ::  Data  Entry  Operations\n(d) Using Excel Worksheet to Create a Data Source\nYou can also use Excel program to create a data source. Follow\nthese steps do this.\n1.Start Excel program. Open Worksheet.\n2.Type the data field names on the top row of the worksheet.\nStart typing the data records from the second row.\n3.When you finish entering all the data records, save the\nworksheet.\n4. Select the data field names and data records you typed in\nthe worksheet, and then click on Copy button in the\nstandard toolbar. Close the file and then exit Excel\nprogram.\n5.Open Word program. Open a new document and then click\non Paste button. The data will be copied to word document\nin a table form. Save the document. Your data source\ndocument is ready.\n5.4.4 Merging Documents\nOnce if you have created your main document and data source\ndocument, the next two steps in mail merge are to insert merge\nfields in the main document and then merge data in the main\ndocument.\nTo merge the fields in the main document you may have to do\nsome editing in the main document. Follow these steps as\ndefined in the step 4 of the Mail Merge Wizard to do this:\n1.Click on the location of your letter where you want the\naddresses to be displayed and then\n2.Select Address Book option on the dialog box displayed in\nstep 4 of the Mail Merge Wizard. The Mail Merge Wizard\ndisplays the Insert Address Blok dialog box."
    },
    {
      "pageNumber": 118,
      "content": "Mail  Merge  ::  97\nFig. 5.12\n3.Using Insert Address Block you can select the individual\naddress field to be inserted into the main letter.\nFig. 5.13\n4.After you complete the main document and insert all of the\nmerge fields, click on the Office Button to save Save As\noption. Now select “Word Document” to save the file as a\nWord 2007 document or Select “Word 97-2003 Document”\nto save it as Word 97 or 2003 compatible ducument. Name\nthe document, and then click Save. Now your main\ndocument will work as merge document."
    },
    {
      "pageNumber": 119,
      "content": "98  ::  Data  Entry  Operations\n5.4.5 Merging the Data into the Main Document\nMerging the data into the main document is the last step of the\nMail Merge Wizard. Click on the << or >> button to display the\npreview of the main letter with address data before you close the\nmerge document and take the printout of the letter.\nFig. 5.14\nOnce finished click on the “\nNext: Complete the Merge” option on\nthe dialog box to complete the merging process.\nFig. 5.15\n5.5CREATING MAILING LABELS BY MERGING AN\nADDRESS LIST\nIf you have already created a data source (say address list) as\nexplained earlier, it is easier to merge this address list with your"
    },
    {
      "pageNumber": 120,
      "content": "Mail  Merge  ::  99\nmain document that can be used as mailing labels.\n1.Create the Main Document: Click on New on the Standard\ntoolbar. Then select Mailings\n→→\n→→\n→Start Mail Merge subtask\non the main tab bar. Under sub task Start Mail Merge,\nselect Labels. The Microsoft Word will display the Label\nOptions dialog box.\nFig. 5.16\n2.In the Label Options dialog box, select the type of printer\nand labels you want to use, and then click OK. (If the type\nof labels that you want to use is not listed in the Product\nnumber box, you can create your own custom labels.). Click\non the New Label button to create a customized label as\nper the requirement.\n3.Open the Data Source: Once you finished selecting the\nlabel type and format for use, it is now time to select the\ndata source from where the data will get added to the labels.\nIn the main tab bar, under Mailings tab, click Select\nRecipients, and then click on Type New List or Use\nExisting List or Select from Outlook Contacts depending\non whether you want to create new address list or use and\nexiting one.\n4.Select Use Existing List to display the Select Data Source\ndialog box. Browse to the location where you have created\nyour data source (address list), and then click Open button.\n5.You can open various data file format such as Access\ndatabase, Excel files, Word File, Rich Text format etc."
    },
    {
      "pageNumber": 121,
      "content": "100  ::  Data  Entry  Operations\nFig. 5.17\n6.Once the data file is selected, based of the type of data file\nis selected, Mail Merger will ask you to define how to\ndistinguish between data fields and data record.\n7.Once it is done, the data file will be loaded in to Mail Merger\nand you can now click on Edit Recipient List button under\nthe sub task Start Mail Merge to be able to edit the list as\nper your requirement.\n8.To locate a data record that you want to change, move to\nthe record number you want change its contents by clicking\nthe arrow keys or typing the record number; or click Find,\nand then search for information that you know the record\ncontains.\n9.Edit the records that you want to change and save the\nchanges.\n10.Select Mailings\n→→\n→→\n→Write & Insert Fields sub-task and click\non the Insert Merge Field to insert merge fields where you\nwant to merge addresses from the data source to be\ninserted on the labels document. Click Insert Merge Field\nand then click the field name you want to be inserted and\nclick OK. The selected data field or filename will get\ninserted on to the labels document and you can continue\nselecting the entire set of data field name you want to\nappear on the label document."
    },
    {
      "pageNumber": 122,
      "content": "Mail  Merge  ::  101\nFig. 5.18\n11.Merge the Data into the Main Document: In the Mailings\ntab bar, click on the Preview Results to display the merged\nlabels with actual data from the selected data source before\nthe labels are printed. This will help you to view the label\nas they will get printed and take any corrective measures\nif required before the labels are finally printed. You can also\nmove around the set if data fields to preview all the labels\nusing < and > button available under Preview Results sub-\ntask.\nFig. 5.19\n12.Merge the data with the document. If you want to send\nthe merged labels directly to a printer, click Finish & Merge\nsub-task under Mailings tab, and then click Print\nDocuments.\n13.The merged labels will be printed and will look like\nFig. 5.20"
    },
    {
      "pageNumber": 123,
      "content": "102  ::  Data  Entry  Operations\n5.6CREATING ENVELOPES BY MERGING AN\nADDRESS LIST\nIf you have already created a data source (say address list) as\nexplained earlier, it is easier to merge this address list with your\nenvelopes so that you can directly print the addresses in the\nenvelopes (instead of printing the address labels on stickers and\nthen sticking them on the envelopes) for mailing purpose. You\ncan do this in 4 steps:\n1.Create the Main Document:\nClick New Blank Document on\nthe Standard toolbar. Select\nMailings\n→Start Mail Merge\nsubtask on the main tab bar.\nUnder sub task Start Mail\nMerge, select Envelopes. The\nMicrosoft Word will display the\nEnvelop Options dialog box.\n2.On the Envelope Options tab,\nselect the envelope size you\nwant from a variety of predefined sizes given under\nEnvelope size: drop down box, and adjust the address\nformat and position on the envelope. (If the envelope size\nthat you want to use is not listed in the Envelope size: box,\nyou can create your own custom envelope by selecting\nCustom size under Envelope size: drop down box in the\nEnvelope Options dialog box.) Click on the Printing\nOptions tab, and make sure that the selected envelope\nfeed options are correct for your printer, and then click OK.\n3.Open the Data Source: Once you\nfinished selecting the label type\nand format for use, it is now time\nto select the data source from\nwhere the data will get added to\nthe labels. In the main tab bar,\nunder Mailings tab, click Select\nRecipients, and then click on\nType New List or Use Existing\nList  or  Select  from  Outlook\nContacts depending on whether\nFig. 5.21\nFig. 5.22"
    },
    {
      "pageNumber": 124,
      "content": "Mail  Merge  ::  103\nyou want to create new address list or use and exiting one.\n4.Select Use Existing List to display the Select Data Source\ndialog box. Browse to the location where you have created\nyour data source (address list), and then click Open button.\n5.You can open various data file format such as Access database,\nExcel files, Word File, Rich Text format etc.\nFig. 5.23\n6.Once the data file is selected, based of the type of data file\nis selected, Mail Merger will ask you to define how to\ndistinguish between data fields and data record.\n7.Once it is done, the data file will be loaded in to Mail Merger\nand you can now click on Edit Recipient List button to be\nable to edit the list as per your requirement.\n8.To locate a data record that you want to change, move to\nthe record number you want change its contents by clicking\nthe arrow keys or typing the record number; or click Find,\nand then search for information that you know the record\ncontains.\n9.Edit the records that you want to change and save the\nchanges.\n10.In Mailings Tab under Write & Insert Fields sub-task,\nclick on the Insert Merge Field to insert merge fields where\nyou want to merge addresses from the data source to be\ninserted on the labels document. Click Insert Merge Field\nand then click the field name you want to be inserted and\nclick OK. The selected data field or filename will get\ninserted on to the envelope and you can continue selecting\nthe entire set of data field name you want to appear on the\nenvelope document."
    },
    {
      "pageNumber": 125,
      "content": "104  ::  Data  Entry  Operations\nFig. 5.24\n11.Merge the Data into the Main Document: In the Mailings tab\nbar, click on the Preview Results to display the merged labels\nwith actual data from the selected data source before the labels\nare printed. This will help you to view the label as they will get\nprinted and take any corrective measures if required before the\nlabels are finally printed. You can also move around the set if\ndata fields to preview all the labels using < and > button\navailable under Preview Results sub-task.\nFig. 5.25\n12.Merge  the  data  with  the\ndocument. If you want to send\nthe merged labels directly to a\nprinter, click Finish & Merge\nsub-task under Mailings tab,\nand then click Print Documents.\nINTEXT QUESTIONS\n1.What is the difference between main document and merge\ndocument in Main Merge?\n2.In Mail Merge, a data source can be created using ———\n—— or—————.\n3.You can merge the data records to—————— or ———.\n4.To send the merged documents for electronic mailing, it is\nnecessary  that  your  computer  has  the  —————\nconnection.\nFig. 5.26"
    },
    {
      "pageNumber": 126,
      "content": "Mail  Merge  ::  105\n5.State True or False\na.Using Word’s Mail Merge features you can merge address list\nin a single letter that can be sent to different people but you\ncannot insert variable fields in the body text of the letter.\nb.It is not possible to send the merged documents for fax without\nFax machine connected to your computer.\nc.The data records created in a worksheet using Excel cannot be\nused as a data source for Mail Merge.\n5.7WHAT YOU HAVE LEARNT\nIn this lesson you learnt about the use of mail-merge in MS-Word\nenvironment. Now you can merge a list of names and addresses\nto a single letter that can be sent to different people in their names\nand address. Secondly, you can create categories, a single letter\nwith variable information fields in it, or labels. Finally, you can\nproduce merged documents such as directory lists, invoices and\naddress lists, Print addresses print on envelopes or mailinbg\nlabels.\n5.8TERMINAL QUESTIONS\n1.Briefly explain the following: (a) Main document, (b) Data\nsource, and (c) Merge document.\n2.Write any two features of Mail Merge.\n3.Explain steps in creating a main document for form letter.\n4.Write steps in editing existing data records in Main Merge.\n5.How do you create a data source using Word table?\n6.Write steps in using Excel worksheet as a data source for\nyour Mail Merge.\n5.9FEEDBACK TO INTEXT QUESTIONS\n1.In a Mail Merge operation, the personalized document (such\nas a letter) is called as the main document. When you\nmerge the main document with data source, a third\ndocument called merge document will be produced.\n2.Mail Merge Helper or Word Table.\n3.A new document or printer.\n4.Internet\n5.(a) False (b) True (c) False"
    },
    {
      "pageNumber": 127,
      "content": "106  ::  Data  Entry  Operations\n \nBasics of Spreadsheet\n6.1INTRODUCTION\nA spreadsheet is a large sheet having data and information\narranged in rows and columns. As you know, Excel is one of the\nmost widely used spreadsheet applications. It is a part of\nMicrosoft Office suite. Spreadsheet is quite useful in entering,\nediting, analysing and storing data. Arithmatic operations with\nnumerical data such as addition, subtraction, multiplication and\ndivision can be done using Excel. You can sort numbers/\ncharacters according to some given criteria (like ascending,\ndescending etc.) and use simple financial, mathematical and\nstatistical formulas.\n6.2OBJECTIVES\nAfter going through this lesson you would be able to:\nlexplain the basic features of MS Excel 2007\nlset up pages and their printing\nlmodify a worksheet\nlenter and edit data in a worksheet\nlwork on keyboard shortcuts\n6"
    },
    {
      "pageNumber": 128,
      "content": "Basics  of  Spreadsheet  ::  107\n6.3 FEATURES OF SPREADSHEETS\nThere are a number of features that are available in Excel to\nmake your task easier. Some of the main features are:\n1.AutoSum - helps you to add the contents of a cluster of\nadjacent cells.\n2.List AutoFill - automatically extends cell formatting when\na new item is added to the end of a list.\n3.AutoFill - allows you to quickly fill cells with repetitive or\nsequential data such as chronological dates or numbers,\nand repeated text. AutoFill can also be used to copy\nfunctions. You can also alter text and numbers with this\nfeature.\n4.AutoShapes toolbar will allow you to draw a number of\ngeometrical shapes, arrows, flowchart elements, stars and\nmore. With these shapes you can draw your own graphs.\n5.Wizard - guides you to work effectively while you work by\ndisplaying various helpful tips and techniques based on\nwhat you are doing.\n6.Drag and Drop - it will help you to reposition the data and\ntext by simply dragging the data with the help of mouse.\n7.Charts - it will help you in presenting a graphical\nrepresentation of your data in the form of Pie, Bar, Line\ncharts and more.\n8.PivotTable - it flips and sums data in seconds and allows\nyou to perform data analysis and generating reports like\nperiodic financial statements, statistical reports, etc. You\ncan also analyse complex data relationships graphically.\n9.Shortcut Menus - the commands that are appropriate to\nthe task that you are doing will appear by clicking the right\nmouse button.\n6.4 FEATURES OF MS EXCEL 2007\n(a) Results-oriented user interface\nThe new results-oriented user interface makes it easy for you to\nwork in Microsoft Office Excel. Commands and features that were\noften buried in complex menus and toolbars are now easier to\nfind on task-oriented tabs that contain logical groups of\ncommands and features. Many dialog boxes are replaced with"
    },
    {
      "pageNumber": 129,
      "content": "108  ::  Data  Entry  Operations\ndrop-down galleries that display the available options, and\ndescriptive tooltips or sample previews are provided to help you\nchoose the right option.\n(b) More rows and columns, and other new limits\nThe grid of Excel 2007 is having 1,048,576 rows and 16,384\ncolumns. Thus it provides a user with 1,500% more rows and\n6,300% more columns than the Microsoft Office Excel 2003. The\nlast column in Excel 2007, is XFD instead of IV in Excel 2003. The\nnumber of cell references per cell is increased to limit as\nmaximum available memory. The formatting types are also\nincreased to unlimited number in the same workbook as\ncompared to the earlier limit of four thousand types of formatting.\n(c) Office themes and Excel styles\nBy the help of a specific style, in Excel 2007, the data can be\nquickly formatted in the worksheet by the help of a theme. You\ncan share themes across other releases of Office 2007 e.g. Word\n2007, Power point 2007.\nApplying a theme: Themes are used to make great-looking\ndocuments. A theme is defined as a predefined set of colors,\nlines, fonts and fills effects. Theme can be applied to a specific\nitem like tables, charts or it can also be applied to entire\nworkbook.\nUsing styles: A predefined theme based format is called style.\nIt can be applied to change the appearance of Excel charts, tables,\nPivotTables, diagrams or shapes. Styles can be customized to\nmeet user specific requirements. It is important to note that in\ncase of charts you cannot create your own styles, but you can use\npreexisting styles.\n(d) Rich conditional formatting\nIt is easy to use and apply conditional formats. A few tricks are\nrequired to observe the relationships in data, which helps to great\nextent for analysis purposes.\nImportant data trends and exceptions can be easily observed by\nthe help of implementation and management of multiple"
    },
    {
      "pageNumber": 130,
      "content": "Basics  of  Spreadsheet  ::  109\nconditional formatting rules which apply rich visual formatting in\nthe form of data bars, gradient colors, and icon sets to data that\nmeets those rules.\n(e) Easy formula writing\nSome improvements that make formula writing much easier are\nas given below\nResizable formula bar: To prevent the formulas to cover the other\ndata in worksheet, the formula bar automatically resizes to\naccommodate complex, long formulas. More levels of nesting can\nbe used to write longer formulas as an enhanced feature of earlier\nversions of Excel.\nFunction AutoComplete: Function AutoComplete feature helps\nto write the proper formula syntax more quickly. It helps in\ndetecting the functions that you want to use and helps in\ncompleting the formula.\nStructured references: Excel 2007 provides structured\nreferences to refer the named ranges and tables in a formula. This\nis in addition to the cell references, like D1 and A1C1.\nEasy access to named ranges: You can organize, update and\nhandle multiple named ranges in a central location by the help\nof Excel 2007. This helps you to work on your worksheet,\ninterpret its data and formulas.\n(f) Improved sorting and filtering\nEnhanced filtering and sorting techniques of Excel can be used\nto arrange worksheet data more quickly to find the desired\nanswers. In Excel 2007 you can sort data by color and by more\nthan 3 levels.\nYou can also filter data by color or by dates, display more than\n1000 items in the AutoFilter drop-down list, select multiple items\nto filter, and filter data in PivotTables."
    },
    {
      "pageNumber": 131,
      "content": "110  ::  Data  Entry  Operations\nMicrosoft\nExcel 2007\n6.5 STARTING EXCEL\n1.Click on (with the help of mouse) the Start button on the\nTaskbar at the bottom left corner of the Screen\n2.Highlight the All Programs item. The program menu will\nopen.\n3.Select Microsoft Office from the list of programs. (these\nsteps are shown Figure 6.1)\n4.Click on Microsoft Excel.\nSymbolically these actions are shown below.\nSelect Start\n→→\n→→\n→All Programs\n→→\n→→\n→Microsoft Office\n→→\n→→\n→Microsoft Excel\n2007 commands from your menu bar.\nFig. 6.1"
    },
    {
      "pageNumber": 132,
      "content": "Basics  of  Spreadsheet  ::  111\nThroughout the text of your lessons on MS Excel we will be\nshowing the symbol→to indicate the direction (steps) you have\nto follow.\nYou can also start Excel 2007 through run menu as shown below\nin figure 6.2.\nFig. 6.2\nType excel in the open text box and click OK button. It will start\nMS Excel 2007."
    },
    {
      "pageNumber": 133,
      "content": "112  ::  Data  Entry  Operations\n6.6 EXCEL WORKSHEET\nExcel allows you to create worksheets much like paper ledgers\nthat can perform automatic calculations. Each Excel file is a\nworkbook that can hold many worksheets. The worksheet is a\ngrid of columns (designated by letters) and rows (designated by\nnumbers). The letters and numbers of the columns and rows\n(called labels) are displayed in gray buttons across the top and\nleft side of the worksheet. The intersection of a column and a row\nis called a cell. Each cell on the spreadsheet has a cell address\nthat is the column letter and the row number. Cells can contain\ntext, numbers, or mathematical formulas.\nFig. 6.3"
    },
    {
      "pageNumber": 134,
      "content": "Basics  of  Spreadsheet  ::  113\n6.6.1 Selecting, Adding and Renaming Worksheets\nThe worksheets in a workbook are accessible by clicking the\nworksheet tabs just above the status bar. By default, three\nworksheets are included in each workbook. One can add more\nworksheet in a workbook also. To do that\nInsert a new worksheet\nTo quickly insert a new worksheet at the end of existing\nworksheets\nClick the Insert Worksheet tab as shown below (encircled with\nblue circle)\nFig. 6.4\nTo insert a new worksheet before an existing worksheet,\nSelect the worksheet before which you want to insert a new\nworksheet then follow steps as\n1.Select Home tab\n2.Click cells Group\n3.Click Insert\n4.Click Insert Sheet\nSay if you want to insert a new worksheet before a sheet name\nPhysics\nNew Worksheet"
    },
    {
      "pageNumber": 135,
      "content": "114  ::  Data  Entry  Operations\nFig. 6.5"
    },
    {
      "pageNumber": 136,
      "content": "Basics  of  Spreadsheet  ::  115\nA new sheet by the name sheet1 is added before the work sheet\nnamed Physics.\nAlternative Method to Insert a new worksheet\nRight click on the sheet before which you want to insert a new\nsheet\nSelect Insert Option from Pop up Menu\nFig. 6.6"
    },
    {
      "pageNumber": 137,
      "content": "116  ::  Data  Entry  Operations\nTo rename a worksheet\n1.To rename a worksheet follow the steps as\n2.Right click on the worksheet tab which you want to rename\n3.Select rename from the Pop Up menu\n4.Type new name for the Worksheet (Chemistry in our\nexample)\nFig. 6.7"
    },
    {
      "pageNumber": 138,
      "content": "Basics  of  Spreadsheet  ::  117\n6.7 SELECTING CELLS AND RANGES\nTo enter data into your worksheet you must first have a cell or\nrange selected. When you open an Excel worksheet, cell A1 is\nalready active. An active cell will appear to have a darker border\naround it than other cells on the worksheet. The simplest way to\nselect a cell is with your mouse pointer. Move your mouse to the\ndesired cell and click on it with right button. Whatever you type\ngoes into the cell. To select a range of cells, click on one cell, hold\ndown the left mouse button and drag the mouse pointer to the\nlast cell of the range you want to select. You can also use keyboard\nshortcuts given at the end of this lesson for selecting cells.\nAnother way to select particular range of cells is\n1.Go to Name Box\n2.Select range by typing (A1:C5)\n3.Press Enter\n4.All the cells between range A1 to C5 will be selected.\nSteps are explained pictorially as"
    },
    {
      "pageNumber": 139,
      "content": "118  ::  Data  Entry  Operations\nFig. 6.8\n6.8 NAVIGATING THE WORKSHEET\nYou can advance through your worksheet by rows with the\nvertical scrollbar or by columns with the horizontal scrollbar.\nWhen you click and drag the thumb tab on the scrollbar, a Screen\nTip will appear alongside the bar identifying the row or column\nto which your view is advancing."
    },
    {
      "pageNumber": 140,
      "content": "Basics  of  Spreadsheet  ::  119\nMove or scroll through a worksheet\nWe can scroll through worksheet by different ways. One can use\nmouse, scroll bar or arrow keys to move between cells and to\ndifferent areas of the worksheet.\nTo move between cells on a worksheet, click any cell or use the\narrow keys. When you move to a cell, it becomes the active cell.\nScroll and zoom by using the mouse\nSome mouse devices and other pointing devices, such as the\nMicrosoft IntelliMouse pointing device, have built-in scrolling and\nzooming capabilities that you can use to move around and zoom\nin or out on your worksheet or chart sheet (chart sheet: A sheet\nin a workbook that contains only a chart. A chart sheet is\nbeneficial when you want to view a chart or a PivotChart report\nseparately from worksheet data or a PivotTable report.). You can\nalso use the mouse to scroll in dialog boxes that have drop-down\nlists with scroll bars.\n6.9 DATA ENTRY\nYou can enter various kinds of data in a cell.\n1.Numbers: Your numbers can be from the entire range of\nnumeric values: whole numbers (example, 25), decimals\n(example,  25.67)  and  scientific  notation  (example,\n0.2567E+2). Excel displays scientific notation automatically\nif you enter a number that is too long to be viewed in its\nentirety in a cell. You may also see number signs (# # # # #\n#) when a cell entry is too long. Widening the column that\ncontains the cell with the above signs will allow you to read\nthe number.\n2.Text: First select the cell in which data has to be entered\nand type the text. Press ENTER key to finish your text entry.\nThe text will be displayed in the active cell as well as in the\nFormula bar. If you have numbers to be treated as text use\nan apostrophe (‘) as the first character. You cannot do\ncalculations with these kind of data entry.\n3.Date and Time: When you enter dates and times, Excel\nconverts these entries into serial numbers and kept as\nbackground information. However, the dates and times will\nbe displayed to you on the worksheet in a format opted by\nyou."
    },
    {
      "pageNumber": 141,
      "content": "120  ::  Data  Entry  Operations\n4.Data in Series: You can fill a range of cells either with the\nsame value or with a series of values with the help of\nAutoFill.\n6.10 EDITING DATA\nEditing your Excel worksheet data is very easy. You can edit your\ndata by any of the following ways:\n1.Select the cell containing data to be edited. Press F2. Use\nBackspace key and erase the wrong entry. Retype the\ncorrect entry.\n2.Select the cell and simply retype the correct entry.\n3.If you want only to clear the contents of the cell, select the\ncell and press Delete key.\n4.To bring back the previous entry, either click on Undo\nbutton on standard Toolbar or select Edit\n→→\n→→\n→Undo command\nor use keyboard shortcuts CTRL+Z.\n6.11 CELL REFERENCES\nEach worksheet contains a number of columns and rows. Each\ncell of the worksheet has a unique reference. For example, A8,\nrefers to the cell containing column number A and row number 8.\n6.12 FIND AND REPLACE DATA IN A WORKSHEET\nYou may want to locate a number or text that is already typed in\nthe worksheet. This is done through Home Tab\n→→\n→→\n→Find. You can\nalso locate your data and replace with new data with Home\nTab\n→→\n→→\n→Find\n→→\n→→\n→Replace.\nFig. 6.9"
    },
    {
      "pageNumber": 142,
      "content": "Basics  of  Spreadsheet  ::  121\n6.13 MODIFYING A WORKSHEET\n6.13.1 Insert Cells, Rows, Columns and Delete Cells\nInsert blank cells on a worksheet\nlSelect the cell or the range (range: Two or more cells on a\nsheet. The cells in a range can be adjacent or nonadjacent.)\nof cells where you want to insert the new blank cells. Select\nthe same number of cells as you want to insert. For\nexample, to insert five blank cells, you need to select five\ncells.\nlOn the Home tab, in the Cells group, click the arrow next\nto Insert, and then click Insert Cells.\nlYou can also right-click the selected cells and\nthen click Insert on the shortcut menu.\nlIn the Insert dialog box, click the direction in\nwhich you want to shift the surrounding cells.\nInsert rows on a worksheet\n1.Do one of the following:\nlTo insert a single row, select the row or a cell in the\nrow above which you want to insert the new row. For\nexample, to insert a new row above row 5, click a cell\nin row 5.\nlTo insert multiple rows, select the rows above which\nyou want to insert rows. Select the same number of\nrows as you want to insert. For example, to insert\nthree new rows, you need to select three rows.\nlTo insert nonadjacent rows, hold down\nCTRL while you select nonadjacent rows.\n2.On the Home tab, in the Cells group, click the\narrow next to Insert, and then click Insert\nSheet Rows.\nInsert columns on a worksheet\n1.Do one of the following:\nlTo insert a single column, select the column or a cell\nin the column immediately to the right of where you"
    },
    {
      "pageNumber": 143,
      "content": "122  ::  Data  Entry  Operations\nwant to insert the new column. For example, to insert\na new column to the left of column B, click a cell in\ncolumn B.\nlTo insert multiple columns, select the columns\nimmediately to the right of where you want to insert\ncolumns. Select the same number of columns as you\nwant to insert. For example, to insert three new\ncolumns, you need to select three columns.\nlTo insert nonadjacent columns, hold down CTRL\nwhile you select nonadjacent columns.\n2.On the Home tab, in the Cells group, click the\narrow next to Insert, and then click Insert\nSheet Columns.\nDelete cells, rows, or columns\n1.Select the cells, rows, or columns that you want to delete.\n2.On the Home tab, in the Cells group, do one of the following:\nlTo delete selected cells, click the arrow\nnext to Delete, and then click Delete\nCells.\nlTo delete selected rows, click the arrow\nnext to Delete, and then click Delete\nSheet Rows.\nlTo delete selected columns, click the arrow next to\nDelete, and then click Delete Sheet Columns.\n3.If you are deleting a cell or a range of cells, in the Delete\ndialog box, click Shift cells left, Shift cells up, Entire row,\nor Entire column.\n6.13.2 Resizing Rows and Columns\nSet a column to a specific width\n1.Select the column or columns that you want to\nchange.\n2.On the Home tab, in the Cells group, click\nFormat."
    },
    {
      "pageNumber": 144,
      "content": "Basics  of  Spreadsheet  ::  123\n3.Under Cell Size, click Column Width.\n4.In the Column width box, type the value that you want.\nChange the column width to fit the contents\n1.Select the column or columns that you want to change.\n2.On the Home tab, in the Cells group, click\nFormat.\n3.Under Cell Size, click AutoFit Column Width.\nTo quickly autofit all columns on the worksheet,\nclick the Select All button and then double-\nclick any boundary between two column\nheadings.\nMatch the column width to another column\n1.Select a cell in the column.\n2.On the Home tab, in the Clipboard group, click\nCopy, and then select the target column.\n3.On the Home tab, in the Clipboard group, click\nthe arrow below Paste, and then click Paste\nSpecial.\n4.Under Paste, select Column widths.\nChange the width of columns by using the mouse\nDo one of the following:\nlTo change the width of one column, drag the boundary on\nthe right side of the column heading until the column width\nchanges to the desiredsize that you want.\nlTo change the width of multiple columns, select the\ncolumns that you want to change, and then drag a\nboundary to the right of a selected column heading.\nlTo change the width of columns to fit the\ncontents, select the column or columns\nthat you want to change, and then double-\nclick the boundary to the right of a selected\ncolumn heading."
    },
    {
      "pageNumber": 145,
      "content": "124  ::  Data  Entry  Operations\nlTo change the width of all columns on the worksheet, click\nthe Select All button, and then drag the boundary of any\ncolumn heading.\nSet a row to a specific height\n1.Select the row or rows that you want to change.\n2.On the Home tab, in the Cells group, click\nFormat.\n3.Under Cell Size, click Row Height.\n4.In the Row height box, type the value that you\nwant.\nChange the row height to fit the contents\n1.Select the row or rows that you want to change.\n2.On the Home tab, in the Cells group, click\nFormat.\n3.Under Cell Size, click AutoFit Row Height.\nTo quickly autofit all rows on the worksheet,\nclick the Select All button and then double-click the\nboundary below one of the row headings.\nChange the height of rows by using the mouse\nDo one of the following:\nlTo change the row height of one row, drag the boundary\nbelow the row heading until the row is the height that you\nwant.\nlTo change the row height of multiple rows,\nselect the rows that you want to change, and\nthen drag the boundary below one of the\nselected row headings.\nlTo change the row height for all rows on the\nworksheet, click the Select All button, and\nthen drag the boundary below any row\nheading.\nlTo change the row height to fit the contents,\ndouble-cl\n6.13.3 Move or copy entire cells\nWhen you move or copy a cell, Excel moves or copies the entire\ncell, including formulas and their resulting values, cell formats,\nand comments."
    },
    {
      "pageNumber": 146,
      "content": "Basics  of  Spreadsheet  ::  125\n1.Select the cells that you want to move or copy.\n2.On the Home tab, in the Clipboard group, do\none of the following:\nlTo move cells, click Cut\n. Keyboard\nshortcut or CTRL+X.\nlTo copy cells, click Copy\n. Keyboard shortcut or\nCTRL+C.\n3.Select the upper-left cell of the paste area.\n4.On the Home tab, in the Clipboard group, click Paste.\nOr CTRL+V.\nMove or copy entire cells by using the mouse\nBy default, drag-and-drop editing is turned on so that you can\nuse the mouse to move and copy cells.\n1.Select the cells or range of cells that you want to move or\ncopy.\n2.Do one of the following:\nlTo move a cell or range of cells, point to the border of\nthe selection. When the pointer becomes a move\npointer\n, drag the cell or range of cells to another\nlocation.\nlTo copy a cell or range of cells, hold down CTRL while\nyou point to the border of the selection. When the\npointer becomes a copy pointer , drag the cell or\nrange of cells to another location.\nInsert moved or copied cells between existing cells\n1.Select the cell or range of cells that contains the data that\nyou want to move or copy.\n2.On the Home tab, in the Clipboard group, do\none of the following:\nlTo move the selection, click Cut\n. or\npress CTRL+X.\nlTo copy the selection, click Copy\n. or press CTRL+C."
    },
    {
      "pageNumber": 147,
      "content": "126  ::  Data  Entry  Operations\n3.Right-click the upper-left cell of the paste area, and then\nclick Insert Cut Cells or Insert Copied Cells on the\nshortcut menu.\n4.In the Insert Paste dialog box, click the direction in which\nyou want to shift the surrounding cells.\nPrevent copied blank cells from replacing data\n1.Select the rangeof cells that contains blank cells.\n2.On the Home tab, in the Clipboard group, click Copy\n.\nKeyboard  shortcut  You  can  also  press\nCTRL+C.\n3.Select the upper-left cell of the paste area.\n4.On the Home tab, in the Clipboard group, click\nthe arrow below Paste\n, and then click Paste\nSpecial.\n5.Select the Skip blanks check box.\nMove or copy the contents of a cell\n1.Double-click the cell that contains the data that you want\nto move or copy.\n2.In the cell, select the characters that you want to move or\ncopy.\nTo select theDo this\ncontents of a cell\nIn the cellDouble-click the cell, and then drag across the\ncontents of the cell that you want to select.\nIn the formula bar Click the cell, and then drag across the contents of the\ncell that you want to select in the formula bar.\nBy using the keyboardPress F2 to edit the cell, use the arrow keys to position\nthe insertion point, and then press SHIFT+ARROW key\nto select the contents.\n3.On the Home tab, in the Clipboard group, do one of the\nfollowing:\nlTo move the selection, click Cut \n.\nlTo copy the selection, click Copy \n.\n4.In the cell, click where you want to paste the"
    },
    {
      "pageNumber": 148,
      "content": "Basics  of  Spreadsheet  ::  127\ncharacters, or double-click another cell to move or copy the\ndata.\n5.On the Home tab, in the Clipboard group, click Paste \n.\n6.Press ENTER.\nCopy cell values, cell formats, or formulas only\nWhen you paste copied data, you can do any of the following:\nlConvert any formulas in the cell to the calculated values\nwithout overwriting the existing formatting.\nlPaste only the cell formatting, such as font color or fill color\n(and not the contents of the cells).\nlPaste only the formulas (and not the calculated values).\n1.Select the cell or range of cells that contains the values, cell\nformats, or formulas that you want to copy.\n2.On the Home tab, in the Clipboard group, click Copy\n.\n3.Select the upper-left cell of the paste area or the\ncell where you want to paste the value, cell\nformat, or formula.\n4.On the Home tab, in the Clipboard group, click\nthe arrow below Paste \n, and then do one of the\nfollowing:\nlTo paste values only, click Paste Values.\nlTo paste cell formats only, click Paste Special, and then\nclick Formats under Paste.\nlTo paste formulas only, click Formulas.\nDrag and Drop\nIf you are moving the cell contents only a short distance, the drag-\nand-drop method may be easier. Simply drag the highlighted\nborder of the selected cell to the destination cell with the mouse.\nFreeze Panes\nIf you have a large worksheet with column and row headings,\nthose headings will disappear as the worksheet is scrolled. By\nusing the Freeze Panes feature, the headings can be visible at\nall times."
    },
    {
      "pageNumber": 149,
      "content": "128  ::  Data  Entry  Operations\n1.Click the label of the row below the row that should remain\nfrozen at the top of the worksheet.\n2.Select View Tab\n→→\n→→\n→Window Group on ribbon\n→→\n→→\n→Freeze\nPanes\n→→\n→→\n→Freeze Panes\n3.To remove the frozen panes, View Tab\n→→\n→→\n→Window Group on\nribbon\n→→\n→→\n→Freeze Panes\n→→\n→→\n→Unfreeze Panes\nFig. 6.10\nFreeze panes has been added to row 2 in the image above. Notice\nthat the row numbers skip from 1 to 11. As the worksheet is\nscrolled, rows 1 will remain stationary while the remaining rows\nwill move. Following similar steps you can Freeze or Unfreeze\nselected columns."
    },
    {
      "pageNumber": 150,
      "content": "Basics  of  Spreadsheet  ::  129\nFig. 6.11\nUnfreeze Panes option will come only if the respective panes are\nalready Freeze.\n6.14 PAGE BREAKS\nTo set page breaks within the worksheet, select the row you want\nto appear just below the page break by clicking the row’s label.\nThen choose Page Layout\n→→\n→→\n→Setup Group\n→→\n→→\n→Breaks\n→→\n→→\n→Input Page\nBreak. Excel will start a new page from the row selected.\nFig. 6.12"
    },
    {
      "pageNumber": 151,
      "content": "130  ::  Data  Entry  Operations\n6.15 PAGE SETUP\nSelect File→Page Setup from the menu bar to format the page,\nset margins, and add headers and footers.\n1.Page: The page option allows you to set the paper size,\norientation of the data, scaling of the area, print quality, etc.\nSelect the Orientation under the Page tab in the Page Setup\nwindow to make the page Landscape or Portrait. The size\nof the worksheet on the page can also be formatted using\nScaling. To force a worksheet to print only one page wide\nso that all the columns appear on the same page, select Fit\nto 1 page(s) wide.\nFig. 6.13"
    },
    {
      "pageNumber": 152,
      "content": "Basics  of  Spreadsheet  ::  131\n2.Margins: Change the top, bottom, left, and right margins\nby selecting Margins from the page setup group of age\nLayout Tab. Enter values in the header and footer fields to\nindicate how far from the edge of the page this text should\nappear. Check the boxes for centering horizontally or\nvertically on the page.\nFig. 6.14\nThere are three predefined margin settings. You can choose from\nthem or you can also customize the margins as shown by the\nfollowing diagram.\nFig. 6.15"
    },
    {
      "pageNumber": 153,
      "content": "132  ::  Data  Entry  Operations\n3.Add or change the header or footer text: For worksheets,\nyou can work with headers and footers in Page Layout view.\nFor other sheet types, such as chart sheets or for embedded\ncharts, you can work with headers and footers in the Page\nSetup dialog box.\nAdd or change the header or footer text for a worksheet in\nPage Layout view\n1.Click the worksheet to which you want to add headers or\nfooters, or that contains headers or footers that you want\nto change.\n2.On the Insert tab, in the Text\ngroup, click Header & Footer.\n3.Do one of the following:\nlTo add a header or footer, click the left, center, or right\nheader or footer text box at the top or at the bottom\nof the worksheet page.\nlTo change a header or footer, click the header or\nfooter text box at the top or at the bottom of the\nworksheet page that contains header or footer text,\nand then select the text that you want to change.\n4.Type the text that you want.\nTo close the headers or footers, click anywhere in the\nworksheet, or press ESC.\n5.Sheet tab has the option to select the area to be printed\n(that is, range of cells). Check Gridlines if you want the\ngridlines dividing the cells to be printed on the page. If the\nworksheet is several pages long and only the first page\nincludes titles for the columns, select Rows to repeat at\ntop to choose a title row that will be printed at the top of\neach page."
    },
    {
      "pageNumber": 154,
      "content": "Basics  of  Spreadsheet  ::  133\nFig. 6.16\n6.16 PRINT PREVIEW\nPrint preview helps to view the worksheet before the final printout\nis taken. It helps to edit the worksheet if required as per the need.\nThe steps to see the print view of document\n1. Select Print from Office Button\n.\n2.Select print\n3.Click Print Preview."
    },
    {
      "pageNumber": 155,
      "content": "134  ::  Data  Entry  Operations\nFig. 6.17\nClick the buttons like Next and Previous with respect to Print\nPreview Tab. Select the Zoom button to view the pages closer.\nMake page layout modifications needed by clicking the Page\nSetup button. Click Close to return to the worksheet or Print to\ncontinue printing.\n6.17 PRINT\nTo print the worksheet, select Print from Office Button\n."
    },
    {
      "pageNumber": 156,
      "content": "Basics  of  Spreadsheet  ::  135\nFig. 6.18\n1.Print Range - Select either all pages or a range of pages to\nprint.\n2.Print What - Select selection of cells highlighted on the\nworksheet, the active worksheet, or all the worksheets in\nthe entire workbook.\n3.Copies - Choose the number of copies that should be\nprinted. Check the Collate box if the pages should remain\nin order.\n4.Click OK to print.\n6.18 FILE OPEN, SAVE AND CLOSE\n(A)You can open an existing File by several methods:\n1.Go to windows explorer and find out the file you want\nto open. Double-click on the file.\n2.Start MS Excel. Click on office button on the drop-\ndown menue click 'open'. select the file you want to\nopen from the pop-up menu.\n(B)When you have finished your work on the file you can save\nit by either clicking on the 'file save' icon at the top left"
    },
    {
      "pageNumber": 157,
      "content": "136  ::  Data  Entry  Operations\ncorner or Click on office button \n→→\n→→\n→ click on save at the drop-\ndown menu.\n(C)When you are saving the worksheet for the first time follow\nthe steps given below:\n1.Click office button\n2.Select 'file save as'on the drop-down menu.\n3.On the pop-up menu select the location where you\nwant to save the file.\n4.Type the file name\n5.Click on 'save'in the pop-up menu.\n(D)When your work is finished and it has been saved properly:\nSelect Print from Office Button\n1.Select (Click) Close Command to close your file\n2.Select (Click) Exit Excel Command to exit from MS\nExcel\nFig. 6.19"
    },
    {
      "pageNumber": 158,
      "content": "Basics  of  Spreadsheet  ::  137\n6.19 WORKBOOK PROTECTION\nSet a password for a workbook\n1.Click the Microsoft Office Button \n, and then click Save\nAs.\n2.Click Tools, and then click General Options.\n3.Do one or both of the following:\nlIf you want reviewers to enter a password before they\ncan view the workbook, type a password in the\nPassword to open box.\nlIf you want reviewers to enter a password before they\ncan save changes to the workbook, type a password\nin the Password to modify box.\n4.If you don’t want content reviewers to accidentally modify\nthe file, select the Read-only recommended check box.\nWhen opening the file, reviewers will be asked whether or\nnot they want to open the file as read-only.\n5.Click OK.\n6.When prompted, retype your passwords to confirm them,\nand then click OK.\n7.Click Save.\n8.If prompted, click Yes to replace the existing workbook.\nINTEXT QUESTIONS\n1.Write True or False for the following statements\n(a)To modify a preset header or footer click the custom\nheader and custom footer buttons.\n(b)Autofill helps you to add the contents of a cluster of\nadjacent cells.\n(c)Charts features help you in presenting a graphical\nrepresentation of data.\n(d) Click the edit button to print the worksheet.\n(e)Pivot table allows you to perform data analysis."
    },
    {
      "pageNumber": 159,
      "content": "138  ::  Data  Entry  Operations\n2.Fill in the blanks\n(a)When the active document is protected the command\nname changes to ________________ workbook.\n(b)Select __________________ from the menu bar to view\nhow the worksheet will look when printed.\n(c)_________ toolbar allows to draw a number of\ngeometrical shapes, arrows, flow chart elements etc.\n(d)Check ______________ if you want the gridlines\ndividing the cells to be printed on the page.\n6.20 WHAT YOU HAVE LEARNT\nIn this lesson you learnt about starting Excel and working on a\nworksheet. You can select a cell or a range of cells. Also you can\nenter data in a worksheet. You can define the size of a page by\ngoing to page set up and insert a page break. You have learnt\nabout page-preview which gives an idea on how the print out will\nlook like.\n6.21 TERMINAL QUESTIONS\n1.What are the main features of MS Excel?\n2. Differentiate between a worksheet and a workbook?\n3.What are the different types of data that can be entered into\nworksheet cells?\n4.Explain three different ways you protect your workbook.\n5.How do you find a single number or name you want in a\nlarge worksheet containing thousands of numbers and\nnames? Is it possible to replace a name or number with\nsome other name or number? How?\n6.How do you select a single cell, a single column, a single\nrow, a cluster of cells, and a entire worksheet?\n7. Difference between Move cells and Copy cells\n8.What are the different features available in Page setting\ncommand?"
    },
    {
      "pageNumber": 160,
      "content": "Basics  of  Spreadsheet  ::  139\n8.Explain the different features available in Print command?\n10.Define the following:\n(a)Navigating worksheet\n(b)Editing data\n(c)Insert cells and rows\n(d)Drag and drop\n(e)Workbook protection\n6.22 FEEDBACK TO INTEXT QUESTIONS\n1.(a) True(b) False(c) True (d) False(e) True\n2.(a) Unprotect(b) Print preview (c) Autoshapes\n(d) gridlines"
    },
    {
      "pageNumber": 161,
      "content": "140  ::  Data  Entry  Operations\n \nFormatting Worksheets\n7.1INTRODUCTION\nExcel makes available numerous formatting options to give your\nworksheet a polished look.  You can change the size, colour and\nangle of fonts, add colour to the borders and backgrounds of\ncells, and have the format of a cell change, based on its value.\nYou  will see that some of the formatting features in MS Excel are\nsame as you have used in MS Word.\n7.2 OBJECTIVES\nAfter going through this lesson you would be able to:\nluse autoformat features\nlformat data and worksheets\nluse format painter\nluse formulas and functions\n7.3USING FORMATTING TOOLBAR\nFormatting helps to make our work more presentable. It also\nhelps the viewer/reader to understand the worksheet more\neasily with respect to its purpose.\n7"
    },
    {
      "pageNumber": 162,
      "content": "Formatting  Worksheets  ::  141\nThere are three locations where the Excel 2007 formatting tools\nare available.\n1.In the home tab\n2.In the mini toolbar that appears when you right click a\nrange or a cell\n3.In the format cells dialog box.\n7.3.1 Home Tab and the Formatting Tools\nHome tab provides the quick access to the most commonly used\noptions with respect to the formatting requirements.  You can\nselect a cell or a range and then use the tool as per the need like\nFont, Alignment or Number groups. To understand the proper\nand best use of such tools, only way is to use them and\nexperience their effect. Some of the controls are further\nexpandable like drop-down lists etc. If you see some small arrow\nalong with a button. The button will expand to display the\navailable choices.\nFig. 7.1\n7.3.2 In the Mini Toolbar\nShortcut menu appears when you right click a cell or a range\nselection. A mini toolbar also appears above the shortcut menu.\nThe Mini toolbar contains controls for common formatting:\nlFont type\nlFont Size"
    },
    {
      "pageNumber": 163,
      "content": "142  ::  Data  Entry  Operations\nlDecrease Font\nlIncrease Font\nlAccounting Number Format\nlComma Style\nlFont Color\nlFormat Painter\nlBold\nlItalic\nlCenter\nlPercent Style\nlBorders\nlMerge And Center\nlIncrease Decimal\nlDecrease Decimal\nlFill Color\nFigure 7.2 below shows the Shortcut Menu. It gets displayed\nwhen you right click a cell.\nFig. 7.2"
    },
    {
      "pageNumber": 164,
      "content": "Formatting  Worksheets  ::  143\n7.3.3 Using the Format Cells dialog box\nAlthough most of the formatting related requirements gets\nfulfilled by the controls available on the Home tab of the Ribbon,\nsome special types of formatting are fulfilled by using Format cells\ndialog box.\nThis dialog box allows to apply more or less any type of formatting\nstyle and number formatting. The formats selected from Format\nCells Dialog box will be effective to the cells which are selected\nat the time.\nTo use Format Cells dialog box, select the cell or a range to apply\nformatting. Now choose any of the following  methods\nlPress the combination of  Ctrl+1, i.e., Control key and\nnumeric 1 key.\nlClick the dialog box launcher in Home → Font, Home\n→ Alignment, or Home → Number. A small downword-\npointing arrow icon will be displayed to the right. In the\nExcel Ribbon, these arrow marks are known as dialog box\nlauncher.\nFig. 7.3\nlChoose Format Cells from the shortcut menu after you\nRight-click the selected cell or range.\nlClick the More command in some of the drop-down\ncontrols  in  the  Ribbon.  For  example,  the  Home  →\nNumber→ General → More Number Formats... drop-down"
    },
    {
      "pageNumber": 165,
      "content": "144  ::  Data  Entry  Operations\nincludes an item named More Number Formats, as shown\nbelow\nFig. 7.4"
    },
    {
      "pageNumber": 166,
      "content": "Formatting  Worksheets  ::  145\nFig. 7.5\nThere are six tabs in Format Cells dialog box: Number,\nAlignment, Font, Border, Patterns, and Protection.\n7.4FORMATTING CELLS USING DIALOG BOX\n7.4.1 Number tab\nThe data type can be selected from the options on this tab. Select\nthe range you would like to format and click on one of the\nCategory number as shown in Figure 7.2 to apply that style to your\nnumbers. Select General if the cell contains text and number and\nit does not have any specific number format.  If you select\nNumber Category you can represent numbers as integers,\ndecimals with number of decimal as option etc.  For example, if\nyou want to restrict the number of decimals to 2, choose Number\nCategory and then decimal places as 2.  You may try the other\noptions in your computer."
    },
    {
      "pageNumber": 167,
      "content": "146  ::  Data  Entry  Operations\n7.4.2 Alignment tab\nThese options allow you to change the position and alignment of\nthe data with the cell. The Format Cells dialog box offers you more\noptions than the alignment buttons on the Formatting toolbar.\nFor example, you can change the orientation of the text.\n7.4.3 Font tab\nAll of the font attributes are displayed in this tab including font\nface, size, style, and effects.  Using Formatting toolbar you can\nbold, italicize, and underline your cell entries.  For even more\nformatting options you can use the Format Cells dialog box.\n7.4.4 Border and Pattern tabs\nYou can use the Formatting toolbar for adding borders, cell\nshading, and font colour.  These buttons are actually tear-off\npalettes.  When you click on the picture portion of the button, the\nformat of the picture displayed will be applied to the contents of\nthe cell(s) you have selected in the worksheet.  You can change\nthe picture displayed on the button by clicking on the button’s\nsmall drop-down arrow to access the palette of samples from\nwhich to choose.\nFollow these steps to apply a border and colour to a selection\nusing the options in the Format Cells dialog box.\n1.Select Format\n→→\n→→\n→Cells to display the Format Cells dialog\nbox.\n2.Select the Border tab.\n3.In the Presets area, choose None, Outline, or Inside to\nspecify the location for the border.\n4.Choose any of the following options for the border:\nlIn the Border area, click on any of the buttons to\ntoggle its border.\nlChoose the border’s line style in the  Style area.\nlIf necessary, select a colour for the border in the\nColor Palette."
    },
    {
      "pageNumber": 168,
      "content": "Formatting  Worksheets  ::  147\n5.Select the Patterns tab, and then choose any of the following\noptions:\nlSelect a colour for the background of the selection in\nthe Color palette.\nlIf necessary, select a pattern for the background of\nthe selection in the Pattern palette.\n6.Choose OK to apply the border and colour.\n7.4.5 Dates and Times\nIf you enter the date “January 1, 2001” into a cell on the\nworksheet, Excel will automatically recognize the text as a date\nand change the format to “1-Jan-01”. To change the date format,\nselect the Number tab from the Format Cells window. Select\n“Date” from the Category box and choose the format for the date\nfrom the Type box. If the field is a time, select “Time” from the\nCategory box and select the type in the right box. Date and time\ncombinations are also listed. Press OK when finished.\nFig. 7.6"
    },
    {
      "pageNumber": 169,
      "content": "148  ::  Data  Entry  Operations\n7.5FORMATTING COLUMNS AND ROWS\nSometimes the contents of the columns do not fit in its width. So,\nto adjust them within the width of the column, we can use AutoFit\nfeature. As you  can observe, in the column C, the column header\nis not fully visible.\nFig. 7.7\nSteps to AutoFit Columns\nlClick on Column Header/or any other cell in the column\nto change its width\nlClick Home tab\nlSelect format from the cells group on the ribbon.\nFig. 7.8\nlClick on AutoFit Column Width"
    },
    {
      "pageNumber": 170,
      "content": "Formatting  Worksheets  ::  149\nFig. 7.9\nlSee the effect, the column C is showing full contents i.e.\nChemistry.\nFig. 7.10\nSimilarly you can apply AutoFit for row also.\nlClick on Row Header/or any other cell in the Row to change\nits Height\nlClick Home tab\nlSelect format from the cells group on the ribbon."
    },
    {
      "pageNumber": 171,
      "content": "150  ::  Data  Entry  Operations\nFig. 7.11\nlClick on AutoFit  Row Height\nFig. 7.12\nlSee the effect, the Row 6 is showing full contents, i.e.,\nAnurag.\nAnother way of automatically adjusting columns and rows is by\nway of best fit.  To do this:\n1.Place your pointer on or near the right edge of a column\nheader of the column you wish to adjust.  Notice that in this\narea your pointer changes to a double-headed arrow."
    },
    {
      "pageNumber": 172,
      "content": "Formatting  Worksheets  ::  151\nFig. 7.13\n2.Double click your pointer, and the column to the left of it\nwill automatically adjust to fit the data entries within it.\nSimilarly, pointing to a row header changes pointer to a double-\nheaded arrow.  Double clicking results in a best fit (taller or\nshorter rows).\nHide Selected Column(s) or Row(s)\nHide - Hides the selected column(s) or row(s), though the data is\nstill there.  Hiding column(s) or row(s) will help you to prevent\nunwanted changes.  To hide a column, follow these steps:\n1.Select the column you want to hide by clicking on the\ncolumn header. Say you want to hide column C, i.e., column\nrepresenting the marks in chemistry.\nFig. 7.14"
    },
    {
      "pageNumber": 173,
      "content": "152  ::  Data  Entry  Operations\nRight Click on the Column to hide and click on the Hide option.\nFig. 7.15\nSee the following figure (Fig. 7.16). Column C is not visible.\nFig. 7.16"
    },
    {
      "pageNumber": 174,
      "content": "Formatting  Worksheets  ::  153\nUnhide Selected Column(s) or Row(s)\nTo unhide the column follow these steps:\n1.Select the visible range of columns that includes the hidden\ncolumn(s).\nFig. 7.17\n2.Now Right Click on the selected Columns. Select Unhide\nfrom the pop-up menu.\nFig. 7.18"
    },
    {
      "pageNumber": 175,
      "content": "154  ::  Data  Entry  Operations\n3.You can observe, the Column C is visible again.\nFig. 7.19\nYou can follow the same procedures to Hide and Unhide rows.\n7.6FORMATTING WORKSHEETS USING CELL\nSTYLES AND APPLYING STYLES\nExcel 2007 provides cell styles to quickly format a cell by choosing\nfrom predefined styles. Styles help to give a professional look to\nyour worksheets. In Excel, all styles are cell styles.  However, a\ndefined style can be applied to an entire worksheet.  Cell styles\ncan include any of the formatting that can be applied to a cell\nusing the options available. We can also define our own cell\nstyles.\nlSelect the cells to apply a style on.\nlChoose Home tab. From Styles group, Click on Cell Styles.\nHere we have chosen Heading1. See the effect."
    },
    {
      "pageNumber": 176,
      "content": "Formatting  Worksheets  ::  155\nFig. 7.20\nFig. 7.21\nA few of the effects are discussed below\n1.Comma - Adds commas to the number and two digits\nbeyond a decimal point.\n2.Comma [0] - Comma style that rounds to a whole number.\n3.Currency - Formats the number as currency with a dollar\nsign, commas, and two digits beyond the decimal point."
    },
    {
      "pageNumber": 177,
      "content": "156  ::  Data  Entry  Operations\n4.Currency [0] - Currency style that rounds to a whole\nnumber.\n5.Normal - Reverts any changes to general number format.\n6.Percent - Changes the number to a percent and adds a\npercent sign.\n7.6.1 Deleting Styles\nlRight click on the style (say if you want to remove Bad Style)\nlChoose delete\nFig. 7.22\nlYou can observe, the Bad style is deleted as shown in the\nfollowing figure.\nFig. 7.23"
    },
    {
      "pageNumber": 178,
      "content": "Formatting  Worksheets  ::  157\n7.7FORMAT PAINTER \nA handy feature on the standard toolbar for formatting text is the\nFormat Painter. If you have formatted a cell with a certain font\nstyle, date format, number format, border, and other formatting\noptions, and want to format another cell or group of cells the same\nway, place the cursor within the cell containing the formatting you\nwant to copy. Click the Format Painter button in the clipboard\ngroup of Home tab(notice that your pointer now has a paintbrush\nbeside it). Highlight the cells you want to apply the same\nformatting.  The formatting will change accordingly.\nAlso, to copy the formatting to many groups of cells, double-click\nthe Format Painter button. The format painter remains active\nuntil you press the ESC key to turn it off.\nFig. 7.24\n7.8AUTOFORMAT\nExcel’s AutoFormat feature uses table styles, which are\npredefined collections of number formats, fonts, cell alignments,\npatterns, shading, column widths, and row heights to have a\npolished look of ranges of cells you specify.  You can use these\nstyles as-is or over rule some of their characteristics.\nExcel has many preset table formatting options. Add these styles\nby following these steps:\n1.Highlight the cells that will be formatted."
    },
    {
      "pageNumber": 179,
      "content": "158  ::  Data  Entry  Operations\nFig. 7.25\n2.Select Home tab\n→→\n→→\n→Style group\n→→\n→→\n→Format as Table from the\nRibbon.  It will show many predefined Table formats.\nFig. 7.26"
    },
    {
      "pageNumber": 180,
      "content": "Formatting  Worksheets  ::  159\nFig. 7.27\n3.Select any one format. Here we have selected fourth table\nformat (with green background) from the Dark category of\nformats. It will show the following dialog box. Check My\nTable has headers check box and click OK.\nFig. 7.28"
    },
    {
      "pageNumber": 181,
      "content": "160  ::  Data  Entry  Operations\nSee the effect of the formatting in the figure given below. Also,\nobserve Table Tools Design tab with Ribbon showing multiple\ngroups. You can change the style by clicking on the predefined\ntable format in the Table Styles group\nFig. 7.29\n7.9HIDING/UNHIDING WORKSHEETS\nHiding a Worksheet\nlRight click on the sheet tab which you want to hide\nlChoose Hide option from the context menu, as shown below\nFig. 7.30\nlTo unhide the hidden sheet, right click on the any of the\nvisible sheets. Unhide Dialog will appear. Choose the sheet\nfrom the list to unhide. In our case only one sheet is\ndisplayed to unhide."
    },
    {
      "pageNumber": 182,
      "content": "Formatting  Worksheets  ::  161\nFig. 7.31\nFollowing Figure shows the sheet1 also.\nFig. 7.32"
    },
    {
      "pageNumber": 183,
      "content": "162  ::  Data  Entry  Operations\n7.10PROTECT AND UNPROTECT WORKSHEETS\nTo protect worksheet\nYou can protect your worksheet against unauthorized editing. For\nthis you can give password protection to your worksheet\ncontents.\nSteps to protect worksheet\nlSelect Home tab.\nlClick Format in cells group.\nFig. 7.33\nlChoose Protect sheet from Drop Down Menu. Protect sheet\ndialog box will appear. Enter password to protect sheet.\nReenter same password in the confirm password dialog\nbox."
    },
    {
      "pageNumber": 184,
      "content": "Formatting  Worksheets  ::  163\nFig.7.34\nlNow if you try to make any change in the worksheet,\nfollowing dialog box will appear.\nFig. 7.35\nTo Unprotect worksheet\nYou can unprotect your worksheet to edit it.\nSteps to unprotect worksheet\nlSelect Home tab.\nlClick Format in cells group."
    },
    {
      "pageNumber": 185,
      "content": "164  ::  Data  Entry  Operations\nlChoose Unprotect sheet from Drop Down Menu. Unprotect\nsheet dialog box will appear. Enter password to unprotect\nsheet. Password must be same as used for protecting the\nworksheet. Press OK.\nFig. 7.36\nINTEXT QUESTIONS\n1.Write True or False for the following statements.\n(a)Format cells dialog box offers you more option than\nthe alignment buttons on the formatting toolbar.\n(b)Click Edit to perview the formatting changes on the\nworksheet.\n(c)If the field is a time select \"time\" from the category\nbox.\n(d)To unhide the column select format column unhide\nfrom the menu bar.\n(e)Choose Edit style to display the style dialog box."
    },
    {
      "pageNumber": 186,
      "content": "Formatting  Worksheets  ::  165\n2.Fill in the blanks\n(a)Modify the attributes by clicking the _______ button.\n(b)In Excel all styles are _______________.\n(c)Hiding columns or rows will help you to ___________\nunwanted changes.\n(d)If the tool bar is not already visible on the screen select\n____________.\n(e)To change the data format select the ___________ from\nthe format cells window.\n7.11WHAT YOU HAVE LEARNT\nIn this lesson you learnt about various tools available in Excel\nto format a worksheet. You can align text and change font size,\nstyle and effects. Also you learnt how to put a border or shade to\nthe text in the cells selected by you. Also you learnt about\napplying style to a worksheet and modify the style.\n7.12TERMINAL QUESTIONS\n1.What is Format Painter?  When do you think Format Painter\nis useful in Excel?\n2.Explain different preset styles available in Excel.\n3.Explain steps to create a new style.\n4.How to copy styles from one open workbook file to another?\n5.What are the different tabs available in Format Cells dialog\nbox?\n6.What are the different features available in:\n(a)Number tab, (b) Border tab and (c) Patterns tab in\nExcel’s Format Cells dialog box?\n7.How do you: (a) Hide a column, (b) Unhide a column, (c)\nHide a worksheet, (d) Unhide a worksheet?\n8.How do you resize your worksheet columns or rows?"
    },
    {
      "pageNumber": 187,
      "content": "166  ::  Data  Entry  Operations\n7.13 FEEDBACK TO INTEXT QUESTIONS\n1.(a)True(b)False(c)True\n(d)True(e)False\n2.(a)modify(b)cell styles\n(c)prevent/protect worksheet from\n(d)view toolbar formatting\n(e)number tab"
    },
    {
      "pageNumber": 188,
      "content": "Formulas,  Functions  and  Charts  ::  167\n \nFormulas, Functions and Charts\n8.1INTRODUCTION\nIn this leson you can enter formula and functions and perform\nmathematical calcualtions. You will also be able to create charts\nand graphics using the data. You can specify methametical\nrelationship between the numbers using the formula. Formulas\nare used for simple addition, subtraction, multiplication and\ndivision as well as for complex calculations. Functions are built\nin formulaes. The users have to provide cell references and\naddresses only. These are called arguments of the function and\nare given between the left and right parenthesis.\n8.2OBJECTIVES\nAfter going through this lesson you would be able to:\nluse formulaes to get the desired result\nlinsert and edit picture from a file\nluse functions\nlcreate varioius charts\nldraw graphics using clip art.\n8"
    },
    {
      "pageNumber": 189,
      "content": "168  ::  Data  Entry  Operations\n8.3FORMULAS AND FUNCTIONS\nTo manipulate data and to extract useful information from Excel\nworksheets, formulas and worksheet functions play very\nimportant role. In Excel, formulas are used to calculate results\nfrom the worksheet data. When there is some change in the data,\nsuch formulas automatically calculate the updated results with\nno extra efforts on the part of the user. There is a new feature\nintroduced by Excel 2007, which enables you to create formulas\nwhich use columns names from a table, when you are working\nwith table. This feature helps the user to make formulas much\neasier to read.\nA formula can have any or all of the following elements\nlMust begin with the 'equal to' = sign.\nlMathematical operators, such as + (for addition) and / (for\ndivision) and logical operators such as <, >\nlReferences of cell (including named ranges and cells)\nlText or Values\nlFunctions related to the worksheets, for example  SUM or\nAVERAGE\nThe current cell in which you have entered a formula will display\nthe result after the formula is completely entered. Also, when you\nselect or click on a cell which is having some formula, the formula\nwill appear in the formula bar.\nIn Excel 2007, the formulas are available in the Formulas Tab. If\nyou click on the Formulas tab, you can see the corresponding\nribbon display with available formulas, as shown below.\nFig. 8.1\nFormula\nBar"
    },
    {
      "pageNumber": 190,
      "content": "Formulas,  Functions  and  Charts  ::  169\nFollowing are a few examples of formulas:\nFig. 8.2\nIn the above example, in the cell F3, just type = B3+C3+D3+E3.\nIt will return sum of the marks in physics, chemistry, maths and\nEnglish.\nFig. 8.3"
    },
    {
      "pageNumber": 191,
      "content": "170  ::  Data  Entry  Operations\nCopying a formula\nIn above exaple just drag the handle and bring down to cover the\nremaining cells in the column total. This will automatically copy\nthe formula and calculate the corresponding sum of the\nrespective rows of the other students.\nFig. 8.4\nSome other examples of formulaes:\nIf A1 = 2, B1 = 3, C1 = 4, D1 = 5 then\n(i)= B1 * C1 will give result as 3 * 4 = 12\n(ii)= A1 * B1 – C1 + D1 will give result as 2 * 3 – 4 + 5 = 7\n(iii)= ((A1 * B1) + C1)/D1 will give result as ((2 * 3) + 4)/5\n= (6 + 4)/5 = 10/5 = 2\nAuto sum feature\nThe sum of cell values can also be done with the help of AutoSum\nfeature also.\nFollowing steps explains how to do that.\nlClick on the cell F3.\nlSelect the Formulas tab\nlClick AutoSum from the function library group."
    },
    {
      "pageNumber": 192,
      "content": "Formulas,  Functions  and  Charts  ::  171\nlSelect Sum\nlPress Enter\nAlternatively, you can write = SUM(B3:E3) in the Cell F3 to get\nthe sum of the Physics, Chemistry, Maths and English marks.\nPictorial illustration is shown below:\nFig. 8.5\nApart from sum there are other functions also, like average, Count\nNumbers, Max, Min and many other Functions."
    },
    {
      "pageNumber": 193,
      "content": "172  ::  Data  Entry  Operations\nFig. 8.6\nSum ( ) : Adds all the numbers in a range of cells.\nSyntax SUM(number1,number2, ...)\nMaximum number of arguments can be 255 i.e. number1,\nnumber2 ... number255.\nSum function is having different forms. You can choose as per\nyour need.\nFig. 8.7\nSUMIF(range, criteria, sum_range) : This form of sum functions\nis used to add the cells with respective to a given criteria.\nRange : A group of adjacent cells"
    },
    {
      "pageNumber": 194,
      "content": "Formulas,  Functions  and  Charts  ::  173\nCells within a range must be numbers or names, arrays, or\nreferences which are having numbers. In sumif function the\nblank and text values are ignored.\nCriteria: It can be a number, expression, or text to define which\ncells will be considered for the addition e.g. criteria can be fixed\nas 12, “12”, “>12”, or “mangoes”.\nSum_range: These are the actual cells to be added if their\ncorresponding cells in range match criteria. In case the\nsum_range is avoided, then the cells in range are both evaluated\nby criteria and added if they match criteria.\nExample\nIn above examples, the function SUMIF adds only those values\nin the cells (B3, E3) which are greater than 99. i.e., it will add the\nvalues from cells D3 and E3 only and hence the result is 100 +\n100 = 2000\nFig. 8.8\nE3"
    },
    {
      "pageNumber": 195,
      "content": "174  ::  Data  Entry  Operations\nAverage function ( ) : It helps you to get the average of the\nnumbers. It returns the average (arithmetic mean) of the\narguments.\nSyntax :  AVERAGE(number, number2,...)\nMaximum number of arguments can be 255 i.e. number1,\nnumber2 ... number255.\nFig. 8.9\nMin function ( ) : It helps you to get the minimum of the\nnumbers.Returns the smallest number in a set of values. Syntax\nMIN(number1,number2,...)\nMaximum number of arguments can be 255 i.e. number1,\nnumber2 ... number255\nFig. 8.10"
    },
    {
      "pageNumber": 196,
      "content": "Formulas,  Functions  and  Charts  ::  175\nMax function ( ) : It helps you to get the  maximum of the\nnumbers. Returns the largest number in a set of values. Syntax\nMAX(number1,number2,...)\nMaximum number of arguments can be 255 i.e. number1,\nnumber2 ... number255.\nFig. 8.11\nNow drag the handle of cells G3,H3,I3,J3 to cover each row of the\nrespective column. You can see the corresponding functions are\nautomatically copied in the respective columns and automatically\nvalues are calculated. See the figure below.\nFig. 8.12\n331\n082.75\n77\n88"
    },
    {
      "pageNumber": 197,
      "content": "176  ::  Data  Entry  Operations\nTo use more functions\nlSelect Formula Tab\nlChoose AutoSum from function library group, from formula\nribbon\nlClick on More Functions... as shown below.\nFig. 8.13\nWhen you click on more functions, a dialog box will appear as\nshown below. You can choose a function as per your need by the\nhelp of following dialog box.\nFig. 8.14"
    },
    {
      "pageNumber": 198,
      "content": "Formulas,  Functions  and  Charts  ::  177\n8.4 CHARTS\nCharts allow you to present data entered into the worksheet in a\nvisual format using a variety of graph types. Before you can make\na chart, you must first enter data into a worksheet. This section\nexplains how you can create simple charts from the data.\nFormatted charts come in various types for diverse goals, ranging\nfrom columns to pies, from lines to surfaces, etc.\n8.4.1 Types of Chart\nMicrosoft Office Excel 2007 provides various types of charts to\nhelp you to display data in different ways as per the need of the\nviewers. You can create a new chart or can change the existing\nchart, from the wide range of chart subtypes available for each\ntype of available chart types as given below\nColumn Charts\nThis type of chart is used to compare values across categories.\nThey give very effective results to analyze the data of the same\ncategory on a defined scale.\nLine Charts\nData represented in columns or rows in a worksheet can be\nplotted with the help of line chart. Line charts can be used to\ndisplay continuous data over time with respect to a common\nscale. Thus Line Charts are best suitable for viewing data trends\nat equal intervals of time. The horizontal axis is used to represent\nthe category data and all the value data is distributed uniformly\nalong the vertical axis.\nPie charts\nIn a situation where one has to show the relative proportions or\ncontributions to a whole, a pie chart is very useful. In case of pie\nchart only one data series is used. Small number of data points"
    },
    {
      "pageNumber": 199,
      "content": "178  ::  Data  Entry  Operations\nadds more to the effectiveness of pie charts. Generally there\nshould be maximum five or six data points or slices in a pie chart.\nIf the points are more in number then it becomes very difficult\nto interpret the chart.\nAlso, it is very important to note that the values of to be used in\nthe pie chart must be all positive. If there are some negative\nvalues, in that case the negative values will be automatically\nconverted in to positive values, this will be desired.\nBar Charts\nBar charts are used to show comparisons between individual\nitems. To make a bar chart the data should be arranged in the\nform of rows and columns on a worksheet.\nArea Charts\nThe data which is arranged in the form of rows or columns on a\nworksheet can be plotted in an area chart. Area charts are used\nto highlight the degree of a change over time. Area charts are also\nused to draw attention to the total value across a trend.\nXY (Scatter) charts\nXY charts are also known by other names like scatter grams or\nscatter plots. The point of difference between XY charts and other\ntypes of charts is that in XY charts both axes display values i.e.\nthey have no category axis. Such type of charts is generally used\nto show the relationship among two variables.\nStock charts\nStock chart can be used to plot data arranged in columns or rows\nin a particular order on a worksheet. As the name is self\nexplanatory, this chart is used to demonstrate the fluctuations\nwith respect to stock market prices. Even scientific data can be"
    },
    {
      "pageNumber": 200,
      "content": "Formulas,  Functions  and  Charts  ::  179\nplotted by stock chart, e.g., the fluctuation of daily or periodic\ntemperature. The data must be arranged in a correct order to\ngenerate stock charts. Say, for example to make a simple high-\nlow-close stock chart one should organize his/her data with High,\nLow and Closed entered as the headings of the columns in the\nrespective order.\nSurface charts\nSuch type of chart is used in situations where both categories and\ndata series are numeric values. This type of chart is useful in\nsituations where the optimum combinations are found among the\ntwo sets of data. Data should be arranged in columns or rows in\na worksheet can be plotted in s surface chart. The colors and\npatterns indicate the areas which are in the same range of set of\nvalues, as it happens in case of a topographic map.\nDoughnut charts\nThe conditions to draw doughnut charts is that the data has to\nbe in the form of rows or columns. As in the case of a pie chart,\nthe doughnut chart illustrate the relationship of parts to a whole,\nbut it is able to get more than one data series.\nBubble charts\nA bubble chart can be used to plot the data values which are\narranged in the columns of a worksheet so that x values are listed\nin the first column and matching y values and bubble size values\nare listed in adjacent columns.\nRadar charts\nThe radar charts compare the aggregate values of a number of\ndata series. Radar chart can be plotted with the data which is\narranged in columns or rows on a worksheet."
    },
    {
      "pageNumber": 201,
      "content": "180  ::  Data  Entry  Operations\n8.4.2 Components of a Chart\nFig. 8.15\nChart Title - A title given to the whole chart.\nX-Axis Title - A title given to the X-axis data range.\nY-Axis Title - A title given to the Y-axis data range.\nX-Axis Category - These are the categories of the data which have\nbeen plotted. These are taken from the first column or first row\nof your data range.\nY-Axis Value - This is the data range marked to plot the data\nseries.\n \nVertical Major Grid \nY Axis Title \nY Axis \nValue \nHorizontal Major Grid \nData \nX Axis \nCategor\ny \nChart Title \n \nTick \nMark \nLegend \nX Axis \nTitle "
    },
    {
      "pageNumber": 202,
      "content": "Formulas,  Functions  and  Charts  ::  181\nData Labels - The values of the data series plotted.\nLegends - Specifies the colour, symbol or pattern used to mark\ndata series.\nTick Mark - These marks are used to show the scaling of X-axis\nand Y-axis.\nGrid Lines - Displays lines at the major intervals on the category\n(x) axis and/or Y-axis\nHow to Draw a Chart in Excel 2007\nIn Microsoft Excel 2007 chart wizard is removed and also not\nbrought back in Excel 2010 also. Instead the ribbon is provided\nas a new place to get your chart related needs full filled. The\nbuttons on the Insert tab of the ribbon are just the starting point\nto make a chart. After we get the ribbon it becomes very simple\nto start making a chart. Whenever we click on some component\nof chart, we observe that the Chart Tools are displayed to the\nribbon. Three additional tabs which provide a variety of chart\ndesign, layout and formatting options, will also be added.\nFirst, the Layout tab, is used to add all sorts of elements related\nto chart or change the way they are shown in the chart. Second,\nthe format tab is used to apply special effects which were not\navailable in the earlier versions of the Excel, such as the bevel\neffect etc. It may be little difficult to be acquainted with this new\ntype of chart interface, but once you start working, you’ll be proud\nto show off your professional looking results.\nIt is worth mentioning that you can right click on an element of\nthe chart for quick access to specific features with respect to that\nparticular element e.g. if you right click on any chart axis, you will\nget Format Axis dialog box.\nFollowing steps are given to draw a Chart\n1.Enter data in the work sheet: Suppose you entered data as\ngiven in Fig. 8.16."
    },
    {
      "pageNumber": 203,
      "content": "182  ::  Data  Entry  Operations\nFig. 8.16\n2.Now select data range: By using the mouse high light the\nrange of data you want to take (see Fig. 8.17).\nFig. 8.17\n3.Click Insert Tab and select a chart type from the chart\ngroup"
    },
    {
      "pageNumber": 204,
      "content": "Formulas,  Functions  and  Charts  ::  183\nFig. 8.18\n4.Select the sub type of chart\nFig. 8.19\nFig. 8.20"
    },
    {
      "pageNumber": 205,
      "content": "184  ::  Data  Entry  Operations\n5.Select the Title of the chart\na.To give a title to a chart, click on the chart. Now you\ncan see layout tab available. Click on Layout tab.\nb.Choose(click) on chart title option available in the\nLabel group\nFig. 8.21\nFig. 8.22"
    },
    {
      "pageNumber": 206,
      "content": "Formulas,  Functions  and  Charts  ::  185\nc.Click on the chart title and write a title.\nFig. 8.23\n6.Give a name to X-Axis\nClick on Layout tab. Then select Axis Titles from Labels\nGroup. Select Primary Horizontal Axis Title, as shown\nbelow.\nFig. 8.24"
    },
    {
      "pageNumber": 207,
      "content": "186  ::  Data  Entry  Operations\nFig. 8.25\nNow, click on the Axis Title and write an X-axis title.\nFig. 8.26\nFollow the same steps to give a title to Y-axis."
    },
    {
      "pageNumber": 208,
      "content": "Formulas,  Functions  and  Charts  ::  187\nFig. 8.27\nFig. 8.28"
    },
    {
      "pageNumber": 209,
      "content": "188  ::  Data  Entry  Operations\nEditing of a Chart\n1.How to change the legend position\nClick on Layout tab. Then click on Legend option available\nin Labels Group.\nNow choose a position to show legend.\nFig. 8.29\nFig. 8.30\n2.How to change the position of the Data Labels\nClick on Layout tab. Then click on Data Label option\navailable in Labels Group.\nNow choose a format to display data labels"
    },
    {
      "pageNumber": 210,
      "content": "Formulas,  Functions  and  Charts  ::  189\nFig. 8.31\nFig. 8.32\n3.How to show Data Tables Along with Chart, with or\nwithout Legend Keys\nClick on Layout tab. Then click on Data Table option\navailable in Labels Group.\nNow choose a style to display data table"
    },
    {
      "pageNumber": 211,
      "content": "190  ::  Data  Entry  Operations\nFig. 8.33\nFig. 8.34\nAbove diagram show the data table with legend option.\n4.How to Hide/Unhide Grid Lines (Horizontal and Vertical)\nClick on Layout tab. In the Axis Group, click on Gridlines\noption then choose Primary Horizontal Grid Lines. Now\nselect appropriate style from the available options (None,\nMajor Gridlines, Minor Gridline, Major and Minor Gridlines)"
    },
    {
      "pageNumber": 212,
      "content": "Formulas,  Functions  and  Charts  ::  191\nFig. 8.35\nFig. 8.36\nFollow the same steps for Vertical Grid Lines also, as shown\nbelow.\na)Click on Layout tab. In the Axis Group, click on Gridlines\noption then choose Primary Vertical Grid Lines.\n \nNo Horizontal Major \nGrid Lines "
    },
    {
      "pageNumber": 213,
      "content": "192  ::  Data  Entry  Operations\nb)Now select appropriate style from the available options\n(None, Major Gridlines, Minor Gridline, Major and Minor\nGridlines)\nFig. 8.37\nFig. 8.38\n8.4.3 Resizing the Chart\nTo resize the chart, click on its border and drag any of the eight\nblack handles to change the size. Handles on the corners will\n \nVertical Grid lines for \nMajor Units are added "
    },
    {
      "pageNumber": 214,
      "content": "Formulas,  Functions  and  Charts  ::  193\nresize the chart proportionally while handles along the lines will\nstretch the chart.\n8.4.4 Moving the Chart\nSelect the border of the chart, hold down the left mouse button,\nand drag the chart to a new location. Elements within the chart\nsuch as the title and labels may also be moved within the chart.\nClick on the element to activate it, and use the mouse to drag\nthe element to move it. Microsoft Excel automatically sizes titles\nwith respect to the size of the text. One can move titles with the\nmouse but, cannot resize them.\n8.4.5 Copying the Chart to Microsoft Word\nA finished chart can be copied into a Microsoft Word document\nor power point slide. Select the chart and click Copy. Open the\ndestination document in Word or a slide in power point and click\nPaste.\n8.5GRAPHICS – AUTOSHAPES AND SMART ART\nThe AutoShapes feature of Excel 2007 allows you to draw a\nnumber of geometrical shapes, arrows, flow chart elements, stars,\nand more on the worksheet.\nThe steps to activate and use AutoShapes are\n1.Click on Insert Tab.\n2.From Illustrations Group, Click on Shapes\nFig. 8.39"
    },
    {
      "pageNumber": 215,
      "content": "194  ::  Data  Entry  Operations\nNow Select the which you want to insert.\nFig. 8.40\nFig. 8.41"
    },
    {
      "pageNumber": 216,
      "content": "Formulas,  Functions  and  Charts  ::  195\nDifferent categories of AutoShapes available in Excel 2007. We\nwill briefly discuss some of the here.\n1.Lines - After clicking the Lines button on the AutoShapes\ntoolbar, draw a straight line, arrow, or double-ended\narrow from the first row of options by clicking the respective\nbutton. Click in the worksheet where you would like the line\nto begin and click again where it should end. To draw a\ncurved line or freeform shape, select curved lines from\nthe menu, click in the worksheet where the line should\nappear, and click the mouse every time a curve should\nbegin. End creating the graphic by clicking on the starting\nend or pressing the ESC key. To scribble, click the last\nbutton in the second row, click the mouse in the worksheet\nand hold down the left button while you draw the design.\nLet go of the mouse button to stop drawing.\n2.Connectors - These lines can be used to connect flow chart\nelements.\n3.Basic Shapes - Click the Basic Shapes button on the\nAutoShapes toolbar to select from many two- and three-\ndimensional shapes, icons, braces, and brackets. Use\nthe drag-and-drop method to draw the shape in the\nworksheet. When the shape has been made, it can be\nresized using the open box handles and other adjustments\nspecific to each shape can be modified using the yellow\ndiamond handles.\n4. Block Arrows - Select Block Arrows to choose from many\ntypes of two- and three-dimensional arrows. Drag-and-\ndrop the arrow in the worksheet and use the open box and\nyellow diamond handles to adjust the arrowheads.\n5.Flow Chart - Choose from the flow chart menu to add flow\nchart elements to the worksheet and use the lines menu\nto draw connections between the elements. We have drawn\na flowchart using lines, flow chart elements and connectors.\n6. Stars and Banners - Click the button to select stars,\nbursts, banners, and scrolls."
    },
    {
      "pageNumber": 217,
      "content": "196  ::  Data  Entry  Operations\n7.Call Outs - Select from the speech and thought bubbles,\nand line call outs. Enter the call out text in the text box\nthat is made.\nSmart Art Graphics\nVisual representation of information and ideas is called SmartArt\nGraphics. They can be used to quickly, easily and effectively\ncommunicate a message. The facility to create a SmartArt Graphic\nis available in MS Excel 2007. You can copy and paste SmartArt\ngraphics as images into other programs such as Word and\nPowerpoint.\nTo create a SmartArt graphic, one has to choose a type for\nexample, Process, Cycle, Hierarchy or Relationship. A type\nrepresents a category of SmartArt graphic. Each type is having\nseveral different types of layouts.\nSteps to Create a SmartArt\n1.Click on Insert Tab.\n2.From Illustrations Group, Click on SmartArt\nFig. 8.42"
    },
    {
      "pageNumber": 218,
      "content": "Formulas,  Functions  and  Charts  ::  197\nFig. 8.43\n3.Now choose a category (Say Hierarchy) and click OK.\nFig. 8.44\n4.Now you can enter the values as shown below. To enter\nvalues just click on the component where you want to enter\ntext and write the text."
    },
    {
      "pageNumber": 219,
      "content": "198  ::  Data  Entry  Operations\nFig. 8.45\nYou can apply different effects on the SmartArt, by the help of\nDesign tab. Click on SmartArt. The Design tab will be visible with\nits ribbon. Select appropriate group from the ribbon and apply\nthe desired effects."
    },
    {
      "pageNumber": 220,
      "content": "Formulas,  Functions  and  Charts  ::  199\nFig. 8.46\n8.5.1 Adding Clip Art\nClip is  a single media file, including sound, animation, art or\nmovie.\nSteps to insert a Clip Art\n1.Click on Insert Tab.\n2.From Illustrations Group, Click on Clip Art\n3.Then Select a Collection and press Go Button\n4.Click on a clip from the collection"
    },
    {
      "pageNumber": 221,
      "content": "200  ::  Data  Entry  Operations\nFig. 8.47\nFig. 8.48\nFig. 8.49"
    },
    {
      "pageNumber": 222,
      "content": "Formulas,  Functions  and  Charts  ::  201\n5.Clip will be inserted in the worksheet.\nFig. 8.50\n6.To edit the clip, Just click on the clip. This will display\nFormat tab. Choose the relevant group from the ribbon of\nFormat tab and do the necessary changes.\nFig. 8.51\n8.5.2 Inserting and Editing a Picture from a File\nFollow these steps to add a picture, photo or graphic from an\nexisting file:"
    },
    {
      "pageNumber": 223,
      "content": "202  ::  Data  Entry  Operations\n1.Click on Insert Tab.\n2.From Illustrations Group, Click picture.\nFig. 8.52\n3.Now select a picture from the location of the picture (where\nyou have stored the picture) and press enter or click on\ninsert button.\nFig. 8.53\n4.The picture is added on the excel sheet. Click on the\npicture to activate Format tab as shown below along with"
    },
    {
      "pageNumber": 224,
      "content": "Formulas,  Functions  and  Charts  ::  203\nits ribbon showing groups like Adjust, Picture Styles,\nArrange and Size. Use any of the groups to make necessary\nchanges in the picture appearance.\nFig. 8.54\nINTEXT QUESTIONS\n1.Write True or False for the following statements\n(a)Format picture displays all the images properties in\na separate window.\n(b)Activate the image you wish to edit by clicking on it\nonce with the mouse.\n(c)Line charts show the proportion of each component\nvalue to the total value in a data series.\n(d)Pie charts are useful to compare the trends over time.\n2.Fill in the blanks\n(a)Each autoshape can be rotated by first clicking\n__________ button on the drawing tool bar.\n(b)More __________ effects can be changed using the\npicture toolbar."
    },
    {
      "pageNumber": 225,
      "content": "204  ::  Data  Entry  Operations\n(c)___________ displays all the image properties in a\nseparate window.\n(d)_______________ show the relative contributions that\neach data series takes up.\n(e)You have to enter the name of the chart and titles for\n_____________.\n8.6WHAT YOU HAVE LEARNT\nIn this lesson you learnt about the creation of charts and graphics.\nOn the basis of data entered in a worksheet you can create a bar\nchart, line chart or pie chart, you can add title, legend, data labels\nand grid lines to the chart. Moreover, you learnt about\nautoshapes and clip art also.\n8.7TERMINAL QUESTIONS\n1.What is the importance of charts and graphics in providing\ninformation?\n2.Briefly explain any five different components of a chart?\n3.Explain the process of creating a chart using Chart Wizard\ndialog box.\n4.Briefly explain the following:\na.Bar charts,\nb.Pie charts,\n5.List any four features of Chart Formatting toolbar.\n6.How do you copy a chart to Word created in Excel 2007?\n7.List any five categories of AutoShapes in Excel.\n8.You are asked to prepare a flow chart. What kind of\nAutoShapes you would like to use?\n9.Explain the steps in adding a Clip Art to your worksheet?\n10.How do you add a photo or graphic to your worksheet from\nexisting file?"
    },
    {
      "pageNumber": 226,
      "content": "Formulas,  Functions  and  Charts  ::  205\n11.What is the main differences between (a) a column chart\nand (b) a bar chart.\n12.Write a note on SmartArt.\n8.8 FEEDBACK TO INTEXT QUESTIONS\n1.(a)True\n(b)True\n(c)False\n(d)False\n2.(a)free rotate\n(b)picture\n(c)format picture\n(d)Area charts\n(e)X,Y axes"
    },
    {
      "pageNumber": 227,
      "content": "206  ::  Data  Entry  Operations\n \nCreating Presentation\n9.1INTRODUCTION\nWhenever you appear in front of one or more people to present\nyour ideas, deliver speech, give classroom lecture, organize\ncomputer conference, etc., you have a presentation. The basic\npurpose of any presentation is communication. To communicate\neffectively, you must state your facts in a simple, concise and\ninteresting manner.  Any presentation consists of four basic\nelements: you, your audience, your message and your tools.\nIn this lesson you will learn to create a presentation using\nMicrosoft PowerPoint 2007 which is a complete presentation\nsoftware. Even if you are not a multimedia expert, PowerPoint\nhelps you create slides and present exciting slide shows.\nPowerPoint provides you helpful suggestions on the layout,\ndesign, and formats of your slides.\n9.2OBJECTIVES\nAfter going through this lesson you would be able to:\nldefine the basic features of PowerPoint\n9"
    },
    {
      "pageNumber": 228,
      "content": "Creating  Presentation  ::  207\nlcreate presentations\nlgenerate slides and add text to slides\nlinsert charts and graphics\nladd sound and animation effects\nlsave and print presentations\nlrun a slide show\n9.3STARTING A POWERPOINT PROGRAM\nIt enhances your presentations with pictures, sound effects,\ntables and charts.  The main features of PowerPoint are:\n–PowerPoint gives you several ways to create a presentation.\n–Creating slides is the root of all your work with PowerPoint.\nYou can get your ideas across with a series of slides.\n–Adding text will help you put your ideas into words.\n–The multimedia features makes your slides sparkle.  You\ncan add clip art, sound effects, music, video clips etc.\n–Preparing a presentation is easy in PowerPoint.  Once if you\nhave created slides, you can put them in order, time your\nslide show, and present them to your audience.\nYou can start your PowerPoint program in different ways.  One\nway is using Start button:\n1.Click on the Start button.\n2.In the menu that appears select All Programs\n→→\n→→\n→Microsoft\nOffice\n→→\n→→\n→Microsoft Office PowerPoint 2007 (Fig. 9.1).  In\nfew seconds you will see PowerPoint screen on the monitor\n(Fig. 9.2)."
    },
    {
      "pageNumber": 229,
      "content": "208  ::  Data  Entry  Operations\nFig. 9.1\n9.4CREATING PRESENTATIONS\nWhen you start your PowerPoint Program, you see a Blank\npresentation.\nFig. 9.2\nOffice Btton"
    },
    {
      "pageNumber": 230,
      "content": "Creating  Presentation  ::  209\nNote: In PowrePoint 2007 Office button replaces the File menu\nof other programs and the bar below the title bar is known as the\nRibbon ( Menu and Tool bars of some other programs).\nRibbon   consist of a number of Tabs (Home, Insert, ....) . Tabs\nare designed to be task oriented\nGroups within each Tab break a task into subtasks\nCommand button in each group carry out a command or display\na menu of commands.\nYou can also go to Office button  on the top left corner of the page\nand click on New. You can choose a blank presentation from the\npage displayed.\nFig. 9.3\n9.4.1 Installed templates\nSelect the Installed templates tab and then select the desired\ntemplate.  The Installed template provides templates and ideas"
    },
    {
      "pageNumber": 231,
      "content": "210  ::  Data  Entry  Operations\nfor a variety of presentation types.  Select the template you want\nand move through the wizard by clicking ↓ button or the scroll-\nbar after making necessary choices.  Choose the type of\npresentation you would like and click on Create when finished.\nYour presentation is ready for show.\nFig. 9.4\n9.4.2 Design Template\nClick on the Installed Themes box to select the Design Template\nyou want to use. A number of template names will appear in the\nwhite  box.    These  Installed  Themes  give  you  different\nbackgrounds and text formatting to begin your presentation.\nPreview each design by highlighting the template name on the list.\nPress Create after you have chosen the design."
    },
    {
      "pageNumber": 232,
      "content": "Creating  Presentation  ::  211\nFig. 9.5\n9.4.3 Blank Presentations\nSelect the Blank Presentation to open a Blank Presentation.  You\ncan choose this option to start a new presentation from scratch\nif you have a new approach or if none of the templates suit your\nneeds."
    },
    {
      "pageNumber": 233,
      "content": "212  ::  Data  Entry  Operations\nFig. 9.6\nSlide Layouts\nOnce you have chosen a blank form for your new presentation,\nthe first slide of your presentation appears. You can right click\non the site to choose the layout you want.  There are nine different\nslide layouts from which to choose. You simply make your\nselection and click on it.  Each choice described below, dictates\nhow your completed slides will appear.\n1.Title  Slide:  This  option  is  useful  for  beginning  a\npresentation; use this slide if you want to include subtitles\nor smaller text underneath a title."
    },
    {
      "pageNumber": 234,
      "content": "Creating  Presentation  ::  213\nFig. 9.7\n2.Title and Content: Anytime you need to make to list of\nthings that fall underneath a general subject, choose this\nlayout.\n3.Section Header: This option is useful for making a major\nsection within the presentation\n4.Two Content: This is a useful option for putting different\nelements or text boxes.\n5.Comparison: This is a useful option for doing pro/con lists.\n6.Title Only: This option is great for the beginning of a\npresentation.  No subtitles are included in this layout\n7.Blank: Use this layout if you want a blank slide formatted\naccording to the master Slide."
    },
    {
      "pageNumber": 235,
      "content": "214  ::  Data  Entry  Operations\n8.Content with caption:\n9.Picture with caption: Use this option to place title over\none linked object.\n9.4.4 Selecting the content\nThere are six types of elements shown inside the text box you\ncan select from the contents within the slide\n1.Insert table\n2.Insert chart\n3.Insert SmartArt Graphic\n4.Insert picture from file\n5.Insert Clip Art\n6.Insert Media Clip\nFig. 9.8"
    },
    {
      "pageNumber": 236,
      "content": "Creating  Presentation  ::  215\n9.4.5 Open an Existing Presentation\nSelect the Open tab from the Office button to open an existing\npresentation. Select the folder the file is located in from the Look\nin: drop-down menu and highlight the file on the list.  Click Open\nto open the presentation.\nFig. 9.9\n9.5VIEWING SLIDES\nPowerPoint consists of multiple views to help you in the creation\nand presentation of your slides.  These views are Normal, Slide\nSorter, and Slide Show.  The first two views are for creating your\npresentation and the last one is for presentation of slide show.\nYou can access these views by clicking the respective view\nbuttons at the bottom right of the PowerPoint window.  Or select\nthe View and then the respective command on the menu bar.  For\nexample, if you want to choose Normal view, select View\n→→\n→→\n→\nNormal command on the menu bar."
    },
    {
      "pageNumber": 237,
      "content": "216  ::  Data  Entry  Operations\n9.5.1 Normal View\nThe Normal View divides the screen into three sections: the main\nwindow, where the current slide is displayed; the outline pane\non the left; and the notes pane at the bottom.  This is where you\nwill do most of your work.  You can resize each pane by clicking\nits border and dragging it to the size that you want it to be.  To\naccess Normal view, click on Normal view button at the bottom\nleft of the window or select View\n→ → \n→ → \n→ Normal command on the\nmenu bar.\nFig. 9.10\n9.5.2 Slide Sorter View\nA small image of each slide is displayed on Slide Sorter View.\nSlides can easily be ordered and sorted using this view.  You can\nalso use this view to add special effect, such as the transactions\nthat occur when each new slide appears.  To access Slide Sorter\nview, click on Slide Sorter view button at the bottom left of the\nwindow or select View\n→ → \n→ → \n→ Slide Sorter command on the menu bar.\nPrevious slide\nNext slide\nNormal  Slide sorter  Slide show"
    },
    {
      "pageNumber": 238,
      "content": "Creating  Presentation  ::  217\nFig. 9.11\n9.5.3 Slide Show View\nThe Slide Show View is the view to use when you preview your\npresentation to make sure every thing is in place, or when you\ndeliver a presentation to an audience.  Because all sounds,\nanimations, hyperlinks, and action settings of your presentation\nwill be working, you can see exactly how your show will turn out.\nTo access Slide Show view, click on Slide Show button at the\nbottom left of the window or select View\n→→\n→→\n→Slide Show command\non the menu bar.\n9.6 DESIGN TIPS\nAlthough, PowerPoint provides you with some very powerful tools\nto give excellent presentations, making the wrong design choices"
    },
    {
      "pageNumber": 239,
      "content": "218  ::  Data  Entry  Operations\ncan defeat all your efforts.  Making the right decisions is not\ndifficult.  By following the guidelines below, you can prepare best\nslides.\n1.Use contrasting colors for the text and the background so\nthe text will be easy to read.\n2.Use font size large enough to be seen from the back of the\nroom where the presentation will be held. A font size of 24-\npoint or larger is recommended.\n3.Use short phrases and sentences to convey your message.\n4.Use simple slide transitions. Too many different transitions\nwill distract your audience from the subject of the\npresentation.\n5.Avoid cluttering the slides with too much text or graphics.\nYour audience should hear what you have to say and not\nbe distracted by a busy screen.\n6.Keep text simple and easy to read by not using many\ndifferent text effects such as bold, italics, \nunderlining, larger\nfont size for emphasis within a sentence, or a different font\nall on the same slide.\n9.7WORKING WITH SLIDES\nSlides are the building blocks of your presentation.  You can also\ncreate or use layouts and designs, add notes and create\nhandouts, and customize the look of your slides.  You can create\nnew slides by inserting them into your show.  When you create a\nnew slide, you can use any of the nine layouts available (Section\n9.3.3) in the New Slide dialog box or choose a blank slide.  Once\nyou have created a new slide, you can insert various elements\nsuch as text, pictures, graphs, tables etc.\n9.7.1 Applying a Design Template\nTo add a design template or change the existing one, select Design\ntag on the Ribbon. Select the template by clicking on it.\n9.7.2 Changing Slide Layouts\nTo change the layout template of the slide select Home\n→ → \n→ → \n→ Layout\ncommand on the menu bar.  The Slide Layout dialog box appears\nwith nine layouts.  Click on one of the layout thumbnail images\nto apply."
    },
    {
      "pageNumber": 240,
      "content": "Creating  Presentation  ::  219\nFig. 9.12\nFig. 9.13"
    },
    {
      "pageNumber": 241,
      "content": "220  ::  Data  Entry  Operations\n9.7.3 Inserting and Editing the Existing Slides as Your\nNew Slides\nYou can insert slides and then edit them from other files; Cut,\nCopy and Paste slides; and duplicate slides.\nClick on Home → New Slide and select on Duplicate Selected\nSlides, Slides From Outline... or Reuse Slides...\nFig. 9.14\nSlides from Outline... provides a way to create slides from text\nfile outlines.  You can use this feature to create a group of slides\nthat contain a lot of text.  You can also create new slides by typing\ntext in the outline pane. To access the Insert Outline dialog box,\nselect Home → New Slide → Slides from Outline command on\nthe menu bar."
    },
    {
      "pageNumber": 242,
      "content": "Creating  Presentation  ::  221\nDuplicate Selected Slides gives you a duplicate of a slide when\nyou need to create similar slides.  To insert a copy of the current\nslide after the current slide, choose the slide you want to\nduplicate, and then Right click for the Duplicate Slide command\non the menu bar or press CTRL+SHIFT+D keys.\nFig. 9.15\nYou can also cut/copy and paste slides by selecting the whole\nslide.\n9.7.4 Reordering Slides\nTo reorder a slide in Slide Sorter View, simply click on the slide\nyou wish to move and drag it to the new location. In Normal or\nOutline View, click on the slide in the slide pane and move and\ndrag the slide to a new location."
    },
    {
      "pageNumber": 243,
      "content": "222  ::  Data  Entry  Operations\n9.7.5 Hide Slides\nIf you do not want a slide to appear during the slide show, but\ndo not want to delete the slide as it may be used later, the slide\ncan be hidden by right clicking on the slide in the slide pane and\nselecting Hide. You can unhide a hidden slide in a similar\nmanner.\nFig. 9.16\n9.7.6 Moving Between Slides\nYou can move from one slide to another slide by using the\nfollowing tools:\nScroll Bars: Use the Scroll Bars to move from one slide to another\nslide or through the text that is displayed in the notes pane and\nthe outline pane."
    },
    {
      "pageNumber": 244,
      "content": "Creating  Presentation  ::  223\nNext Slide and Previous Slide Buttons: The Next Slide and\nPrevious Slide buttons move you to the next slide or previous\nslide in a slide show.  These buttons, indicated by a double-arrow,\nare located at the bottom of the vertical scroll bar.\nFig. 9.17\nUsing Outline Pane: Change to Outline view and then click on\nthe slide that you want to view.  You can move around in the\noutline pane by using your mouse, or by using up and down\narrow keys.\nINTEXT QUESTIONS\n1.State True or False.\n(a)In both Normal view and Outline view you can see:\ncurrent slide, slide outline, and notes.\nPrevious slide\nNext slide"
    },
    {
      "pageNumber": 245,
      "content": "224  ::  Data  Entry  Operations\n(b)Using  the  contrasting  colors  for  the  text  and\nbackground to slides is not a good practice.\n(c)    While preparing slides use long phrases sentences\nto convey your message.\n2.How many slide layouts are available in New Slide dialog\nbox?\n(a) 7(b) 9 (c) 14, (d) 17\n3.The PowerPoint dialog box is useful to create a new\npresentation using:\n(a)Installed templates\n(b)Open\n(c)Installed Themes and Blank Presentation\n(d)both (a) and (c) above\n4.Which of the following views is shown in the presentation\nof slides in a conference?\n(a)Slide view\n(b)Slide Sorter view\n(c)Outline view\n(d)Slide Show view\n9.8 WORKING WITH TEXT\nYou can work with text to communicate your ideas to your\naudience.  PowerPoint gives you several ways to insert, edit, and\nformat text for your presentations.\n9.8.1 Inserting Text\nYou can insert text by using the outlining or inserting text boxes.\nOutline Text:  The outline text can be used to create slides of a\nsimilar nature.  By using the Outlining toolbar, you can create\nheads, lists, and paragraphs.  PowerPoint uses the format of your\noutline to correctly insert text in a slide.  Heading 1 becomes the\ntitle of a slide, heading 2 becomes the first line of the text box,"
    },
    {
      "pageNumber": 246,
      "content": "Creating  Presentation  ::  225\nand so on.  When you select a predefined layout and switch over\nto Outline view as explained earlier, you can see the Outline text\noptions on the left side window.  To choose Outlining toolbar,\nselect the Outline pane next to the slide pane on left side below\nthe menu bar.\nText Boxes:  The text boxes are the way that PowerPoint puts\ntext on a slide.  When you create a slide, and use a specific slide\nlayout, the slide will have one or more text boxes in it.  Simply\nclick on the existing text to add new text.\nIf you want to add a new text box to the slide, select Insert\n→→\n→→\n→Text\nBox command on the menu bar and then draw the text box with\nthe mouse at a place where you want to insert the text box.\nIf you want to resize a text box, follow the steps given below:\n1.Select the text box you wish to resize by clicking on it with\nthe mouse.  A border with eight handles will appear around\nthe text box.  The four handles on the corners will resize\nthe length and width of the box at once while the handles\non the sides will resize only in one direction.\n2.Click one of the handles as per your requirement and drag\nit with the mouse.  Release the mouse button when it is the\nsize you want to be.  Move the text box by clicking and\ndragging the thick dotted border with the mouse.\nIf you want to delete a text box from a template, simply click the\nborder of the text box, and then press the DELETE key on the\nkeyboard.\n9.8.2 Formatting Text\nFormat Fonts: Select the text that will be formatted by\nhighlighting the text either on the outline or on the slide. You can\nselect from Home\n→→\n→→\n→Font menu bar or right click on the\nhighlighted selection and select the Font menu from the popup\nshortcut menu. Select a font face, size, style, effect, and color from\nthe Font dialog box."
    },
    {
      "pageNumber": 247,
      "content": "226  ::  Data  Entry  Operations\nFig. 9.18\nReplace Fonts: Design templates have a preset font that you may\nwant to change or you may want to change the font used on for\nthe entire presentation for a number of reasons. This can be\naccomplished quickly using the Replace Fonts feature. Select\nHome\n→→\n→→\n→Replace\n→→\n→→\n→Replace Fonts from the menu bar. Choose the\nfont you want to Replace from the first drop-down menu and the\nfont it should be replaced With from the second menu, and click\nthe Replace button."
    },
    {
      "pageNumber": 248,
      "content": "Creating  Presentation  ::  227\nFig. 9.19\nLine Spacing: Change the amount of space between lines in a\ntext box by selecting Home\n→→\n→→\n→Line Spacing from the Paragraph\nmenu bar.\nlLine spacing - Select the amount of vertical space between\nlines. A value of \"1\" is equal to single spacing and \"2\" is\ndouble spacing. Values between and above these numbers\nare valid as well."
    },
    {
      "pageNumber": 249,
      "content": "228  ::  Data  Entry  Operations\nChange Case: Change the case of the characters in a paragraph\nby selecting Home\n→→\n→→\n→Change Case from the Font menu bar\nwithout having to retype the text.\nFig. 9.20\nlSentence case - Capitalizes the first letter of the first word\nin each sentence.\nlLowercase and Uppercase - Changes the case of all the\nletters.\nlTitle case - Capitalizes the first letter of every word and\nreduces the rest to lowercase."
    },
    {
      "pageNumber": 250,
      "content": "Creating  Presentation  ::  229\nlToggle case - The opposite of Title case, it makes the first\nletter of every word lowercase and capitalizes the remaining\nletters.\nBulleted Lists on Design Templates: Bulleted lists allow you to\nclearly display the main points of your presentation on slides. The\ntext boxes on design templates already include bulleted lists.\nClick the placeholder on the slide to begin adding text and press\nthe ENTER key to return to the next line and add a new bulleted\nitem. To go to the next line without adding another bullet, hold\ndown the SHIFT key while pressing ENTER.\nBulleted List from a Text Box: If you are not creating a bulleted\nlist from an existing placeholder on a design template, or if you\nwould like to add an additional bulleted list, follow these steps\nto create a new list:\n1.In slide view, create a text box by selecting Insert\n→→\n→→\n→Text\nBox from the menu bar.\n2.\"Draw\" the text box on the slide by holding down the left\nmouse button while you move the mouse until the box is\nthe size you want it.\n3.Choose the Bullets or Numbering from the Home \n→→\n→→\n→\nParagraph menu bar.\n4.Change the Size of the bullet by changing the percentage\nin relation to the text.\n5.Choose a color for the bullet from the Color menu. Click\nMore Colors for a larger selection.\n6.Select one of the bullet types shown and click OK.  Or click\nthe Picture button to view the Picture Bullet window.\nSelect one of the bullets and click OK.  Or click the\nCharacter button to select any character from the fonts on\nthe computer. Select a symbol font such as Wingdings or\nWebdings from the Bullets from drop-down menu for the\nbest selection of icons. Click on the characters in the grid\nto see them larger. Click OK when you have chosen the\nbullet you want to use."
    },
    {
      "pageNumber": 251,
      "content": "230  ::  Data  Entry  Operations\nFig. 9.21\nFig. 9.22"
    },
    {
      "pageNumber": 252,
      "content": "Creating  Presentation  ::  231\nBulleted Lists and New Slides from an Outline: In Normal or\nOutline view, text can easily be entered in the outline window\nand new slides are automatically added. Follow the steps below\nto become familiar with adding slide content in Outline view:\n1.Next to the Slide 1 icon, type the title of the slide. The text\nyou type beside the slide icons will be the large-type titles\non each slide.\n2.Press  ENTER  key  to  type  the  next  line.  This  will\nautomatically create a new slide. To create a bulleted list\nfor the first slide, press the TAB key or ALT+SHIFT+Right\nArrow keys to demote the selection to a bulleted list item.\n3.Continue entering text for the bulleted list, pressing ENTER\nkey at the end of each line to create a new bullet.\n4.Create a multilevel list by executing the above action again\nto create a bulleted sublist. Press ALT+SHIFT+Left Arrow\nkeys to return to the original list.\n5.Continue creating new slides and bulleted lists by using the\nabove actions until the presentation is completed. Use the\nformatting instructions below to format the lists.\nIf there is more than one bulleted list on the slide, the lists will\nbe designated by numbers enclosed in black boxes. The example\nbelow shows the slide created from the outline on the left. The\nbulleted list on the left side of the slide is labeled list \"1\" on the\noutline and the list on the right is labeled list \"2\". When typing\nthe outline, begin typing in the new list by pressing CTRL+ENTER\nkeys.\nNumbered List: Follow these steps to create a numbered list:\n1.Create a text box.\n2.With the text box selected, choose Home Paragraph\n → →\n → →\n →\nNumbering from the menu bar.\n3.Click the Numbered tab at the top of the Bullets and\nNumbering window.\n4.Change the size of the numbers by changing the percentage\nin relation to the text.\n5.Choose a color for the numbers from the Color menu. Click\nMore Colors for a larger selection.\n6.Change the Start at value if the numbers should not begin\nwith 1.\n7.Select one of the seven list types shown and click OK."
    },
    {
      "pageNumber": 253,
      "content": "232  ::  Data  Entry  Operations\nFig. 9.23\nFig. 9.24"
    },
    {
      "pageNumber": 254,
      "content": "Creating  Presentation  ::  233\n9.8.3 Text Box Properties\nYou can change the colors, borders, and backgrounds of a text\nbox with help of the Format AutoShape dialog box.\n1.Activate the textbox by clicking on it, and then select\nFormat Shape command on the menu bar.   The Format\nShape dialog box appears.\n2.Under the Fill menu, you can choose the color that will fill\nthe   background   of   the   text   box.   Check   the\nSemitransparent box if you want the slide background to\nshow through the color.\n3.Select Line color that will surround the box with Solid or\nGradient for the color of the line.\n4.Select Line Style for the Style or Weight for the thickness\nof the line and a Dashed property if the line should not be\nsolid.\n5.Select Shadow for pre-set shadow styles for your text box\n6.Select 3D Format and 3D Rotation for 3D effect for your\ntext box\n7.Change the text layout from Text Box tab to reposition the\ntext within the text box.\n8.Click Close to add the changes to the text box.\n9.8.4 Adding Notes\nFrom Normal View, notes can be added to the slide. These notes\nwill not be seen on your presentation, but they can be printed\nout on paper along with the slide the notes refer to by selecting\nPrint What: Notes Pages on the Print menu.\nFig. 9.25"
    },
    {
      "pageNumber": 255,
      "content": "234  ::  Data  Entry  Operations\n9.8.5 Spell Check\nPowerPoint provides many ways to make sure that the text in your\npresentations is correct.  You can check spelling, catch style\nerrors, and use custom dictionaries.\nCorrect  the  spelling  in  the  presentation  by  selecting\nReview\n→→\n→→\n→Spelling command on the menu bar or by pressing the\nF7 key on the keyboard.\n1.The spell checker will prompt you to make corrections of\nthe first word that is spelled wrong.\n2.If the word is spelled correctly, click Ignore or Ignore All if\nthe  same  word  appears  several  times  during  the\npresentation. If this word will appear in many presentations\n(such as your name), click Add to add the word to the\ndictionary and you won't be prompted by a misspelling\nagain.\n3.If the word is spelled wrong, highlight one of the Suggestions\nor type your own revision in the Change to box. Click\nChange to correct this occurrence of the word or Change\nAll to correct all occurrences of the word in the presentation.\n4.Click Close to abort the spelling check early.\n5.When the spell checker has read through the entire\npresentation, you will be prompted by a window telling you\nthat the spelling check is complete. Click OK.\n9.9  SAVING AND PRINTING\nYou can save your presentation slides as a file in a folder.  You\ncan also save the slides as Web page so that you can post them\non Internet.  Printing is similar to what you have done in Word\nand Excel.  Remember to set up your page before saving or\nprinting your presentation slides.\n9.9.1 Page Setup\nSelect Office button\n→→\n→→\n→Print Preview from the menu bar to access\noptions for printing the presentation slides. Select the format the\nprinted slides will be used for from the"
    },
    {
      "pageNumber": 256,
      "content": "Creating  Presentation  ::  235\nSlides drop-down menu.\nFig. 9.26\n9.9.2 Save as File\nTo save your presentation slides as a file, select Office\nbutton\n→→\n→→\n→Save As command on the menu bar or simply click on\nthe Save button on the toolbar on top. The Save As dialog box\nappears. Choose the folder and drive that your file will be located,\ntype the name of the file, and then click Save in the Save As dialog\nbox."
    },
    {
      "pageNumber": 257,
      "content": "236  ::  Data  Entry  Operations\nFig. 9.27\n9.9.3 Save as Web Page\nPresentations can be saved by selecting Office button\n→→\n→→\n→Save As\ncommand on the menu bar as explained earlier. However, if you\nwant to post PowerPoint presentations on the Internet, you may\nwant to save them as Web pages so that the visitors to your web\nsite can view the presentation even if they do not have PowerPoint\ninstalled on their computers. Select Office\n→→\n→→\n→Save As and select\nWeb Page command from the drop down. Choose your web page\ndirectory on the network from the Look in: drop-down menu and\nname the file in the File name: box. Click Save to save the\npresentation in web format."
    },
    {
      "pageNumber": 258,
      "content": "Creating  Presentation  ::  237\nFig. 9.28\n9.9.4 Print\nSelect Office button\n→→\n→→\n→Print command on the menu bar to print\nthe presentation.  The Print dialog box appears.  Choose the\nfollowing options in the Print box.\nPrint range - Select All to print all the slides in the presentation,\nCurrent slide to print only the current slide, or enter slide\nnumbers in the Slides field to print only certain slides.\nCopies - Enter the number of copies of each slide specified in\nPrint range and check the Collate box if necessary."
    },
    {
      "pageNumber": 259,
      "content": "238  ::  Data  Entry  Operations\nPrint What -\nlSlides - prints a full-page slide on each page.\nlHandouts - prints as many slides as you designate on each\npage.\nlNotes Page - prints one slide with that slide's notes on each\npage\nlOutline view - prints the outline of the presentation\nClick OK to print.\nFig. 9.29\n9.10 CLOSE A DOCUMENT\nTo close the current presentation slides file, select Office\nbutton\n→→\n→→\n→Close command on the menu bar.  If the file contains"
    },
    {
      "pageNumber": 260,
      "content": "Creating  Presentation  ::  239\nany unsaved changes, you will be prompted to save the file before\nclosing.\n9.11 EXIT POWERPOINT PROGRAM\nWhen finished your work in PowerPoint and closed all the files,\nyou can quite the PowerPoint program by selecting Office\nbutton\n→→\n→→\n→Exit PowerPoint command on the menu bar.\n9.12 KEYBOARD SHORTCUTS\nKeyboard shortcuts can save time and the effort of switching from\nthe keyboard to the mouse to execute simple commands. Print\nthis list of Power Point keyboard shortcuts and keep it by your\ncomputer for a quick reference.\nNote: A plus sign indicates that the keys need to be pressed at the same time."
    },
    {
      "pageNumber": 261,
      "content": "240  ::  Data  Entry  Operations\nINTEXT QUESTIONS\n5.(i)How do you move from one slide to another slide?\n(a)Using Scroll bars\n(b)Using Next Slide and Previous slide buttons\n(c)Using outline pane\n(d)All of the above\n(ii)How do you insert text in a slide?\n(a)Using outline text\n(b)Inserting text boxes\n(c)Right clicking\n(d)(a) and (b) above\n(iii)You can add notes to your slides from:\n(a)Slide Sorter view\n(b)Normal view\n(c)Slide Show view\n(d)(a) and (b)\n(iv)Text can be easily inserted into the slides using:\n(a)Normal view\n(b)Outline view\n(c)Slide Sorter view\n(d)(a) and (b) above\n9.13 WHAT YOU HAVE LEARNT\nIn this lesson you learnt about the creation of a PowerPoint\npresention. You can create a presentation through Autocontent\nWizard or Design Template or blank presentation. The first two\ntypes allow you to present text in a standard format. On the other\nhand, Blank Presentation is more flexible and you can make your\nown design. After creation of the presentation slides, you can go\nfor a slide show and also take a print out."
    },
    {
      "pageNumber": 262,
      "content": "Creating  Presentation  ::  241\n9.14 TERMINAL QUESTIONS\n1.Explain any three features of PowerPoint.\n2.Explain any one method of creating a presentation.\n3.Write two  ways of changing the view to slide show view.\n4.Explain steps in inserting a text box in a slide.\n5.How do you change the amount of space between lines in\na text box?\n6.How do you insert picture bullets in slides?\n7.How do you add notes to your slides?\n9.15 FEEDBACK TO INTEXT QUESTIONS\n1.(a)True, (b) False, (c) False\n2.(c)9\n3.(d)Installed Themes, Installed Templates and Blank\nPresentation\n4.(d)Slide Show View\n5.(i)(d)Using Scroll bars, using Next Slide and Previous Slide\nbuttons, and using  Outline pane.\n(ii)(d)Using Outline text and inserting text boxes.\n(iii)(b)Normal View.\n(iv)(d)Normal view and Outline view."
    }
  ]
}